Repository: multitheftauto/mtasa-blue
Catalog: Shared/data/MTA San Andreas/MTA/locale/*/client.po
Languages: de, et, hr, hu, it, ja, lt, lv, mk, nl, pl, pt_br, ro, ru, sk, sl, sv, uk

source: Some settings will be changed when you disconnect the current server
de: Einige Einstellungen werden geändert, sobald du den derzeitigen Server verlässt
hr: Neke postavke će se promijeniti kada se odspojite s trenutnog servera
hu: Néhány beállítás megváltozik, amikor lecsatlakozol a jelenlegi szerverről
ja: サーバーとの接続を切ってから、ある設定が変わる
lt: Kai kurie nustatymai bus pakeisti kai atsijungsite iš serverio
lv: Daži uzstādījumi tiks mainīti, kad atslēgsieties no servera
mk: Некои поставки ќе бидат сменети кога ќе се дисконектирате од серверот
pl: Niektóre ustawienia zostaną zmienione dopiero gdy rozłączysz się z serwerem
pt_br: Algumas configurações serão alteradas quando você se desconectar do servidor atual
ru: Некоторые настройки изменятся после отключения от этого сервера
uk: Деякі налаштування зміняться після відключення від цього сервера

source: Do you want to disconnect now?
de: Möchtest du die Verbindung jetzt trennen?
hr: Želite li se odspojiti sada?
hu: Újraindítod most?
ja: 今、切断しますか？
lt: Ar norite atsijungti dabar?
lv: Vai vēlaties atslēgties?
mk: Дали сакате да се дисконектирате сега?
pl: Czy chcesz teraz rozłączyć się z serwerem?
pt_br: Deseja se desconectar agora?
ru: Вы хотите отключиться?
uk: Ви хочете від'єднатися?

source: DISCONNECT REQUIRED
de: VERBINDUNG MUSS GETRENNT WERDEN
hr: ODSPAJANJE POTREBNO
hu: LECSATLAKOZÁS SZÜKSÉSES
ja: 切断必要
lt: ATSIJUNGIMAS BŪTINAS
lv: Nepieciešams atslēgties
mk: ДИСКОНЕКТИРАЊЕ Е ЗАДОЛЖИТЕЛНО
pl: WYMAGANE ROZŁĄCZENIE Z SERWEREM
pt_br: Desconexão necessária
ru: НЕОБХОДИМО ОТКЛЮЧИТЬСЯ
uk: НЕОБХІДНО ВІД'ЄДНАТИСЯ

source: Joypad not detected - Check connections and restart game
de: Joypad konnte nicht gefunden werden - Überprüfe die Verbindung und starte das Spiel erneut
et: Joypadi ei avastatud - Kontrolli ühendusi ja taaskäivita mäng
hr: Joypad nije detektiran - Provjerite veze i ponovno pokrenite igru
hu: Joypad nem érzékelhető - Ellenőrizd hogy csatlakoztatva van-e és indítsd újra a játékot
it: Joypad non rilevato - Controlla la connessione e riavvia il gioco
ja: ジョイパッドはつながっていません - 接続をチェックして、ゲームを再起動してください
lt: Valdymo pultas nerastas - Patikrinkite jungtis ir perkraukite žaidimą
lv: Joypad nav atrasts - Pārbaudiet savienojumu un restartējiet spēli
mk: Joypad не е детектиран ~ ~-~ ~Проверете ја конекцијата и рестартирајте ја играта
nl: Joypad niet gevonden - Check de connecties en herstart het spel
pl: Nie wykryto gamepada - Sprawdź, czy jest podłączony do komputera i uruchom grę ponownie
pt_br: O controle não foi encontrado - Verifique as entradas do computador e reinicie o jogo
ro: Joypad nedetectat - Verifică conexiunile și repornește jocul
ru: Джостик не найден. Проверьте, подключен ли он и перезапустите игру
sk: Joypad nebol nájdený - Skontrolujte pripojenie a reštartujte hru
sl: Igralna konzola ni bila najdena - Preverite priključke in ponovno zaženite igro
sv: Handkontroll ej detekterad - Kontrollera anslutningar och starta om spelet
uk: Не знайдено джойстик. Перевірте, чи під'єднаний він та перезавантажте гру

source: Binding axis
de: Achse zuweisen
et: Siduv telg
hr: Povezna os
hu: Tengely bindelése
it: Associazione assi
ja: 軸の割り当て
lt: Priskiriama ašis
lv: Saistīt asis
mk: Сврзувачки оски
nl: as koppelen
pl: Przypisywanie osi
pt_br: Vinculando o analog
ro: Axe de legătură
ru: Настройка осей
sl: Os funkcij tipk
sv: Binder axel
uk: Налаштування осей

source: Move an axis to bind, or escape to clear
de: Bewege eine Achse zum Belegen, oder drücke Escape um abzubrechen
et: Liiguta telge, et bindida või ärge liigutage midagi, et puhastada
hr: Pomakni os za povezivanje, ili escape za brisanje
hu: Mozgasd a tengelyt, hogy beállítsd vagy nyomj esc-et
it: Muovi un asse per associarlo, oppure ESC per annullare
ja: 軸を動かして、割り当てます。または、ESCを押してクリアしてください。
lt: Pajudinkite ašį priskirimui, arba ESC išvalymui
lv: Pakustiniet asi, lai savienotu, vai esc, lai iztīrītu
mk: Премести оска до сврзување, или притисни ескејп за да исклучиш
nl: Beweeg een as om te koppelen, of druk escape om te wissen
pl: Porusz gałką aby przypisać, lub wciśnij klawisz Escape aby wyczyścić
pt_br: Mova o analog para vinculá-lo ou pressione Esc para limpar o campo
ro: Mișcă o axă pentru a atașa sau apasă Esc pentru a anula
ru: Перемещайте джойстик для настройки или escape для очистки
sl: Premakni os na funkcijo tipke, ali izhod za izbris
sv: Rör en axel för att binda, eller tryck på escape för att nollställa
uk: Переміщайте джойстик для налаштування або escape для очищення

source: Language:
de: Sprache:
et: Keel:
hr: Jezik:
hu: Nyelv:
it: Lingua:
ja: 言語:
lt: Kalba:
lv: Valoda:
mk: Јазик:
nl: Taal:
pl: Język:
pt_br: Idioma:
ro: Limbă:
ru: Язык:
sk: Jazyk:
sl: Jezik:
sv: Språk:
uk: Мова:

source: Skin:
et: Välimus:
hu: Megjelenés:
ja: スキン:
lt: Išvaizda:
lv: Motīvs:
mk: Скин:
nl: Thema:
pl: Skórka:
pt_br: Tema:
ro: Temă:
ru: Тема:
sl: Koža:
sv: Skal:
uk: Тема:

source: Presets:
de: Voreinstellungen:
et: Valmisseadistus:
hr: Podešenja:
hu: Beállítások:
it: Preimpostazioni:
ja: プリセット:
lt: Ruošiniai:
lv: Iepriekšējie:
mk: Стабилизатор:
nl: Voorinstellingen:
pl: Zestaw ustawień:
pt_br: Tema:
ro: Preconfigurări:
ru: Предустановки:
sk: Prednastavenia:
sl: Prednastavitve:
sv: Förinställningar:
uk: Передвстановлення:

source: Chat
et: Vestlus
hr: Čavrljanje
ja: チャット
lt: Kalb. langas
lv: Sarakste
mk: Чат
pl: Czat
ru: Чат
sl: Klepet
sv: Chatt
uk: Чат

source: Load
de: Laden
et: Lae
hr: Učitaj
hu: Betöltés
it: Carica
ja: 読み込み
lt: Įkelti
lv: Ielādēt
mk: Вчитај
nl: Laad
pl: Wczytaj
pt_br: Carregar
ro: Încărcare
ru: Загрузить
sk: Načítať
sl: Naloži
sv: Ladda
uk: Завантажити

source: Colors
hu: Színek
lt: Spalvos
mk: Бои
pt_br: Cores
uk: Кольори

source: Layout
hr: Izgled
hu: Elrendezés
ja: 設計
lt: Išsidėstymas
lv: Izkārtojums
mk: Распоред
pl: Układ
ru: Макет чата
uk: Макет чату

source: Options
hu: Beállítások
lt: Nustatymai
mk: Опции
pt_br: Opções
uk: Параметри

source: Chat Background
hu: Chat háttér
lt: Susirašinėjimo Fonas
mk: Позадина на чатот
pt_br: Fundo do Bate-papo
uk: Тло чату

source: Chat Text
et: Chati tekst
hr: Tekst Čavrljanja
hu: Chat Szöveg
it: Testo chat
ja: チャットテキスト:
lt: Kalb. lango tekstas
lv: Sarakstes Teksts
mk: Чат текст
nl: Chat Tekst
pl: Tekst czatu
pt_br: Texto
ro: Text chat
ru: Текст чата
sk: Text chatu
sl: Besedilo klepeta
uk: Текст чату

source: Input Background
hu: Bemenet háttere
lt: Įvedimo Fonas
mk: Внесување на позадина
pt_br: Fundo da entrada do Bate-papo

source: Input Text
de: Eingabetext
et: Sisestuskasti tekst
hr: Ulazni Tekst
hu: Beviteli Szöveg
it: Testo input
ja: インプットテキスト
lt: Įvesties lango tekstas
lv: Ievades Teksts
mk: Влезен Текст
nl: Invoer Tekst
pl: Tekst wejścia
pt_br: Texto de Entrada
ro: Text intrare
ru: Цвет строки ввода
sk: Vstupný text
sl: Vnesi besedilo
sv: Inmatningstext
uk: Колір рядка введення

source: Lines:
de: Zeilen:
et: Ridu:
hr: Linije:
hu: Sorok:
it: Linee:
ja: ライン数:
lt: Linijos:
lv: Līnijas:
mk: Линии:
nl: Regels:
pl: Wiersze:
pt_br: Linhas:
ro: Linii:
ru: Строки:
sk: Riadky:
sl: Vrstice:
sv: Rader:
uk: Рядки:

source: Scale:
de: Größe:
et: Suurus:
hr: Skaliranje:
hu: Méretezés:
it: Scala:
ja: 拡大縮小:
lt: Dydis:
lv: Mērogs:
mk: Скала:
nl: Schaal:
pl: Skala:
pt_br: Escala:
ro: Scală:
ru: Масштаб:
sk: Mierka:
sl: Merilo:
sv: Skala:
uk: Масштаб:

source: Width:
de: Breite:
et: Laius:
hr: Širina:
hu: Szélesség:
it: Larghezza:
ja: 幅:
lt: Ilgis:
lv: Platums:
mk: Ширина:
nl: Breedte:
pl: Szerokość:
pt_br: Largura:
ro: Lățime:
ru: Ширина:
sk: Šírka:
sl: Širina:
sv: Bredd:
uk: Ширина:

source: Size
hu: Méret
lt: Dydis
mk: Големина
pt_br: Tamanho
uk: Величина

source: after
de: nach
et: pärast
hr: poslije
hu: Ennyi után
it: dopo
ja: あと
lt: po
lv: pēc
mk: после
nl: na
pl: po
pt_br: depois de
ro: după
ru: после
sk: po
sl: potem
sv: efter
uk: після

source: for
de: für
et: jaoks
hr: za
hu: Ennyi alatt
it: per
ja: の
lt: kitoms
lv: priekš
mk: за
nl: voor
pl: do
pt_br: por
ro: pentru
ru: за
sk: pre
sl: za
sv: för
uk: за

source: sec
de: sek
et: sek
hr: sek
hu: mp
it: secondi
ja: 秒
lt: sek
lv: sek
mk: секунда
pl: sek
pt_br: seg
ro: secunde
ru: сек
sk: sek
sl: sekunda
sv: sek
uk: сек

source: Fading
hr: Blijeđenje
hu: Halványulás
ja: 薄れ
lt: Blukimas
lv: Ieslīdēšana
mk: Избледнување
pl: Cieniowanie
pt_br: Desaparecimento gradual
ru: Затухание
uk: Згасання

source: Fade out old lines
de: Alte Zeilen ausfaden
et: Eemalda vanad read
hr: Postepeno blijedi stari tekst
hu: Régi sorok elhomályosítása
it: Dissolvi linee vecchie
ja: 古いラインをフェードアウトする
lt: Paslėpti senas eilutes
lv: Izgaisināt vecās līnijas
mk: Да исчезнат старите линии
nl: Oude tekstregels vervagen
pl: Usuwaj stare wiersze
pt_br: Esconder textos antigos
ro: Estompează liniile vechi
ru: Затухание сообщений
sk: Skryť staré riadky
sl: Pobledi stare proge
sv: Tona ut gamla linjer
uk: Згасання повідомлень

source: Horizontal:
hu: Horizontálisan:
lt: Horizontalus:
mk: Хоризонтално:
uk: Горизонтально:

source: Vertical:
hu: Vertikálisan:
lt: Vertikalus:
mk: Вертикално:
uk: Вертикально:

source: Text-Align:
hu: Szöveg elrendezés:
lt: Teksto Lygiavimas:
mk: Текст-Порамнување:
pt_br: Alinhamento do texto:

source: X-Offset:
hu: X-Eltolás:
lt: X-Kompensacija:
mk: X-офсет:
pt_br: Offset-X:

source: Y-Offset:
hu: Y-Eltolás:
lt: Y-Kompensacija:
mk: Y-офсет:
pt_br: Offset-Y:

source: Position
hu: Pozíció:
lt: Pozicija
mk: Позиција
pt_br: Posição

source: Center
hu: Közép
lt: Centre
mk: Центар
pt_br: Centro

source: Top
hu: Fent
lt: Viršuj
mk: Врв
pt_br: Topo
uk: Верх

source: Bottom
hu: Lent
lt: Apačioj
mk: Дно
pt_br: Inferior
uk: Низ

source: Font
hu: Betűtípus
lt: Šriftas
mk: Фонт
pt_br: Fonte
uk: Шрифт

source: Hide background when not typing
de: Hintergrund verstecken, sofern nicht getippt wird
et: Peida taust kui ei kirjuta
hr: Sakrij pozadinu kada se ne tipka
hu: Háttér elrejtése amikor nem írsz
it: Nascondi lo sfondo mentre non si scrive
ja: 書いていない時に背景を隠す
lt: Paslėpti foną, kai nėra rašoma
lv: Paslēpt fonu, ja neraksta
mk: Сокриј во позадина кога не пишуваш
nl: Achtergrond verbergen wanneer men niet typt
pl: Ukryj tło gdy tekst nie jest wpisywany
pt_br: Esconder o fundo enquanto não estiver digitando
ro: Ascunde fundalul când nu tastezi
ru: Отображать задний фон только при вводе
sk: Skryť pozadie keď nepíšem
sl: Skrij ozadje ko ne tipkam
sv: Göm bakgrund när man inte skriver
uk: Відображати тло тільки при введенні

source: Nickname completion using the "Tab" key
de: Nicknamen Vervollständigung mit Tab
hr: Nadopunjavanje nadimaka koristeći "Tab" tipku
hu: Játékosnevek listázása a "Tab" gombbal
ja: 「タッブ」キーでニック完成する
lt: Slapyvardžio užbaigimas paspaudus "Tab" mygtuką
lv: Nika pabeigšana izmantojot 'TAB' pogu
mk: Завршување на името притиснувајќи го копчето "Tab"
pl: Autouzupełnianie nicków używając klawisza "Tab"
pt_br: Completar apelido de jogadores usando a tecla "Tab"
ru: Вставлять ник по кнопке "Tab"
uk: Вставляти нікнейм по кнопці "Tab"

source: Allow server to flash the window
de: Blinken des Fensters durch Server erlauben
hr: Dopusti serveru treperenje prozora
hu: Ablak villogás engedélyezése
ja: サーバーをウィンドウフラッシュするのを有効する
lt: Leisti serveriui tvykstelėti langą
lv: Atļaut serverim iemirdzināt logu
mk: Дозволи серверот да го осветли прозорот
pl: Pozwól serwerowi migać oknem
pt_br: Permitir que o servidor pisque a janela
ru: Разрешить серверу моргать окном приложения
uk: Дозволити серверу кліпати вікном додатка

source: Allow tray balloon notifications
hr: Dozvoli obavijesti alatne trake
hu: Asztali értesítések engedélyezése
ja: トレイ通知を有効する
lt: Leisti 'tray balloon' pranešimus
lv: Atļaut paziņojumus Windows vidē
mk: Дозволи нотификации во вид на балон
pl: Zezwalaj na powiadomienia w zasobniku systemowym
pt_br: Permitir notificações do balão da bandeja
ru: Показывать сообщения в области уведомлений
uk: Показувати повідомлення в області повідомлень

source: Chat text black/white outline
hu: Chat fekete/fehér körvonal
lt: Susirašinėjimo teksto juodos/baltos kontūras
mk: Чат текст црно/бел надворешен
pt_br: Borda preto/branca do texto do bate-papo

source: Press a key to bind, or escape to clear
de: Drücke eine Taste zum Belegen, oder drücke Escape um abzubrechen
et: Vajutage nuppu, et bindida, või ärge tehke midagi, et puhastada
hr: Pritisni tipku za povezivanje, ili escape za brisanje
hu: Nyomj egy gombot a bindeléshez, hogy beállítsd vagy nyomj esc-et a törléshez
it: Premi un tasto per associarlo, oppure ESC per annullare
ja: キーを押して、割り当てます。または、ESCを押して、クリアしてください。
lt: Spauskite mygtuką priskyrimui, arba ESC išvalymui
lv: Nospiediet pogu, pie kuras piesaistīt, vai arī esc, lai iztīrītu
mk: Притиснете на копче за да сврзете, или ескејп за да излезете
nl: Druk op een toets om op te slaan, of escape om te wissen
pl: Wciśnij przycisk do przypisania, lub wciśnij klawisz Escape aby wyczyścić
pt_br: Pressione uma tecla para definir o controle ou tecle Esc para limpar o campo
ro: Apasă o tastă pentru a atașa sau apasă Esc pentru a anula
ru: Нажмите клавишу для настройки или escape для очистки
sk: Stlač klávesu pre nabindovanie, alebo stlač Esc pre zrušenie
sl: Pritisnite tipko za spremembo funkcije tipke, ali izhod za izbris
sv: Tryck på en tangent för binda, eller tryck på escape för nollställa
uk: Натисніть клавішу для налаштування або escape для очищення

source: Binding a primary key
de: Primärtaste festlegen
et: Bindin põhilise nupu
hr: Povezivanje primarne tipke
hu: Elsődleges gomb bindelése
it: Associazione tasto primario
ja: 一次キーを割り当てる
lt: Priskiriamas pirminis mygtukas
lv: Saistīt primāro pogu
mk: Сврзување на основен клуч
nl: Primaire toets aan het vastleggen
pl: Przypisywanie przycisku podstawowego
pt_br: Definindo a tecla primária
ro: ATAȘARE TASTĂ PRIMARĂ
ru: Настройка основной клавиши
sk: Bindovanie primárneho tlačidla
sl: Določi funkcijo primarni tipki
sv: Binder en primär tangent
uk: Налаштування основної клавіші

source: Binding a secondary key
de: Sekundärtaste festlegen
et: Bindin sekundaarse nupu
hr: Povezivanje sekundarne tipke
hu: Másodlagos gomb bindelése
it: Associare un tasto secondario
ja: 二次キーを割り当てる
lt: Priskiriamas antrinis mygtukas
lv: Saistīt sekundāro pogu
mk: Сврзување на секундарен клуч
nl: Secundaire toets aan het vastleggen
pl: Przypisywanie przycisku pomocniczego
pt_br: Definindo a tecla secundária
ro: ATAȘARE TASTĂ SECUNDARĂ
ru: Настройка дополнительной клавиши
sk: Bindovanie sekundárneho tlačidla
sl: Določi funkcijo sekundarni tipki
sv: Binder en sekundär tangent
uk: Налаштування додаткової клавіші

source: GTA GAME CONTROLS
de: GTA Steuerung
et: GTA MÄNGU NUPUD
hr: GTA KONTROLE
hu: GTA JÁTÉK IRÁNYÍTÁS
it: CONTROLLI GIOCO DI GTA
ja: GTAゲームコントロール
lt: GTA ŽAIDIMO VALDYMAS
lv: GTA SPĒLES KONTROLES
mk: GTA ИГРАЧКИ КОНТРОЛИ
nl: GTA TOETSEN
pl: STEROWANIE GTASA
pt_br: CONTROLES DO GTA
ro: CONTROALE DE JOC GTA
ru: УПРАВЛЕНИЕ GTA
sk: GTA HERNÉ OVLÁDANIE
sl: UKAZI IGRE GTA
sv: GTA SPELKONTROLLER
uk: УПРАВЛІННЯ GTA

source: MULTIPLAYER CONTROLS
de: Multiplayer Steuerung
et: MITMIKMÄNGU NUPUD
hr: MULTIPLAYER KONTROLE
hu: TÖBBJÁTÉKOS IRÁNYÍTÁS
it: CONTROLLI MULTIPLAYER
ja: マルチプレーヤーコントロール
lt: MTA VALDYMAS
lv: MULTIPLAYER KONTROLES
mk: МУЛТИПЛЕЕР КОНТРОЛИ
nl: MULTIPLAYER TOETSEN
pl: STEROWANIE MTA
pt_br: CONTROLES DO MTA
ro: CONTROALE MULTIPLAYER
ru: УПРАВЛЕНИЕ МУЛЬТИПЛЕЕРА
sk: OVLÁDANIE MULTIPLAYERU
sl: UKAZI VEČIGRALSKEGA NAČINA
sv: MULTIPLAYER KONTROLLER
uk: УПРАВЛІННЯ МУЛЬТИПЛЕЄРУ

source: Your nickname contains invalid characters!
de: Dein Nickname enthält ungültige Zeichen!
et: Teie mängunimi sisaldab ebasobivaid märke!
hr: Vaš nadimak sadrži neispravne znakove!
hu: A felhasználónevedben tiltott karakter van!
it: Il tuo nickname contiene caratteri non validi!
ja: ニックネームに無効な文字が含まれています！
lt: Jūsų slapyvardyje yra netinkamų simbolių!
lv: Jūsu segvārds satur neatļautas rakstzīmes!
mk: Вашето име содржи забранети знаци!
nl: Uw gebruikersnaam bevat verboden tekens!
pl: Twój nick zawiera nieprawidłowe znaki!
pt_br: O seu apelido contém caracteres inválidos!
ro: Numele tău conține caractere invalide!
ru: Ваш никнейм содержит недопустимые символы.
sk: Tvoj nick obsahuje nepovolené znaky!
sl: Vaš vzdevek vsebuje napačne znake!
sv: Ditt användarnamn innehåller ogiltiga tecken!
uk: Ваш нікнейм містить неприпустимі символи.

source: Red:
de: Rot:
et: Punane:
hr: Crveno:
hu: Vörös:
it: Rosso:
ja: R (赤):
lt: Raudona:
lv: Sarkans:
mk: Црвена:
nl: Rood:
pl: Czerwony:
pt_br: Vermelho:
ro: Roșu:
ru: Красный:
sk: Červená:
sl: Rdeča:
sv: Röd:
uk: Червоний:

source: Green:
de: Grün:
et: Roheline:
hr: Zeleno:
hu: Zöld:
it: Verde:
ja: G (緑):
lt: Žalia:
lv: Zaļš:
mk: Зелена:
nl: Groen:
pl: Zielony:
pt_br: Verde:
ro: Verde:
ru: Зелёный:
sk: Zelená:
sl: Zelena:
sv: Grön:
uk: Зелений:

source: Blue:
de: Blau:
et: Sinine:
hr: Plava:
hu: Kék:
it: Blu:
ja: B (青):
lt: Mėlyna:
lv: Zils:
mk: Плава:
nl: Blauw:
pl: Niebieski:
pt_br: Azul:
ro: Albastru:
ru: Синий:
sk: Modrá:
sl: Modra:
sv: Blå:
uk: Синій:

source: Transparency:
de: Transparenz:
et: Läbipaistvus:
hr: Prozirnost:
hu: Átlátszóság:
it: Trasparenza:
ja: 透明:
lt: Permatomumas:
lv: Caurredzamība:
mk: Транспарентност:
nl: Transparantie:
pl: Przezroczystość:
pt_br: Transparência:
ro: Transparență:
ru: Прозрачность:
sk: Priehľadnosť:
sl: Prosojnost:
sv: Genomskinlighet:
uk: Прозорість:

source: Color
hu: Szín
lt: Spalva
mk: Боја
pt_br: Cor
uk: Колір

source: Preview
hu: Előnézet
lt: Peržiūra
mk: Преглед
pt_br: Pré-visualização

source: Please disconnect before changing language
de: Bitte trenne die Verbindung bevor du die Sprache wechselst
hr: Molimo odspojite se prije mijenjanja jezika
hu: Kérlek csatlakozz le mielőtt nyelvet váltasz
ja: 言語を変更する前に、切断してください
lt: Prašome atsijungti prieš pakeičiant kalbą
lv: Lūdzu atslēdzieties pirms maināt valodu
mk: Ве молиме дисконектирајте се пред да го смените јазикот
pt_br: Por favor desconecte antes de mudar o idioma
ru: Пожалуйста, отключитесь перед сменой языка
uk: Будь ласка, від'єднайтеся, перш ніж змінити мову

source: Please disconnect before changing skin
de: Bitte trenne die Verbindung bevor du den Skin änderst
et: Palun katkestage ühendus enne välimuse muutmist
hr: Molimo odspojite se prije mijenjanja skin-a
hu: Kérlek csatlakozz le mielőtt kinézetet váltasz
it: Per favore disconnettiti prima di cambiare skin
ja: スキンを変える前に、切断してください
lt: Prašome atsijungti prieš keičiant išvaizdą
lv: Lūdzu atslēdzieties pirms maināt motīvu
mk: Ве молиме дисконектирајте се пред да го смените скинот
nl: Gelieve de verbinding te verbreken voordat u uw thema verandert
pl: Rozłącz się z serwerem przed zmianą skórki
pt_br: Por favor desconecte antes de mudar de tema
ro: Te rugăm să te deconectezi înainte de a schimba tema
ru: Пожалуйста, отключитесь перед сменой темы
sk: Prosím odpoj sa pred zmenou skinu
sl: Prosimo, da prekinete povezavo, preden spremenite kožo
sv: Avbryt anslutningen innan du ändrar skin
uk: Будь ласка, від'єднайтеся перш ніж змінити тему

source: Volmetric shadows can cause some systems to slow down. Are you sure you want to enable them?
de: Volumetrische Schatten können auf einigen Systemen zu Performanceeinschränkungen führen. Bist du sicher, dass du diese aktivieren möchtest?
et: Volumeetrilised varjud võivad teie süsteemi aeglustada. Oled kindel, et soovid neid lubada?
hr: Volumetrične sjene mogu uzrokovati usporavanje nekih sistema. Jeste li sigurni da ih želite omogućiti?
hu: A volumetrikus árnyék lelassíthatja a számítógéped teljesítményét. Biztos vagy benne hogy bekapcsolod?
it: Le ombre volumetriche possono causare il rallentamento del sistema. Sei sicuro di volerle attivare?
ja: 流量影がOS速度を落とすかもしれません。 有効にしますか。
lt: Volumetriniai šešėliai gali sukelti sunkumų kai kurioms sistemoms. Ar tikrai norite įjungti juos?
lv: Volumektriskās ēnas var palēlināt sistēmas darbīnu. Vai Jūs tik tiešām vēlaties tās iespējot?
mk: Волуметрички сенки може да предизвикаат некои системи да успорат. Дали сте сигурни дека сакате да ги вклучите?
nl: Volumetrische schaduwen kunnen uw systeem vertragen. Weet u zeker dat u deze wil inschakelen?
pl: Cienie pojemnościowe mogą spowodować wolniejsze działanie gry. Czy na pewno chcesz je włączyć?
pt_br: Sombras volumétricas podem causar perda de performance. Você tem certeza que deseja ativar?
ro: Umbrele volumetrice pot cauza probleme pe unele calculatoare. Ești sigur că vrei să le activezi?
ru: Динамические тени могут вызвать падение производительности. Вы уверены, что хотите активировать их?
sk: Odmerné tiene môžu spôsobiť spomalenie niektorých PC. Si si istý že ich chceš zapnúť?
sl: Prostorske sence lahko upočasnijo nekatere sisteme. Ali ste prepričani, da jih želite omogočiti?
sv: Volumetriska skuggor kan göra att vissa system går segt. Är du säker på att du vill aktivera dem?
uk: Динамічні тіні можуть призвести до зниження продуктивності. Ви впевнені, що хочете активувати їх?

source: PERFORMANCE WARNING
de: PERFORMANCE WARNUNG
et: JÕUDLUSE HOIATUS
hr: Volumetrične sjene mogu uzrokovati usporavanje nekih sistema. Jeste li sigurni da ih želite omogućiti?
hu: TELJESÍTMÉNY FIGYELMEZTETÉS
it: PROBLEMA DI PERFORMANCE
ja: リモートウェブサイトを有効する
lt: VEIKIMO ĮSPĖJIMAS
lv: VEIKTSPĒJAS BRĪDINĀJUMS
mk: ПРЕДУПРЕДУВАЊЕ ЗА ПЕРФОМАНСА
nl: PRESTATIE WAARSCHUWING
pl: OSTRZEŻENIE - MOŻLIWY SPADEK WYDAJNOŚCI
pt_br: ATENÇÃO: SUA PERFORMANCE ESTÁ MUITO BAIXA
ro: AVERTISMENT DE PERFORMANȚĂ
ru: ПРЕДУПРЕЖДЕНИЕ ПРОИЗВОДИТЕЛЬНОСТИ
sk: VAROVANIE O VÝKONE
sl: OPOZORILO UČINKOVITOSTI
sv: PRESTANDAVARNING
uk: ПОПЕРЕДЖЕННЯ ПРОДУКТИВНОСТІ
