Repository: multitheftauto/mtasa-blue
Catalog: Shared/data/MTA San Andreas/MTA/locale/*/client.po
Languages: de, et, hr, hu, it, ja, lt, lv, mk, nl, pl, pt_br, ro, ru, sk, sl, sv, uk

source: Invalid nickname! Please go to Settings and set a new one!
de: Ungültiger Nickname! Bitte setze einen neuen in den Einstellungen!
et: Vale mängunimi! Palun mine seadetesse ja vali uus!
hr: Nevaljan nadimak! Molimo idite u postavke i postavite novi!
hu: Helytelen felhasználónév! Kérlek menj a Beállítások menübe és változtasd meg!
it: Nickname non valido! Per favore vai nelle impostazioni e scegline un'altro.
ja: 無効なニックネームです。設定でニックネームを変えてください。
lt: Netinkamas slapyvardis! Prašome eiti į nustatymus ir pasirinkti naują slapyvardį!
lv: Nederīgs segvārds! Lūdzu dodieties uz Uzstādījumiem un uzstādiet citu!
mk: Неважечко име! Ве молиме одете во Опции и впишете ново име!
nl: Ongeldige gebruikersnaam! Gelieve naar Instellingen te gaan en een nieuwe instellen!
pl: Nieprawidłowy nick! Przejdź do Ustawień i wprowadź inny!
pt_br: Apelido inválido! Por favor, entre nas Configurações e mude-o.
ro: Numele ales este invaild! Te rugăm mergi la Setări și setează unul nou!
ru: Неверный никнейм! Пожалуйста, откройте настройки и измените его!
sk: Neplatný nick! Choď do Nastavení a nastav si iný!
sl: Napačen vzdevek! Prosimo pojdite na Nastavitve in si izberite drugega!
sv: Ogiltigt nick! Vänligen gå till inställningar och välj ett nytt!
uk: Невірний нікнейм! Будь ласка, відкрийте налаштування і змініть їх!

source: Screenshot taken: '%s'
de: Bildschirmfoto aufgenommen: '%s'
et: Pilt on tehtud: '%s'
hr: Screenshot uzet: '%s'
hu: Screenshot létrehozva: '%s
it: Screenshot catturato: '%s'
ja: スクリーンショットを撮影: '%s'
lt: Ekranas nufotografuotas: '%s'
lv: Ekrāņšāviņš izveidots: '%s'
mk: Сликата е спремна: '%s'
nl: Screensshot gemaakt: '%s'
pl: Wykonano zrzut ekranu: '%s'
pt_br: Captura de tela pronta: '%s'
ro: Captură de ecran efectuată: '%s'
ru: Скриншот сделан: '%s'
sk: Screenshot zachytený: '%s'
sl: Posnetek zaslona shranjen: '%s'
sv: Skärmdump tagen: '%s'
uk: Знімок зроблено: '%s'

source: SETTINGS
de: EINSTELLUNGEN
et: SEADED
hr: POSTAVKE
hu: BEÁLLÍTÁSOK
it: IMPOSTAZIONI
ja: 設定
lt: NUSTATYMAI
lv: UZSTĀDĪJUMI
mk: ПОСТАВКИ
nl: INSTELLINGEN
pl: USTAWIENIA
pt_br: CONFIGURAÇÕES
ro: SETĂRI
ru: НАСТРОЙКИ
sk: NASTAVENIA
sl: NASTAVITVE
sv: INSTÄLLNINGAR
uk: НАЛАШТУВАННЯ

source: Multiplayer
et: Mitmikmäng
hu: Többjátékos
it: Multigiocatore
ja: マルチプレーヤー
lt: Pagrindinis
lv: Daudzspēlētāju
mk: Мултиплеер
pt_br: Multijogador
ru: Мультиплеер
sl: Večigralski način
sv: Flera spelare
uk: Мультиплеєр

source: Video
hr: Slika
hu: Videó
ja: ビデオ
mk: Видео
pl: Grafika
pt_br: Vídeo
ru: Графика
sl: Video posnetek
sv: Grafik
uk: Графіка

source: Audio
et: Heli
hr: Zvuk
hu: Audió
ja: サウンド
lt: Garsas
lv: Skaņa
mk: Аудио
nl: Geluid
pl: Dźwięk
pt_br: Áudio
ru: Звук
sk: Zvuk
sv: Ljud
uk: Звук

source: Binds
de: Tastenbelegungen
et: Bindid
hr: Povezane kontrole
hu: Bindek
it: Associazioni
ja: 割り当て
lt: Mygtukų priskirimai
lv: Saistības
mk: Сврзувања
nl: Toetsen
pl: Bindy
pt_br: Teclas
ro: Taste
ru: Клавиши
sk: Bindy
sl: Funkcije tipk
sv: Bindningar
uk: Клавіші

source: Controls
de: Steuerung
et: Nupud
hr: Kontrole
hu: Irányítás
it: Controlli
ja: コントロール
lt: Valdikliai
lv: Vadība
mk: Контроли
nl: Besturing
pl: Sterowanie
pt_br: Controles
ro: Controale
ru: Управление
sk: Ovládanie
sl: Nadzor
sv: Kontroller
uk: Управління

source: Interface
et: Kasutajaliides
hr: Sučelje
hu: Felület
it: Interfaccia
ja: インターフェース
lt: Sąsaja
lv: Intrefeiss
mk: Интерфејс
pl: Interfejs
ro: Interfaţă
ru: Интерфейс
sk: Rozhranie
sl: Vmesnik
sv: Gränssnitt
uk: Інтерфейс

source: Web Browser
hr: Internet preglednik
hu: Webböngésző
ja: ウェブブラウザー
lt: Interneto Naršyklė
lv: Interneta pārlūks
mk: Веб пребарувач
pl: Przeglądarka internetowa
pt_br: Navegador de Internet
ru: Браузер
uk: Браузер

source: Advanced
de: Erweitert
et: Täpsemalt
hr: Napredno
hu: Haladó
it: Avanzate
ja: 上級
lt: Išsamiau
lv: Paplašināts
mk: Напредно
nl: Geavanceerd
pl: Zaawansowane
pt_br: Avançado
ro: Avansat
ru: Дополнительные
sk: Pokročilé
sl: Napredno
sv: Avancerat
uk: Додаткові

source: OK
et: Sobib
hr: U redu
lt: Gerai
lv: LABI
mk: Ок
ru: ОК
sl: V redu
uk: ОК

source: Cancel
de: Abbrechen
et: Loobu
hr: Odustani
hu: Mégse
it: Annulla
ja: キャンセル
lt: Atšaukti
lv: Atcelt
mk: Откажи
nl: Annuleren
pl: Anuluj
pt_br: Cancelar
ro: Anulează
ru: Отмена
sk: Zrušiť
sl: Prekliči
sv: Avbryt
uk: Відміна

source: Load defaults
de: Einstellungen zurücksetzen
et: Laadi tavalised
hr: Učitaj zadano
hu: Alapértelmezések betöltése
it: Carica i predefiniti
ja: デフォルトを読み込む
lt: Įkelti numatytuosius
lv: Ielādēt noklusējuma
mk: Стандарно вчитување
nl: Laad standaard
pl: Wczytaj domyślne
pt_br: Redefinir as configurações
ro: Încarcă setările implicite
ru: Восстановить стандартные
sk: Načítať predvolené
sl: Naloži privzete vrednosti
sv: Ladda standardvärden
uk: Відновити стандартні

source: Mouse sensitivity:
de: Mausempfindlichkeit:
et: Hiire tundlikus:
hr: Osjetljivost miša:
hu: Egér érzékenysége:
it: Sensibilità del Mouse:
ja: マウスの感度:
lt: Pelės jautrumas:
lv: Peles jūtīgums:
mk: Сензитивност на маусот:
nl: Muis gevoeligheid:
pl: Czułość myszy:
pt_br: Sensibilidade do mouse:
ro: Sensibilitate mouse:
ru: Чувствительность мыши:
sk: Citlivosť myši:
sl: Občutljivost miške:
sv: Muskänslighet:
uk: Чутливість миші:

source: Vertical aim sensitivity:
de: Vertikale Zielempfindlichkeit:
et: Vertikaalse shitimise tundlikus:
hr: Osjetljivost vertikalnog ciljnika:
hu: Függőleges érzékenység:
it: Sensibilità di mira verticale:
ja: 垂直狙い感度:
lt: Vertikalaus nusitaikymo jautrumas:
lv: Vertikālās mērķēšanas jūtīgums:
mk: Вертикална сензитивност на аимот:
nl: Verticale richting gevoeligheid:
pl: Czułość celowania w pionie:
pt_br: Sensibilidade na mira vertical:
ro: Sensibilitate țintă verticală:
ru: Вертикальная чувствительность прицела:
sk: Citlivosť vertikálneho mierenia:
sl: Občutljivost vertikalnega merjenja:
sv: Vertikal sikteskänslighet:
uk: Вертикальна чутливість прицілу:

source: Mouse options
de: Cursoroptionen
et: Hiire seaded
hr: Postavke miša
hu: Egér beállítások
it: Opzioni del mouse
ja: マウスオプション
lt: Pelės nustatymai
lv: Peles opcijas
mk: Маус опции
nl: Muis opties
pl: Opcje myszy
pt_br: Mouse
ro: Opțiuni mouse
ru: Настройки мыши
sk: Nastavenia myši
sl: Možnosti miške
sv: Musinställningar
uk: Налаштування миші

source: Invert mouse vertically
de: Maus vertikal invertieren
et: Pööra hiirt vertikaalselt
hr: Vertikalno okreni miš
hu: Inverz egér
it: Inverti il mouse verticalmente
ja: マウスを垂直に反転する
lt: Sukeisti pelės vertikalią ašį
lv: Apvērst peli vertikāli
mk: Инвертна вертикалност на маусот
nl: Muis verticaal omkeren
pl: Zamień osie w pionie
pt_br: Inverter mouse verticalmente
ro: Inversează mouseul vertical
ru: Инверсия мыши по-вертикали
sk: Otočiť myš vertikálne
sl: Obrni miško vertikalno
sv: Invertera mus vertikalt
uk: Інверсія миші по вертикалі

source: Steer with mouse
de: Mit der Maus steuern
et: Juhi hiirega
hr: Vozi mišem
hu: Kormányzás az egérrel
it: Sterzo via mouse
ja: マウスで舵を取る
lt: Vairavimas su pele
lv: Stūrēt ar peli
mk: Мрдај со маусот
nl: Met de muis sturen
pl: Używaj myszki do kierowania pojazdami
pt_br: Dirigir com o mouse
ro: Dirijează cu mouseul
ru: Управление транспортом с мыши
sk: Riadiť myšou
sl: Vodi z miško
sv: Styr med mus
uk: Управління транспортом з миші

source: Fly with mouse
de: Mit der Maus fliegen
et: Lenda hiirega
hr: Leti mišem
hu: Repülés az egérrel
it: Volo via mouse
ja: マウスで飛ぶ
lt: Skraidymas su pele
lv: Lidot ar peli
mk: Летај со маусот
nl: Vliegen met de muis
pl: Używaj myszki do sterowania lotem
pt_br: Pilotar com o mouse
ro: Pilotează cu mouseul
ru: Управление полётом с мыши
sk: Lietať myšou
sl: Leti z miško
sv: Flyg med musen
uk: Управління польотом з миші

source: Joypad options
de: Joypadoptionen
et: Joypad valikud
hr: Joypad postavke
hu: Joypad beállítások
it: Opzioni del Joypad
ja: ジョイパッドオプション
lt: Valdymo pulto nustatymai
lv: Joypada opcijas
mk: Joypad опции
nl: Joypad opties
pl: Opcje gamepada
pt_br: Opções do Joypad
ro: Opțiuni joypad
ru: Настройки джойстика
sk: Nastavenia joypadu
sl: Možnosti igralne konzole
sv: Handkontrollsinställningar
uk: Налаштування джойстика

source: Standard controls (Mouse + Keyboard)
de: Standardsteuerung (Maus + Tastatur)
et: Tavalised nupud (Hiirt + Klaviatuur)
hr: Standardne kontrole (Miš + Tipkovnica)
hu: Standard irányítás (Egér + Billentyűzet)
it: Controlli standard (mouse + tastiera)
ja: 普通のコントロール （マウスとキーボード）
lt: Standartinis valdymas (Pelė + Klaviatūra)
lv: Standarta vadība (Pele + Tastatūra)
mk: Стандарни контроли ( Маус + Тастатура)
nl: Standaard toetsen (Muis + Toetsenbord)
pl: Standardowe sterowanie (Mysz + Klawiatura)
pt_br: Padrão (Mouse + Teclado)
ro: Controale standard (Mouse + Tastatură)
ru: Стандартное управление (Мышь + Клавиатура)
sk: Štandardné ovládanie (Myš + Klávesnica)
sl: Standardne kontrole (Miška + Tipkovnica)
sv: Standardkontroller (Mus + Tangentbord)
uk: Стандартне управління (Миша + Клавіатура)

source: Classic controls (Joypad)
de: Klassische Steuerung (Joypad)
et: Klassikalised nupud (Joypad)
hr: Klasične kontrole (Joypad)
hu: Klasszikus irányítás (Joypad)
it: Controlli classici (joypad)
ja: クラシックコントロール (ジョイパッド)
lt: Klasikinis valdymas (Valdymo pultas)
lv: Klasiska vadība (Joypad)
mk: Класични контроли (Joypad)
nl: Klassieke Besturing (Joypad)
pl: Klasyczne sterowanie (Gamepad)
pt_br: Clássico (Joystick)
ro: Controale clasice (Joypad)
ru: Классическое управление (Джойстик)
sk: Klasické ovládanie (Joypad)
sl: Klasične kontrole (Igralna konzola)
sv: Klassiska kontroller (Handkontroll)
uk: Класичне управління (Джойстик)

source: Dead Zone
de: Tote Zone
et: Surnud tsoon
hr: Mrtva Zona
hu: Holtjáték
it: Zona morta
ja: デッドゾーン
lt: Negyvoji Zona
lv: Melnā zona
mk: Мртва Зона
nl: Dode Zone
pl: Martwa strefa
pt_br: Zona Limite
ro: Zonă moartă
ru: Мертвая зона
sk: Mŕtva Zóna
sl: Mrtva cona
sv: Dödszon
uk: Мертва зона

source: Saturation
de: Sättigung
et: Värvilisus
hr: Zasićenje
hu: Telítettség
it: Saturazione
ja: 彩度
lt: Sodrumas
lv: Piesātinājums
mk: Сатурација
nl: Verzadiging
pl: Nasycenie
pt_br: Saturação
ro: Saturație
ru: Насыщенность
sk: Sýtosť
sl: Nasičenost
sv: Mättnad
uk: Насиченість

source: Use the 'Binds' tab for joypad buttons.
de: Den Tab 'Tastenbelegungen' für die Joypadbelegungen nutzen.
et: Kasuta "Binds" vahetahvlit joypadi nuppude joaks.
hr: Koristite 'Povezane kontrole' za joypad tipke.
hu: Használd a 'Bindek' fület a joypad gombok beállításához.
it: Usa la tabella d'associazione per i tasti del joypad.
ja: ジョイパッドボタンを設定するために「割り当て」を使ってください。
lt: Pasirinkite 'Mygtukų priskirimai' valdymo pulto mygtukams.
lv: Izmantojiet 'Saistības' sadaļu priekš joypada pogām.
mk: Употребете го 'Сврзување' табот за joypad копчиња.
nl: Gebruik de 'Binds' tab voor joypad knoppen.
pl: Użyj zakładki 'Bindy' do przycisków gamepada.
pt_br: Vá à aba 'Teclas' para configurar os botões do teclado.
ro: Folosește tabul 'Taste' pentru butoanele joypadului.
ru: Зайдите во вкладку 'Клавиши' для настройки джойстика
sk: Použi záložku 'Bindy' pre tlačidlá joypadu.
sl: Uporabi zavihek 'Funkcije tipk' za gumbe na igralni konzoli.
sv: Använd 'Bindningar' fliken för handkontrollsknappar.
uk: Перейдіть в вкладку 'Клавіші' для налаштування джойстика

source: Left Stick
de: Linker Stick
et: Vasakule kang
hr: Lijeva palica
hu: Bal kar
it: Levetta Sinistra
ja: 左スティック
lt: Kairioji valdymo pulto svirtis
lv: Kreisā
mk: Лев стик
nl: linker Stok
pl: Lewa gałka
pt_br: Eixo Esquerdo
ro: Stickul stâng
ru: Левый стик
sk: Ľavá Páčka
sl: Leva palica
sv: Vänster Spak
uk: Лівий стик

source: Right Stick
de: Rechter Stick
et: Paremale kang
hr: Desna palica
hu: Jobb kar
it: Levetta Destra
ja: 右スティック
lt: Dešinioji valdymo pulto svirtis
lv: Labā
mk: Десен стик
nl: Rechter Stok
pl: Prawa gałka
pt_br: Eixo Direito
ro: Stickul drept
ru: Правый стик
sk: Pravá Páčka
sl: Desna palica
sv: Höger Spak
uk: Правий стик

source: DESCRIPTION
de: BESCHREIBUNG
et: KIRJELDUS
hr: OPIS
hu: LEÍRÁS
it: DESCRIZIONE
ja: 説明
lt: APIBŪDINIMAS
lv: APRAKSTS
mk: ОПИС
nl: BESCHRIJVING
pl: OPIS
pt_br: DESCRIÇÃO
ro: DESCRIERE
ru: ОПИСАНИЕ
sk: POPIS
sl: OPIS
sv: BESKRIVNING
uk: ОПИС

source: KEY
de: TASTE
et: NUPP
hr: TIPKA
hu: GOMB
it: TASTO
ja: キー
lt: MYGTUKAS
lv: POGA
mk: КЛУЧ
nl: TOETS
pl: KLAWISZ
pt_br: TECLA
ro: TASTĂ
ru: КЛАВИША
sk: TLAČIDLO
sl: TIPKA
sv: TANGENT
uk: КЛАВІША

source: ALT. KEY
de: ALT. TASTE
et: ALT. NUPP
hr: ALT. TIPKA
hu: ALT. GOMB
it: TASTO.ALT
ja: Altキー
lt: ALT. MYGTUKAS
lv: ALT. POGA
mk: ALT. Копче
nl: ALT. TOETS
pl: KLAWISZ 2
pt_br: TECLA ALT.
ro: TASTĂ ALTERNATIVĂ
ru: ДОП. КЛАВИША
sk: KLÁVESA ALT
sl: ALT. TIPKA
sv: ALT. TANGENT
uk: ДОД. КЛАВІША

source: Nick:
et: Mängunimi:
hr: Nadimak:
hu: Felhasználónév:
ja: ニックネーム:
lt: Slapyvardis:
lv: Segvārds:
mk: Име:
nl: Bijnaam:
pt_br: Apelido:
ro: Nume:
ru: Никнейм:
sl: Vzdevek:
uk: Нікнейм:

source: Save server passwords
de: Serverpasswörter speichern
et: Salvesta serverite salasõnad
hr: Spremi lozinke servera
hu: Szerver jelszavak elmentése
it: Salva la password del server
ja: サーバーのパスワードを保存する
lt: Išsaugoti serverių slaptažodžius
lv: Saglabāt serveru paroles
mk: Зачувај го пасвордот на серверот
nl: Server wachtwoorden opslaan
pl: Przechowuj hasła do serwerów
pt_br: Salvar senha dos servidores
ro: Salvează parolele severelor
ru: Сохранять пароли серверов
sk: Uložiť heslá k serverom
sl: Shrani gesla strežnikov
sv: Spara serverlösenord
uk: Зберігати паролі серверів

source: Auto-refresh server browser
de: Serverbrowser automatisch aktualisieren
et: Automaatselt värskenda serverite listi
hr: Automatski-osvježi pretraživač
hu: Szerverkereső automatikus frissítése
it: Aggiorna automaticamente la ricerca dei server
ja: サーバーブラウザを自動リフレッシュ
lt: Automatiškai naujinti serverių naršyklę
lv: Automātiskā atjaunošanās serveru pārlūkā
mk: Автоматско-освежување на пребарувачот на сервери
nl: Automatisch serverlijst vernieuwen
pl: Automatyczne odświeżanie przeglądarki serwerów
pt_br: Atualizar automaticamente o navegador
ro: Reîmprospătează automat lista cu servere
ru: Автоматическое обновление списка серверов
sk: Auto-obnova prehliadača serverov
sl: Avtomatično osveži brskalnik strežnikov
sv: Auto-uppdatera serverlista
uk: Автоматичне оновлення списку серверів

source: Allow screen upload
de: Upload von Screenshots erlauben
et: Luba ekraani üleslaadmist
hr: Dopusti upload zaslona
hu: Képfeltöltés engedélyezése
it: Permetti l'upload delle immagini
ja: スクリーンショットを有効する
lt: Leisti siųsti ekrano turinį
lv: Ļaut ekrāna augšupielādi
mk: Дозволи аплоадирање на слика
nl: Schermupload toestaan
pl: Zezwól na wgrywanie zrzutów ekranu
pt_br: Permitir o envio de capturas de tela
ro: Permite trimiterea capturilor de ecran către servere
ru: Разрешить загрузку скриншотов
sk: Povoliť upload obrazovky
sl: Dovoli nalaganje zaslona
sv: Tillåt skärmuppladning
uk: Дозволити завантаження знімків

source: Use customized GTA:SA files
de: Veränderte GTA:SA Dateien verwenden
et: Kasuta muudetud GTA:SA faile
hr: Koristi prilagođene GTA:SA datoteke
hu: Egyéni GTA:SA fájlok használata
it: Usa file personalizzati di GTA:SA
ja: カスタムGTA:SAファイルを利用
lt: Naudoti modifikuotas GTA:SA bylas
lv: Lietot pārveidotos GTA:SA failus
mk: Употреби модифицирани GTA:SA фајлови
nl: Gebruik aangepaste GTA:SA bestanden
pl: Użyj zmienionych plików GTA:SA
pt_br: Usar arquivos modificados do GTA:SA
ro: Foloseşte fişiere GTA:SA modificate
ru: Использовать модифицированные файлы GTA:SA
sk: Používať zmenené GTA:SA súbory
sl: Uporabi spremenjene GTA:SA datoteke
sv: Använd anpassade GTA:SA filer
uk: Використовувати модифіковані файли GTA:SA

source: Map rendering options
de: Kartenrenderoptionen
et: Kaardi laadimise valikud
hr: Postavke učitavanja mape
hu: Map renderelési opciók
it: Opzioni di render della mappa
ja: マップレンダリングオプション
lt: Žemėlapio atkūrimo parinktys
lv: Kartes utilizācijas opcijas
mk: Опции за нацрт на мапа
nl: Map teken opties
pl: Opcje renderowania mapy
pt_br: Opções de renderização do mapa
ro: Opțiuni de redare a hărții
ru: Настройки отображения карты
sk: Možnosti zobrazovania mapy
sl: Možnosti upodabljanja mape
sv: Kartrenderingsalternativ
uk: Параметри відображення карти

source: Opacity:
de: Transparenz:
et: Katvus:
hr: Neprozirnost:
hu: Áttetszőség:
it: Opacità:
ja: 不透明度:
lt: Nepermatomumas:
lv: Caurredzamība:
mk: Непроѕирност:
nl: Opaciteit:
pl: Przezroczystość:
pt_br: Transparência:
ro: Opacitate:
ru: Непрозрачность:
sk: Nepriehľadnosť:
sl: Motnost:
sv: Genomskinlighet:
uk: Непрозорість:

source: Radio volume:
de: Radiolautstärke:
et: Raadio helitugevus:
hr: Jačina zvuka radija:
hu: Rádió hangerő:
it: Volume radio:
ja: ラジオの音量:
lt: Radijo garsumas:
lv: Radio skaļums:
mk: Глас на радиото:
pl: Głośność stacji radiowych:
pt_br: Volume do rádio:
ro: Volum radio:
ru: Громкость радио:
sk: Hlasitosť rádia:
sl: Glasnost radia:
sv: Radio volym:
uk: Гучність радіо:

source: SFX volume:
de: SFX Lautstärke:
et: Mängu helitugevus:
hr: Jačina zvuka efekata:
hu: SFX hangerő:
it: Volume SFX:
ja: SFX音量:
lt: Efektų garsumas:
lv: SFX skaļums:
mk: SFX јачина:
nl: Geluidseffecten volume:
pl: Głośność dźwięków gry:
pt_br: Volume do ambiente:
ro: Volum SFX:
ru: Общая громкость:
sk: Hlasitosť SFX:
sl: Glasnost SFX:
sv: SFX volym:
uk: Загальна гучність:

source: MTA volume:
de: MTA Lautstärke:
et: MTA helitugevus:
hr: Jačina zvuka igre:
hu: MTA hangerő:
it: Volume MTA:
ja: MTA音量:
lt: MTA garsai:
lv: MTA skaļums:
mk: MTA јачина:
pl: Głośność dźwięków MTA:
pt_br: Volume do MTA:
ro: Volum MTA:
ru: Громкость MTA:
sk: Hlasitosť MTA:
sl: MTA glasnost:
sv: MTA volym:
uk: Гучність MTA:

source: Voice volume:
de: Voicelautstärke:
et: Hääle helitugevus:
hr: Jačina zvuka glasa:
hu: Beszéd hangerő:
it: Volume voce:
ja: 声音量
lt: Kalbančiųjų garsumas:
lv: Balss skaļums:
mk: Јачина на гласот:
nl: Stem volume:
pl: Głośność modułu głosowego:
pt_br: Volume da voz:
ro: Volum voce:
ru: Громкость речи:
sk: Hlasitosť hlasu:
sl: Glasnost glasu:
sv: Röst volym:
uk: Гучність мовлення:

source: Play mode:
de: Abspielmodus:
et: Mängu tüüp:
hr: Način igre:
hu: Lejátszási mód:
it: Modalità riproduzione:
ja: プレイモード:
lt: Grojimo režimas:
lv: Spēlēšanas veids:
mk: Вид на игра:
nl: Afspeel modus:
pl: Tryb odtwarzania:
pt_br: Modo de reprodução:
ro: Mod de redare:
ru: Режим воспроизведения:
sk: Hrací mód:
sl: Način igranja:
sv: Spelläge:
uk: Режим відтворення:

source: General
de: Allgemein
et: Üldine
hr: Općenito
hu: Általános
it: Generale
ja: 一般的な設定
lt: Bendra
lv: Vispārējs
mk: Општо
nl: Algemeen
pl: Ogólne
pt_br: Geral
ru: Общие
sk: Hlavné
sl: Splošni
sv: Allmänt
uk: Загальні

source: Radio Equalizer
et: Raadio ekvalaiser
hr: Radijski ujednačivač
hu: Rádió hangszínszabályzó
it: Equalizzatore Radio
ja: ラジオイコライザー
lt: Radijo Glodintuvas
lv: Radio Ekvalaizers
mk: Изедначување на радио
pl: Korektor stacji radiowych
pt_br: Equalizador do Rádio
ro: Egalizator radio
ru: Эквалайзер радио
sk: Rádio Ekvalizér
sl: Radijski izenačevalnik
uk: Еквалайзер радіо

source: Radio Auto-tune
et: Raadio auto-tune
hr: Samopodešavanje radija
hu: Rádió automatikus hangolása
it: Auto sintonizzazione radio
ja: ラジオオートチューン
lt: Autom. radijo derinimas
lv: Radio Automātiskā Uzstādīšana
mk: Автоматско нагодување на радиото
nl: Radio automatisch afstellen
pl: Automatyczne strojenie radia
pt_br: Sintonização automática do Rádio
ru: Автонастройка радио
sk: Auto-ladenie Rádia
sl: Omogoči avtomatično uglaševanje na radiju
sv: Radio Auto-station
uk: Автоналаштування радіо

source: Usertrack options
de: Usertrack Optionen
et: Kasutaja lugude valikud
hr: Postavke korisničkih zapisa
hu: Egyéni zenelista beállítások
it: Opzioni usertrack
ja: ユーザートラックオプション
lt: Įkeltų dainų parinktys
lv: Lietotāja dziesmu opcijas
mk: Кориснички опции
nl: Usertrack opties
pl: Opcje dla odtwarzania dodatkowych utworów muzycznych
pt_br: Configurações do Tocador do Usuário
ro: Opțiuni usertrack
ru: Настройки пользовательской музыки
sk: Možnosti používateľských pesničiek
sl: Možnosti uporabnikove glasbe
sv: Användarradio inställningar
uk: Налаштування користувацької музики

source: Radio
et: Raadio
hu: Rádió
ja: ラジオ
lt: Radijas
mk: Радио
pl: Stacja radiowa
pt_br: Rádio
ru: Радио
sk: Rádio
uk: Радіо

source: Random
de: Zufallswiedergabe
et: Juhuslik
hr: Nasumično
hu: Véletlenszerű
it: Casuale
ja: ランダム
lt: Atsitiktinis
lv: Nejaušs
mk: Случајно
nl: Willekeurig
pl: Losowe
pt_br: Aleatório
ro: Aleator
ru: Случайно
sk: Náhodné
sl: Naključno
sv: Slumpmässigt
uk: Випадково

source: Sequential
de: Sequentiell
et: Järjestikune
hr: Sekvencionalni
hu: Egymás utáni
it: Sequenziale
ja: 順番に
lt: Nuoseklus
lv: Secīgs
mk: Секвенцијален
nl: Sequentieel
pl: Sekwencyjne
pt_br: Sequencial
ro: Secvențial
ru: Последовательно
sk: Postupne
sl: Zaporedno
sv: Sekventiell
uk: Послідовно

source: Automatic Media Scan
de: Automatischer Medienscan
et: Automaatne meedia skäneerimine
hr: Automatsko Skeniranje Medija
hu: Automatikus média fájl felismerés
it: Scansione automatica dei file
ja: 自動メディアスキャン
lt: Automatinė medijos paieška
lv: Automātiskā Multivides Pārbaudīšana
mk: Автоматски медија скенер
nl: Automatisch mediabestanden scannen
pl: Automatyczne skanowanie ścieżek
pt_br: Verificar automaticamente se há novas músicas
ro: Scanare media automată
ru: Автопоиск музыки
sk: Automatické skenovanie médií
sl: Avtomatično poišči medije
sv: Automatisk Media Skanning
uk: Автопошук музики

source: Mute Radio sounds when minimized
de: Schaltet das Radio stumm wenn minimiert
et: Vaigista raadio heli kui mäng on all
hr: Isključi zvukove radija kada je minimizirano
hu: Némítsa a rádió hangokat amikor minimalizálva van
it: Muta la radio quando minimizzato
ja: ウインドウを隠す際、ラジオの音をミュートする
lt: Nutildyti radijo garsus kol žaidimas nuleistas
lv: Apklusināt Radio skaņas, ja minimizēts
mk: Мутирај го звукот на радиото кога е минимизирано
nl: Demp radio geluid als MTA geminimaliseerd is
pl: Wycisz dźwięki Radia gdy zminimalizowane
pt_br: Silenciar sons do rádio ao minimizar
ro: Oprește sunetele radio la minimizare
ru: Заглушить радио, когда игра свернута
sk: Stlmiť Rádio pri minimalizovaní
sl: Utišaj radio, ko je MTA minimiran
sv: Stäng radioljud i minimerat läge
uk: Заглушити радіо, коли гра згорнута

source: Mute SFX sounds when minimized
de: Schaltet die SFX Töne stumm wenn minimiert
et: Vaigista mängu helid kui mäng on all
hr: Isključi zvukove efekata kada je minimizirano
hu: Némítsa az SFX hangokat amikor minimalizálva van
it: Muta SFX quando minimizzato
ja: ウインドウを隠す際、SFXの音をミュートする
lt: Nutildyti efektų garsus kol žaidimas nuleistas
lv: Apklusināt SFX skaņas, ja minimizēts
mk: Мутирај SFX звук кога е минимизирано
nl: Demp geluidseffecten als MTA geminimaliseerd is
pl: Wycisz dźwięki gry gdy zminimalizowane
pt_br: Silenciar sons do ambiente ao minimizar
ro: Oprește sunetele SFX la minimizare
ru: Заглушить звуки эффектов, когда игра свёрнута
sk: Stlmiť zvuky SFX pri minimalizovaní
sl: Utišaj SFX zvoke, ko je MTA minimiran
sv: Stäng ljudeffekter i minimerat läge
uk: Заглушити звуки ефектів, коли гра згорнута

source: Mute MTA sounds when minimized
de: Schaltet die MTA Töne stumm wenn minimiert
et: Vaigista MTA helid kui mäng on all
hr: Isključi MTA zvukove kada je minimizirano
hu: Némítsa az MTA hangokat amikor minimalizálva van
it: Muta i suoni di MTA quando minimizzato
ja: ウインドウを隠す際、MTAの音をミュートする
lt: Nutildyti MTA garsus kol žaidimas nuleistas
lv: Apklusināt MTA skaņas, ja minimizēts
mk: Мутирај MTA звук кога е минимизирано
nl: Demp MTA geluiden als MTA geminimaliseerd is
pl: Wycisz dźwięki MTA gdy zminimalizowane
pt_br: Silenciar sons do MTA ao minimizar
ro: Oprește sunetele MTA la minimizare
ru: Заглушить звуки MTA, когда игра свёрнута
sk: Stlmiť MTA zvuky pri minimalizovaní
sl: Utišaj MTA zvoke, ko je MTA minimiran
sv: Stäng MTA ljud i minimerat läge
uk: Заглушити звуки MTA, коли гра згорнута
