Repository: multitheftauto/mtasa-blue
Catalog: Shared/data/MTA San Andreas/MTA/locale/*/client.po
Languages: de, et, hr, hu, it, ja, lt, lv, mk, nl, pl, pt_br, ro, ru, sk, sl, sv, uk

source: .asi files are in the 'MTA:SA' or 'GTA: San Andreas' installation directory. Remove these .asi files if you experience problems with MTA:SA.
de: .asi Dateien befinden sich im 'MTA:SA' oder 'GTA: San Andreas' Installationsverzeichnis. Entferne die .asi Dateien, wenn du Probleme mit MTA:SA feststellst.
hr: .asi datoteke su pronađene u 'MTA:SA' ili 'GTA: San Andreas' instalacijskim datotekama. Uklonite te .asi datoteke ako uočite probleme sa MTA:SA.
hu: .asi fájlok vannak az 'MTA:SA' vagy a 'GTA: San Andreas' telepítési könyvtárban. Törölje ezeket a fájlokat, ha problémája van az MTA:SA-val.
ja: .asiファイルは「MTA:SA」や「GTA:SA」のインストールパスに検出されました。 MTAと問題があったら、このファイルを消してください。
lt: .asi failai aptikti 'MTA:SA' arba 'GTA: San Andreas' aplankale. Ištrinkite .asi failus jei patirsite nesklandumų su MTA:SA.
lv: .asi faili atrodās iekš 'MTA:SA' vai 'GTA: San Andreas' instalācijas direktorijas. Noņemiet šos .asi failus, ja Jums ir problēmas ar MTA:SA.
mk: .asi фајловите се лоцирани во инсталационот фолдер во 'MTA:SA' или 'GTA: San Andreas'. Избришете ги тие фајлови ако имате проблеми со MTA:SA
nl: Er bevinden zich .asi bestand in de 'MTA:SA' of 'GTA: San Andreas' installatiemap. Verwijder deze .asi bestanden als u problemen heeft met MTA:SA.
pl: Piliki z rozszerszeniem .asi znajdują się w folderze instalacyjnym 'MTA:SA' lub 'GTA: San Andreas'. Usuń pliki z rozszerszeniem .asi, jeśli doświadczasz problemów z działaniem MTA:SA.
pt_br: Arquivos ".asi foram encontrados no diretório do MTA ou GTA:SA. Se o MTA não funcionar corretamente, é recomendado removê-los.
ro: S-au găsit fișiere .asi în directorul de instalare al MTA: San Andreas sau al GTA: San Andreas. Șterge aceste fișiere .asi dacă întâmpini probleme cu MTA:SA.
ru: Файлы с расширением .asi установлены в папку с GTA San Andreas или MTA SA. Удалите файлы с расширением .asi во избежание проблем с MTA SA.
uk: Файли з розширенням .asi інстальовано в теку з GTA San Andreas або MTA SA. Видаліть файли з розширенням .asi щоб уникнути проблем з MTA SA.

source: File version mismatch error. Reinstall MTA:SA if you experience problems.
de: Dateiversion stimmt nicht überein. Installiere MTA:SA neu, wenn du Probleme hast.
hr: Greška neusklađenosti verzije datoteke. Ponovno instalirajte MTA:SA ako doživite probleme.
hu: Fájl verzió hiba. Telepítse újra az MTA:SA-t, ha problémák merülnének fel.
ja: ファイルバージョンミスマッチ。MTA:SAと問題があったら、再インストールしてください。
lt: Neteisingos failo versijos klaida. Perrašykite MTA:SA, jei patirsite nesklandumų.
lv: Faila versijas neatbilstības kļūda. Pārinstalējiet MTA:SA, ja Jums ar to ir problēmas.
mk: Грешка во фајловите на верзијата. Реинсталирајте ја MTA:SA доколку имате проблеми.
nl: Bestandsversie komt niet overeen. Herinstalleer MTA:SA als u problemen ondervindt.
pl: Wystąpił błąd z rozbieżnością wersji plików. Przeinstaluj MTA:SA jeśli doświadczasz problemów z działaniem gry.
pt_br: Há arquivos em seu MTA que são de uma versão distinta da instalada. Se estiver enfrentando problemas com ele, reinstale-o.
ro: Eroare de nepotrivire a versiunilor fișierelor. Reinstalează MTA:SA dacă întâmpini probleme.
ru: Ошибка версий файлов. Переустановите MTA:SA для решения проблемы.
uk: Помилка версій файлів. Переінсталюйте MTA:SA для вирішення проблеми.

source: Some files are missing. Reinstall MTA:SA if you experience problems.
de: Einige Dateien fehlen. Installiere MTA:SA neu, wenn Probleme auftreten.
hr: Neke datoteke nedostaju. Ponovno instalirajte MTA:SA ako uočite probleme.
hu: Egyes fájlok hiányoznak. Telepítse újra az MTA: SA-t, ha problémák merülnek fel.
ja: ファイル不足。問題があったら、MTA:SAを再インストールをしてください。
lt: Trūksta kai kurių failų. Perrašykite MTA:SA, jei patirsite nesklandumų.
lv: Daži faili ir pazuduši. Pārinstalējiet MTA:SA, ja Jums ar to ir problēmas.
mk: Некои фајлови се недостапни.Преинсталирајте ја MTA:SA доколку имате некој проблем.
nl: Sommige bestanden onderbreken. Herinstalleer MTA:SA als u problemen ondervindt.
pl: Brakuje niektórych plików. Przeinstaluj MTA:SA jeśli doświadczasz problemów z działaniem gry.
pt_br: Alguns arquivos estão faltando. Reinstale o MTA:SA se acontecer algum problema.
ro: Unele fișiere lipsesc. Reinstalează MTA:SA dacă întâmpini probleme.
ru: Некоторые файлы повреждены. Переустановите MTA во избежание проблем.
uk: Деякі файли пошкоджені. Переінсталюйте MTA щоб уникнути проблеми.

source: MTA:SA is not compatible with Windows 'Safe Mode'. Please restart your PC.
de: MTA:SA ist nicht kompatibel mit dem 'abgesicherten Modus'. Bitte starte deinen PC neu.
hr: MTA:SA nije kompatibilan sa sigurnim načinom rada Windowsa. Molimo ponovno pokrenite svoje računalo.
hu: MTA:SA nem kompatibilis a Windows 'Csökkentett módjával'. Kérlek indítsd újra a számítógéped.
ja: MTA:SAは「セーフモード」で実行できません。 パソコンを再起動してください。
lt: MTA:SA yra nepalaikomas su Windows 'Safe Mode'. Perkraukite savo PC.
mk: MTA:SA не е компатибилен со Windows 'Safe Mode'. Ве молиме рестартирајте го компјутерот.
pt_br: O MTA:SA não é compatível com o 'Modo Seguro' do Windows. Por favor, reinicie o seu computador.
ru: MTA:SA не работает в 'Безопасном режиме'. Перезапустите ваш компьютер.
uk: MTA:SA не працює в 'Безпечному режимі'. Перезапустіть ваш комп'ютер.

source: Fix configuration issue
hu: Konfigurációs probléma helyreállítás
lt: Sutaisyti konfigūracijos problemas
mk: Поправете го проблемот со конфигурацијата
pt_br: Corrigir problema de configuração

source: Fix elevation required error
lt: Sutaisyti privilegijų reikalavimo klaidą
mk: Поправете ја грешката
pt_br: Corrigir erro de elevação necessária

source: Could not start Grand Theft Auto: San Andreas. Please try restarting, or if the problem persists,contact MTA at www.multitheftauto.com. [%s]
de: Konnte Grand Theft Auto: San Andreas nicht starten. Bitte versuche es erneut, oder, wenn das Problem weiterhin auftritt, kontaktiere das MTA Team via www.multitheftauto.com. [%s]
et: Ei suuda käivitada Grand Theft Auto: San Andreast. Proovige taaskäivitada ning kui probleem jätkub siis kontakteeruge MTA tiimiga veebilehelt www.multitheftauto.com [%s]
hr: Nije moguće pokrenuti Grand Theft Auto: San Andreas. Molimo pokušajte pokrenuti ponovno, ili ako problem ustraje, kontaktirajte MTA na www.multitheftauto.com. [%s]
hu: Nem lehet elindítani a Grand Theft Auto: San Andreas-t. Kérjük, próbálja meg újraindítani, vagy ha a probléma továbbra is fennáll, lépjen kapcsolatba az MTA-val itt: www.multitheftauto.com. [%s]
it: Impossibile avviare Grand Theft Auto: San Andreas. Per favore prova a riavviarlo, oppure se il problema persiste, contatta MTA a www.multitheftauto.com. [%s]
ja: GTA：San Andreasが実行できませんでした。 再起動してください、この問題が続いたら、MTAを「www.multitheftauto.com. 」までに連絡してください。 [%s]
lt: Nepavyko paleisti Grand Theft Auto: San Andreas. Prašome paleisti iš naujo, arba, jei problema kartosis, susisiekti su MTA svetainėje www.multitheftauto.com. [%s]
lv: Nespēj palaist Grand Theft Auto: San Andreas. Lūdzu mēģiniet restartēt, ja problēma turpinās,kontaktējiet MTA iekš www.multitheftauto.com. [%s]
mk: Grand Theft Auto: San Andreas не може да се стартува. ~ ~ Рестартирајте, или ако проблемот продолжи, контактирајте ги MTA на www.multitheftauto.com. [%s]
nl: Kon Grand Theft Auto: San Andreas niet starten. Probleem te herstarten, of als het probleem aanhoudt, contacteer MTA op www.multitheftauto.com. [%s]
pl: Nie udało się uruchomić Grand Theft Auto: San Andreas. Spróbuj uruchomić moda ponownie, lub jeśli problem dalej występuje, skontaktuj się z nami na www.multitheftauto.com. [%s]
pt_br: Não foi possível iniciar o GTA: San Andreas. Por favor reinicie seu computador, mas se o problema persistir, entre em contato em www.multitheftauto.com. [%s]
ro: Nu s-a putut porni Grand Theft Auto: San Andreas. Te rugăm încearcă să-ți restartezi calculatorul sau dacă problema persistă, să contactezi MTA la www.multitheftauto.com. [%s]
ru: Невозможно запустить Grand Theft Auto: San Andreas. Попробуйте перезапустить. Если проблема не решена, то обратитесь за помощью на сайте www.multitheftauto.com. [%s]
sk: Nemožno spustiť Grand Theft Auto: San Andreas. Skús prosím reštart, alebo ak problém pretrváva, kontaktuj MTA na www.multitheftauto.com. [%s]
sl: Ni bilo mogoče zagnati Grand Theft Auto: San Andreas. Prosimo, da poskusite s ponovnim zagonom. Če pa se problem pojavlja, se obrnite na MTA na http://www.multitheftauto.com/ . [%s]
sv: Kunde inte starta Grand Theft Auto: San Andreas. Prova att starta om, eller om problemet kvarstår, kontakta MTA på www.multitheftauto.com. [%s]
uk: Не вдалося запустити Grand Theft Auto: San Andreas. Спробуйте перезапустити. Якщо проблема не вирішена, то зверніться за допомогою на сайті www.multitheftauto.com. [%s]

source: GTA: San Andreas may not have launched correctly. Do you want to terminate it?
de: GTA: San Andreas scheint nicht richtig gestartet zu sein. Möchtest du es beenden?
et: GTA: San Andreas ei käivitunud korrektselt. Kas soovite selle sulgeda?
hr: GTA: San Andreas se možda nije pokrenuo ispravno. Želite li ga zaustaviti?
hu: GTA: San Andreas nem indult el megfelelően. Szeretnéd ezt megszüntetni?
it: GTA:SA potrebbe non essere stato avviato correttamente. Vuoi terminarlo?
ja: GTA：San Andreasが正しく実行しなかったかも知れません。終了しますか？
lt: GTA: San Andreas galėjo būti paleistas neteisingai. Ar norite sunaikinti šį procesą?
lv: GTA: San Andreas varētu būt palaists nepareizi. Vai vēlaties to izslēgt?
mk: GTA: San Andreas не е вклучена коректно. Дали сакате да ја исклучите?
nl: GTA: San Andreas is mogelijks niet correct gestart. Wilt u het beëindigen?
pl: Gra GTA: San Andreas mogła nie uruchomić się prawidłowo. Czy chcesz ją wyłączyć?
pt_br: GTA: San Andreas pode não ter sido iniciado corretamente. Você quer fecha-lo?
ro: Se poate ca GTA: San Andreas să nu fi fost lansat corect. Vrei să îl închizi?
ru: Процесс GTA: San Andreas не может быть запущен правильно. Вы хотите завершить его?
sk: GTA: San Andreas sa možno nespustilo správne. Chceš ho ukončiť?
sl: GTA: San Andreas se ni zagnal pravilno. Ali hočete prekiniti ta proces?
sv: GTA: San Andreas har kanske inte startats korrekt. Vill du avsluta det?
uk: Процес GTA: San Andreas не може бути запущений правильно. Ви хочете завершити його?

source: Select your Grand Theft Auto: San Andreas Installation Directory
de: Wähle den Installationsordner von Grand Theft Auto: San Andreas aus
et: Vali oma Grand Theft Auto: San Andrease kaust
hr: Odaberite vaš Grand Theft Auto: San Andreas Instalacijski Direktorij
hu: Válaszd ki a Grand Theft Auto: San Andreas főkönyvtárát
it: Seleziona la tua directory di installazione di Grand Theft Auto: San Andreas
ja: GTA：San Andreasのインストールパスを選んでください
lt: Pasirinkite savo Grand Theft Auto: San Andreas įdiegimo aplanką
lv: Izvēlieties Jūsu Grand Theft Auto: San Andreas instalācijas mapi
mk: Селектирајте ја дирекцијата за инсталирање на Grand Theft Auto: San Andreas
nl: Selecteer uw Grand Theft Auto: San Andreas installatie pad
pl: Wybierz folder z zainstalowaną grą Grand Theft Auto: San Andreas
pt_br: Selecione o local de instalação do Grand Theft Auto: San Andreas
ro: Selectează directorul de instalare al Grand Theft Auto: San Andreas
ru: Выберите директорию с Grand Theft Auto: San Andreas
sk: Vyber tvoje Grand Theft Auto: San Andreas inštalačné umiestnenie
sl: Izberite svojo Grand Theft Auto: San Andreas namestitveno mapo
sv: Välj din Grand Theft Auto: San Andreas Installationsmapp
uk: Виберіть директорію з Grand Theft Auto: San Andreas

source: Error loading %s module! (%s)
de: Fehler beim Laden des Moduls %s! (%s)
et: Viga mooduli %s laadimises! (%s)
hr: Pogreška učitavanja %s module! (%s)
hu: Hibás betöltés: %s modul! (%s)
it: Errore durante il caricamento del modulo %s! (%s)
ja: %s(%s) モジュール読み込み失敗
lt: Klaida įkeliant %s modulį! (%s)
lv: Kļūda ielādējot %s moduli! (%s)
mk: Погрешно вчитување %s модел! (%s)
nl: Fout bij het laden van %s module! (%s)
pl: Błąd przy ładowaniu modułu %s! (%s)
pt_br: Houve um erro ao carregar o módulo %s! (%s)
ro: Eroare la încărcarea modulului %s! (%s)
ru: Ошибка загрузки %s модуля! (%s)
sk: Chyba pri načítaní %s modulu! (%s)
sl: Napaka pri nalaganju %s modula! (%s)
sv: Fel vid laddning av %s modul! (%s)
uk: Помилка завантаження %s модуля! (%s)

source: New installation of %s detected. Do you want to copy your settings from %s ?
de: Neue Installation von %s erkannt. Möchtest du deine Einstellungen von %s kopieren?
hr: Nova instalacija %s je pronađena. Želite li kopirati svoje postavke iz %s?
hu: Új telepítés %s észlelt. Szeretné másolni a beállításokat innen %s ?
ja: %s 新たなインストールを検出されました。 %s からセッティングをコピーしますか？
lt: Tai pirmas %s paleidimas. Ar norite nukopijuoti nustatymus iš %s ?
lv: Jauna %s instalācija atrasta. Vai Jūs vēlaties kopēt Jūsu iestatījumus no %s?
mk: Нова инсталација од %s е детектирана. Дали сакате да ги копирате вашите опции од %s ?
nl: Nieuwe installatie van %s ontdekt. Wilt u uw instelling van %s kopiëren?
pl: Wykryto nową instalację %s. Czy chcesz skopiować swoje ustawienia z %s ?
pt_br: Nova instalação do %s detectada. Você deseja copiar suas configurações do %s ?
ro: O nouă instalare a %s a fost detectată. Dorești să copiezi setările din %s?
ru: Новая версия клиента %s обнаружена. Вы хотите скопировать ваши настройки из %s ?
uk: Нова версія клієнта %s виявлена. Ви хочете скопіювати ваші налаштування з %s ?

source: GTA:SA had trouble opening the file '%s'
de: GTA:SA konnte die Datei '%s' nicht öffnen
hr: GTA:SA je imao problema s otvaranjem datoteke '%s'
hu: A GTA:SA összeomlott a következő fájl megnyitásakor '%s'
ja: GTA:SAが '%s' ファイルの読み込みに失敗しました。
lt: GTA:SA nepavyko atidaryti failo '%s'
lv: GTA:SA notika kļūme atverot failu '%s'
mk: GTA:SA имаше проблеми да го отвори овој фајл '%s'
nl: GTA:SA kon het bestand '%s' niet openen
pl: GTA:SA miało problem z otwarciem pliku '%s'
pt_br: GTA:SA encontrou um problema ao abrir o arquivo '%s'
ro: GTA:SA a întâmpinat probleme la deschiderea fișierului '%s'
ru: GTA:SA не смогла открыть файл '%s'
uk: GTA:SA не зміг відкрити файл '%s'

source: GTA:SA is missing the file '%s'.
de: GTA:SA fehlt die Datei '%s'.
hr: Nedostaje datoteka '%s' u GTA:SA.
hu: Hiányzó GTA:SA fájl '%s'.
ja: GTA:SAに '%s' ファイルが不足しています。
lt: Trūksta GTA:SA failo '%s'.
lv: GTA:SA ir pazudis fails '%s'.
mk: GTA:SA и недостасува фајлот '%s'.
nl: Het bestand '%s' ontbreekt in uw GTA:SA installatie.
pl: GTA:SA nie może otworzyć brakującego pliku '%s'.
pt_br: O arquivo '%s' está ausente na instalação do GTA:SA.
ro: GTA:SA duce lipsă de fișierul '%s'.
ru: GTA:SA не нашла файл '%s'
uk: GTA:SA не знайшов файл '%s'

source: GTA:SA had trouble loading a model.
de: GTA:SA konnte ein Modell nicht laden.
hr: GTA:SA je imao poteškoća pri učitavanju modela.
hu: A GTA:SA összeomlott modell betöltés közben.
ja: GTA:SAがモデルを読み込みに失敗しました。
lt: GTA:SA nepavyko įkelti modelio.
lv: GTA:SA ir kļūme ielādējot modeli.
mk: GTA:SA имаше проблеми да го вчита овој модел.
nl: GTA:SA kon een model niet laden.
pl: GTA:SA miało problem z załadowaniem modelu.
pt_br: O GTA:SA teve um problema em carregar um modelo.
ro: GTA:SA a întâmpinat probleme la încărcarea unui model.
ru: GTA:SA не смогла загрузить модель.
uk: GTA:SA не зміг завантажити модель.

source: If you recently modified gta3.img, then try reinstalling GTA:SA.
de: Wenn du kürzlich gta3.img modifiziert hast, versuche GTA:SA neu zu installieren.
hr: Ako ste nedavno mijenjali gta3.img, pokušajte reinstalacijom GTA:SA.
hu: Ha nemrégiben módosítottad a gta3.img fájlod, telepítsd újra a GTA:SA-t.
ja: 最近「gta3.img」を変更した場合、GTA:SAを再インストールしてください。
lt: Jei neseniai keitėte gta3.img, tada pabandykite perrašyti GTA:SA.
mk: Ако неодамна сте го модифицирале gta3.img, тогаш пробајте со ре-инсталирање на GTA:SA.
pl: Jeżeli modyfikowałeś ostatnio plik gta3.img, spróbuj przeinstalować GTA:SA.
pt_br: Se você modificou o arquivo gta3.img recentemente, então tente reinstalar o GTA:SA
ru: Если вы недавно модифицировали gta3.img, попробуйте переустановить GTA:SA.
uk: Якщо ви недавно модифікували gta3.img, спробуйте переінсталювати GTA:SA.

source: GTA:SA had trouble adding an upgrade to a vehicle.
de: GTA:SA konnte ein Fahrzeugupgrade nicht hinzufügen.
hr: GTA:SA je imao poteškoća pri dodavanju dodatka na vozilo.
hu: A GTA:SA összeomlott jármű tuningolás miatt.
ja: GTA:SAが車のアップグレードを失敗しました。
lt: GTA:SA nepavyko pridėti patobulinimo mašinai.
lv: GTA:SA ir kļūme pievienojot uzlabojumu transportlīdzeklim.
mk: GTA:SA имаше проблем со додавање на надградба на ова возило.
nl: GTA:SA kon geen vehicle upgrade toevoegen.
pl: GTA:SA miało problem z dodaniem ulepszenia do pojazdu.
pt_br: O GTA:SA teve um problema em adicionar itens de tunagem ao veículo.
ro: GTA:SA a întâmpinat probleme la adăugarea de îmbunătățiri unui vehicul.
ru: GTA:SA не смогла добавить апгрейд транспортному средству.
uk: GTA:SA не зміг додати апґрейд транспортному засобу.

source: GTA:SA found errors in the file '%s'
hr: GTA:SA je pronašao greške u datoteci '%s'
hu: GTA:SA hibákat talált a '%s' fájlban
ja: GTA:SAは「%s」ファイルにエラーを発見しました
lt: GTA:SA surado klaidų faile '%s'
mk: GTA:SA пронајде грешки во фајлот '%s'
pl: GTA:SA znalazło błędy w pliku '%s'
pt_br: O GTA:SA encontrou erros no arquivo '%s'
ru: GTA:SA нашла ошибки в файле '%s'
uk: GTA:SA знайшов помилки в файлі '%s

source: Did your computer restart when playing MTA:SA?
de: Startete dein Computer neu als du MTA:SA gespielt hast?
hr: Je li se Vaše računalo ponovno pokrenulo tijekom igranja MTA:SA?
hu: Újrainduljon a számítógép miközben játszik az MTA:SA-val?
ja: MTA:SAをプレイ中にパソコンを再起動しましたか？
lt: Ar jūsų kompiuteris persikrovė bežaidžiant MTA:SA?
lv: Vai Jūsu dators restartējās, kad spēlējāt MTA:SA?
mk: Дали твојот компјутер се рестартил кога MTA:SA билa вклучена?
nl: Is uw computer herstart tijdens het spelen van MTA:SA?
pl: Czy Twój komputer zrestartował się podczas gry w MTA:SA?
pt_br: O seu computador reiniciou quando jogava MTA:SA?
ro: S-a restartat calculatorul tău în timp ce jucai MTA:SA?
ru: Ваш компьютер перезагрузился во время игры в MTA:SA?
uk: Ваш комп'ютер перезавантажився під час гри в MTA:SA?

source: Please terminate the following programs before continuing:
de: Bitte schließe erst folgende Programme:
hr: Molimo ugasite sljedeće programe prije nego što nastavite:
hu: Kérjük állítsa le a következő programokat a folytatás előtt:
ja: 続ける前に、次のプログラムを閉じてください:
lt: Prašome išjungti sekančias programas prieš tęsdami darbą:
lv: Lūdzu, aiztaisiet sekojošas programmas, pirms turpiniet:
mk: Ве молиме следниве програми исклучете ги пред да продолжите:
nl: Gelieve de volgende programma's te beëindigen voor u verdergaat:
pl: Proszę zakończyć pracę następujących programów przed kontynuowaniem:
pt_br: Feche os programas a seguir antes de continuar:
ro: Te rugăm închide următoarele programe înainte de a continua:
ru: Завершите следующие программы для продолжения:
uk: Завершіть наступні програми для продовження:

source: This version has expired.
de: Diese Version ist abgelaufen.
et: See versioon on aegunud.
hr: Ova verzija je istekla.
hu: Ez a verzió már elavult.
it: Questa versione è scaduta.
ja: このバージョンが失効しました。
lt: Versijos galiojimo laikas baigėsi.
lv: Šī versija ir iztecējusi.
mk: Оваа верзија е остарена.
nl: Deze versie is verlopen.
pl: Ta wersja już wygasła.
pt_br: Esta versão expirou.
ro: Această versiune a expirat.
ru: Эта версия устарела.
sk: Táto verzia už vypršala.
sl: Ta različica je potekla.
sv: Versionen har gått ut.
uk: Ця версія застаріла.

source: disconnect from the game
de: Verbindung zum Server schließen
et: katkestab serveriga ühenduse
hr: isključi se iz igre
hu: lecsatlakozás a játékból
it: disconnettiti dalla partita
ja: ゲームから切断する
lt: atsijungia iš žaidimo
lv: atslēgties no spēles
mk: дисконекција од играта
nl: Verbinding verbroken
pl: rozłącza z gry
pt_br: desconecta do jogo
ro: deconectează-te de la joc
ru: отключение от игры
sk: odpojiť z hry
sl: prekini povezavo z igro
sv: avbryt anslutningen från spelet
uk: від'єднання від гри

source: shows the nametags
de: Nametags anzeigen
et: näitab nimesilte
hr: pokazuje oznake s imenom
hu: nevek mutatása
it: mostra i tag dei nomi
ja: ネームタグを表示する
lt: rodo vardų etiketes
lv: parāda namtagus
mk: прикажување на таговите на имињата
nl: toon de naamplaatjes
pl: pokazuje etykiety z nazwami graczy
pt_br: mostra os 'nametags'
ro: afişează numele
ru: показывать неймтеги
sk: zobrazí nametagy
sl: prikaže imena
sv: visar namnskyltarna
uk: показувати неймтеґи

source: shows the chatbox
de: Chatbox anzeigen
et: näitab chatti
hr: prikazuje statistike memorije
hu: chatbox mutatása
it: mostra la chatbox
ja: チャットボックスを表示する
lt: rodo pokalbių langą
lv: uzrāda saraksti
mk: покажува чатбокс
nl: toont de chatbox
pl: pokazuje okienko czatu
pt_br: mostra o chat
ro: afișează fereastra de chat
ru: показать чат
sk: zobrazí chat
sl: prikaže klepet
sv: visar chattrutan
uk: показати чат

source: shows the network statistics
de: Netzwerkstatistiken anzeigen
et: näitab võrgu statistikat
hr: prikazuje statistike memorije
hu: kapcsolat statisztika mutatása
it: mostra le statistiche della rete
ja: ネット統計を表示する
lt: rodo tinklo statistikas
lv: uzrāda tīkla statistiku
mk: прикажување на мемориската статистика
nl: toont de netwerk statistieken
pl: pokazuje statystyki sieci
pt_br: mostra as estatísticas de internet
ro: afișează statisticile conexiunii
ru: Показывать статистику соединения
sk: zobrazí sieťové štatistiky
sl: prikaže omrežne statistike
sv: visar nätverksstatistik
uk: Відображати статистику з'єднання

source: open the chat input
de: Eingabezeile des Chats öffnen
et: ava chati sisestuskast
hr: otvori unos čavrljanja
hu: chat beviteli mező megnyitása
it: apre la chat
ja: チャットインプットを開ける
lt: atidaro pokalbių įvedimo langą
lv: atver sarakstes ievadi
mk: отвори го внатрешниот чат
nl: opent de chat invoer
pl: otwiera okienko do wpisywania na czacie
pt_br: abre o campo para escrever no chat
ro: activează intrarea ferestrei de chat
ru: Открыть чат
sk: zobrazí vstup chatu
sl: odpri klepet
sv: öppna chattinmatningen
uk: Відкрити чат

source: transmits voice to other players
de: Sprachübertragung an andere Spieler starten
et: edastab hääle teistele mängijatele
hr: prenosi glas na druge igrače
hu: hang továbbítása a többi játékos felé
it: trasmette la voce ad altri giocatori
ja: 他のプレーヤーに送信する
lt: perduoda balsą kitiems žaidėjams
lv: pārraida balsi citiem spēlētājiem
mk: пренеси глас до друг играч
nl: zend stem uit naar andere spelers
pl: przesyła głos do innych graczy
pt_br: transmite a voz para outros jogadores
ro: transmite vocea către ceilalți jucători
ru: Передавать голос всем игрокам
sk: prenáša hlas ostatným hráčom
sl: odda zvok drugim igralcem
sv: för över röst till andra spelare
uk: Передавати голос всім гравцям

source: enters a car as passenger
de: Als Passagier in ein Fahrzeug steigen
et: siseneb autosse kaasreisijana
hr: ulazi u vozilo kao suvozač
hu: járműbe szállás utasként
it: entra in un'auto come passeggero
ja: 同乗で車に乗る
lt: įlipa į tr. priemonę kaip keleivis
lv: iekāp kā pasažieris
mk: влези во колата како совозач
nl: stapt in een auto als passagier
pl: wchodzi do pojazdu jako pasażer
pt_br: entra em um carro como passageiro
ro: intră în maşină ca pasager
ru: Транспорт: Пассажир
sk: vstúpi do auta ako pasažier
sl: vstopi v avto kot potnik
sv: går in i en bil som passagerare
uk: Транспорт: Пасажир

source: next radio channel
de: Nächsten Radiokanal
et: järgmine raadiojaam
hr: sljedeći radio kanal
hu: következő rádió csatorna
it: stazione radio successiva
ja: 次のラジオチャンネル
lt: sekantis radijo kanalas
lv: nākošā radio stacija
mk: следниот радио канал
nl: volgende radio zender
pl: następny kanał radiowy
pt_br: rádio seguinte
ro: stația radio următoare
ru: След. радиостанция
sk: ďalšia rádio stanica
sl: naslednja radijska postaja
sv: radio nästa kanal
uk: Наст. радіостанція
