Repository: multitheftauto/mtasa-blue
Catalog: Shared/data/MTA San Andreas/MTA/locale/*/client.po
Languages: de, et, hr, hu, it, ja, lt, lv, mk, nl, pl, pt_br, ro, ru, sk, sl, sv, uk

source: Website requests
de: Angeforderte Webseiten
hr: Zahtjevi web stranice
hu: Weboldal lekérések
ja: ウェッブサイトリクエスト
lt: Tinklalapio prašymai
lv: Mājaslapu pieprasījumi
mk: Барање на вебсајт
pl: Żądania stron WWW
pt_br: Solicitações de sites
ru: Запрос к сайту
uk: Запит до сайту

source: The server requests the following websites in order to load them (later):
de: Der Server möchte folgende Webseiten laden (ggf. später):
hr: Server zahtijeva sljedeće web stranice kako bi ih učitao (kasnije):
hu: A szerver kéri a következő weboldalakat annak érdekében, hogy betöltse (később):
ja: 後にロードするため、サーバーは次のウェッブサイトをリクエストしています：
lt: Serveris prašo užkrauti šias svetaines (vėliau):
lv: Serveris pieprasa pieeju šādām mājaslapām:
mk: Серверот ги бара следниве вебсајтови за да може да ги лоадира (подоцна)
pl: Serwer prosi o zgodę na dostęp do następujących stron WWW w celu ich wyświetlenia (później):
pt_br: O servidor solicita os seguintes websites para carregá-los (mais tarde):
ru: Сервер делает запросы к следующим сайтам, для того чтобы загрузить их позднее:
uk: Сервер робить запити до наступних сайтів, для того щоб завантажити їх пізніше:

source: NEVER ENTER SENSITIVE DATA TO PROTECT THEM FROM BEING STOLEN
de: GIB NIEMALS SENSIBLE DATEN EIN, UM DIEBSTAHL ZU VERHINDERN
hr: NIKADA NE UNOSITE OSJETLJIVE PODATKE DA SPRIJEČITE NJIHOVU KRAĐU
hu: SOHA NE ÍRJ BE ÉRZÉKENY ADATOKAT ANNAK ÉRDEKÉBEN, HOGY MEGVÉDD AZ ADATAIDAT ILLETÉKTELENEKTŐL.
ja: 盗まらないように、個人情報を絶対書かないでください
lt: NIEKADA NEĮVESKITE SVARBIOS INFORMACIJOS APSAUGAI NUO VAGYSČIŲ
lv: NEKAD NEIEVADIET PRIVĀTU INFORMĀCIJU, LAI PASARGĀTU TO NO NOZAGŠANAS
mk: НИКОГАШ НЕ ВНЕСУВАЈТЕ ВАЖНИ ИНФОРМАЦИИ ЗА ДА НЕ БИДАТ УКРАДЕНИ
pl: NIGDY NIE PRZEKAZUJ SWOICH WAŻNYCH DANYCH OSOBOM TRZECIM ABY ZAPOBIEC ICH KRADZIEŻY
pt_br: NUNCA INSIRA DADOS CONFIDENCIAIS PARA PROTEGÊ-LOS DE SEREM ROUBADOS
ru: НЕ ВВОДИТЕ КОНФИДЕНЦИАЛЬНЫХ ДАННЫХ, ДАБЫ ЗАЩИТИТЬ ИХ ОТ КРАЖИ
uk: НІКОЛИ НЕ ВВОДЬТЕ КОНФІДЕНЦІЙНІ ДАНІ, ЩОБ ЗАХИСТИТИ ЇХ ВІД КРАДІЖКИ

source: Remember decision
de: Entscheidung merken
hr: Zapamti odluku
hu: Választás megjegyzése
ja: 決を保存
lt: Prisiminti pasirinkimą
mk: Запамти ја одлуката
pl: Zapamiętaj wybór
pt_br: Lembrar decisão
ru: Запомнить решение
uk: Запам'ятати рішення

source: Allow
de: Akzeptieren
hr: Dopusti
hu: Engedélyezés
ja: 有効
lt: Leisti
lv: Atļaut
mk: Одобри
pl: Zezwól
pt_br: Permitir
ru: Разрешить
uk: Дозволити

source: Deny
de: Blockieren
hr: Odbij
hu: Megtagad
ja: 否定
lt: Atšaukti
mk: Одбиј
pl: Odmowa
pt_br: Negar
ru: Запрет
uk: Заперечення

source: ***[ COMMAND HELP ]***
de: ***[ BEFEHLSHILFE ]***
et: ***[ KÄSK ABI ]***
hr: ***[ KOMANDA POMOĆ ]***
hu: ***[ PARANCS SEGÍTSÉG ]***
it: ***[ AIUTO COMANDO ]***
ja: ***[ コマンド ヘルプ ]***
lt: ***[ KOMANDOS PAGALBA ]***
lv: ***[ KOMANDAS PALIDZIBA ]***
mk: ***[ КОМАНДА ПОМОШ ] ***
nl: ***[ COMMANDO HULP ]***
pl: ***[ POMOC DLA KOMEND ]***
pt_br: ***[ COMANDOS DISPONÍVEIS ]***
ro: ***[ AJUTOR COMENZI ]***
ru: ***[ ПОМОЩЬ ПО КОМАНДАМ ]***
sk: ***[ PRÍKAZY ]***
sl: ***[ POMOČ ZA UKAZE ]***
sv: ***[ KOMMANDO HJÄLP ]***
uk: ***[ ДОПОМОГА ПО КОМАНДАМ ]***

source: * The time is %d:%02d:%02d
de: * Es ist %d:%02d:%02d Uhr
et: * Aeg on %d:%02d:%02d
hr: * Vrijeme %d:%02d:%02d
hu: * Az idő %d:%02d:%02d
it: * Sono le ore %d:%02d:%02d
ja: * 時間： %d:%02d:%02d
lt: * Šiuo metu yra %d:%02d:%02d
lv: * Pareizs laiks ir %d:%02d:%02d
mk: * Часот е %d:%02d:%02d
nl: * De tijd is %d:%02d:%02d
pl: * Bieżący czas to %d:%02d:%02d
pt_br: * São: %d:%02d:%02d
ro: * Timpul este %d:%02d:%02d
ru: * Время: %d:%02d:%02d
sk: * Práve je %d:%02d:%02d
sl: * Trenuten čas je %d:%02d:%02d
sv: * Aktuell tid är %d:%02d:%02d
uk: * Час: %d:%02d:%02d

source: connect: Syntax is 'connect <host> [<port> <nick> <pass>]'
hr: connect: Sintaksa je 'connect <poslužitelj> [<port> <nadimak> <lozinka>]'
hu: kapcsolódás: Példa: 'connect <hoszt> [<port> <név> <jelszó>]'
ja: 接続構文：'connect <host> [<port> <nick> <pass>]'
lt: Prisijungti: Sintaksė yra 'connect <adresas> [<portas> <slapyvardis> <slaptažodis>]'
lv: connect: Pareiza forma ir 'connect <hosts> [<ports> <segvārds> <parole>]'
mk: конекција: Синтаксата е конектирана на <хост> [<порта> <име> <пасворд>]'
pl: connect: Składnia komendy to 'connect <host> [<port> <nick> <hasło>]'
pt_br: Conexão: A sintaxe correta é 'connect <IP> [<porta> <apelido> <senha>]'
ro: connect: Sintaxa este 'connect <host> [<port> <nume> <parolă>]'
ru: подключиться: Используйте 'connect <адрес> [<порт> <ник> <пароль>]'
sk: connect: Správny tvar je 'connect <host> [<port> <nick> <pass>]'
sl: povezava: Sintaksa je 'connect <host> [<port> <nick> <pass>]'
sv: anslut: Syntax är 'connect <host> [<port> <nick> <pass>]'
uk: під'єднатися: Використовуйте 'connect <адреса> [<порт> <нік> <пароль>]'

source: connect: Bad port number
de: connect: Falscher Port
et: ühenda: Port number ei sobi
hr: connect: Loš broj porta
hu: kapcsolódás: Hibás port
it: connessione: Numero porta errata
ja: 接続: 無効なポート番号
lt: prisijungti: Netinkamas porto numeris
lv: connect: Nepareizs ports
mk: конекција: Погрешна бројка на портата
nl: connect: Foutief poort nummer
pl: connect: Nieprawidłowy port
pt_br: Conexão: Número de porta inválido
ro: connect: Numărul portului este incorect
ru: подключение: Неверный номер порта
sk: connect: Nesprávne číslo portu
sl: povezava: Slaba številka vrat
sv: anslut: Fel portnummer
uk: під'єднання: Невірний номер порту

source: connect: Connecting to %s:%u...
de: connect: Verbinde zu %s:%u...
et: ühenda: Loon ühendust serveriga %s:%u ...
hr: connect: Povezivanje na %s:%u...
hu: kapcsolódás: Kapcsolódás ide %s:%u...
it: connessione: Connessione a %s:%u...
ja: 接続: %s:%u に接続している...
lt: prisijungti: Jungiamasi į %s:%u...
lv: connect: Pieslēdzas pie %s:%u...
mk: Конекција: Се конектира %s:%u...
nl: connect: Verbinden met %s:%u...
pl: connect: Łączenie z %s:%u...
pt_br: Conexão: Conectando ao servidor %s:%u...
ro: connect: Se conectează la %s:%u...
ru: подключение: Подключение к %s:%u...
sk: connect: Pripája sa k %s:%u...
sl: povezava: Povezovanje na %s:%u...
sv: anslut: Ansluter till %s:%u...
uk: під'єднання: Під'єднання до %s:%u...

source: connect: could not connect to %s:%u!
de: connect: Konnte keine Verbindung zu %s:%u herstellen!
et: ühenda: Ei suutnud luua ühendust serveriga %s:%u!
hr: connect: nemoguće povezati na %s:%u!
hu: kapcsolódás: nem lehet kapcsolódni ide %s:%u!
it: connessione: impossibile connettersi a %s:%u!
ja: 接続: %s:%u と接続できませんでした！
lt: prisijungti: nepavyko prisijungti į %s:%u
lv: connect: Neizdevās pieslēgties pie %s:%u!
mk: Конекција: Конекцијата е неуспешна %s.%u!
nl: connect: Kan niet verbinden naar %s:%u!
pl: connect: Nie można połączyć się z %s:%u!
pt_br: Conexão: Não foi possível conectar a %s:%u!
ro: connect: nu s-a putut realiza conexiunea la %s:%u!
ru: подключение: не удалось подключиться к %s:%u!
sk: connect: nemôže sa pripojiť k %s:%u!
sl: povezava: ne more se povezati na %s:%u!
sv: anslut: kunde inte ansluta till %s:%u!
uk: під'єднання: не вдалося під'єднатися до %s:%u!

source: connect: Failed to unload current mod
de: connect: Fehler beim Entladen des derzeitigen Mods
et: ühenda: Ei suutnud eemaldada modifikatsiooni
hr: connect: Neuspjeh u iskrcavanju trenutnog moda
hu: kapcsolódás: A jelenlegi mód betöltése sikertelen
it: connessione: Impossibile fermare la mod corrente
ja: 接続：MODの消去することができませんでした
lt: prisijungti: Nepavyko iškrauti dabartinės modifikacijos
lv: connect: Neizdevās atslēgt esošo modu
mk: Конекција: Неуспешно отпакување на модот
nl: connect: Kan huidige mod niet stoppen
pl: connect: Nie udało się wyłączyć obecnej modyfikacji
pt_br: Conexão: Falha ao encerrar o mod atual
ro: connect: Dezactivarea modificării curente a eșuat
ru: подключение: Не удалось выгрузить текущий мод
sk: connect: Zlyhalo vypínanie aktuálneho modu
sl: povezava: Trenutnega načina igre ni bilo mogoče naložiti
sv: anslut: Misslyckades att deaktivera aktuell modifikation
uk: під'єднання: Не вдалося вивантажити поточний мод

source: Bound all controls from GTA
de: Alle Steuerungsbelegungen von GTA übernommen
et: Seo kõik nupud GTA-ga
hr: Preuzmi sve kontrole iz GTA
hu: Az összes irányítás importálása a GTA-ból
it: Associa tutti i controlli da GTA
ja: 全てのバインドは GTAから コピーされました。
lt: Įkelti visus valdymo nustatymus iš GTA
lv: Iebindotas visas kontroles no GTA
mk: Сврзи ги сите контроли од ГТА
nl: Elke besturing staat aan van GTA
pl: Pobrano ustawienia sterowania z GTA
pt_br: Todas as configuração de controles foram importadas do GTA
ro: Atașează toate controalele din GTA
ru: Скопировать управление из GTA
sk: Načítané všetky ovládania z GTA
sl: Zavezuje vse kontrole iz GTA
sv: Alla kontroller från GTA har bundits
uk: Скопіювати управління з GTA

source: Saved configuration file
de: Konfigurationsdatei gespeichert
et: Seadistusfail on salvestatud
hr: Konfiguracijska datoteka je spremljena
hu: Konfigurációs fájl elmentve
it: File di configurazione salvato
ja: 保存された設定ファイル
lt: Konfigūracijos byla išsaugota
lv: Konfigurācijas fails tika saglabāts
mk: Фајлот за конфигурација е зачуван
nl: Configuratiebestand opgeslagen
pl: Zapisano plik konfiguracyjny
pt_br: Arquivo de configuração salvo
ro: Fişierul cu configuraţia a fost salvat
ru: Файл конфигурации сохранен
sk: Konfiguračné súbory uložené
sl: Shrani nastavitve datoteke
sv: Konfigurationsfilen sparad
uk: Файл конфігурації збережений

source: * Your serial is: %s
de: * Deine Serial ist: %s
et: * Sinu serial on: %s
hr: * Vaš serijski broj je: %s
hu: * A te serialod: %s
it: * Il tuo numero seriale è: %s
ja: ＊あなたのシリアル番号は： %s
lt: Jūsų serijinis numeris yra: %s
lv: * Jūsu sērijas kods ir: %s
mk: *Твојот сериски број е: %s
nl: * Uw serial is: %s
pl: * Twój numer seryjny to: %s
pt_br: * O seu serial é: %s
ro: * Serialul tău este: %s
ru: * Ваш серийный номер: %s
sk: * Tvoj serial je: %s
sl: * Vaša serijska številka je: %s
sv: * Ditt serienummer är: %s
uk: * Ваш серійний номер: %s

source: Unknown command or cvar:
de: Unbekannter Befehl oder Clientvariable:
et: Tundmatu käsk või sõna:
hr: Nepoznata naredba ili klijentska varijabla:
hu: Ismeretlen parancs vagy beállítás:
it: Comando o cvar sconosciuto
ja: 不明なコマンド:
lt: Nežinoma komanda arba veiksmažodis
lv: Nezināma komanda vai cvar:
mk: Непозната команда
nl: Command of cvar onbekend:
pl: Nieznana komenda lub cvar:
pt_br: Comando ou cvar desconhecido:
ro: Comandă necunoscută sau cvar necunoscut:
ru: Неизвестная команда или переменная:
sk: Neznámy príkaz alebo výraz
sl: Neznan ukaz ali glagol:
sv: Okänt kommando eller cvar:
uk: Невідома команда або змінна:

source: Connecting failed. Invalid nick provided!
de: Verbindung fehlgeschlagen. Ungültiger Nickname!
et: Ühendamine ebaõnnestus. Teie mängunimi ei sobi!
hr: Povezivanje neuspjelo. Nevažeći nadimak unesen!
hu: Kapcsolódás sikertelen. A megadott felhasználónév érvénytelen!
it: Connessione fallita. Fornito nick non valido!
ja: 接続に失敗しました。無効なニックネーム!
lt: Prisijungimas nepavyko. Pateiktas netinkamas slapyvardis!
lv: Savienojums neizdevās. Norādīts nederīgs segvārds!
mk: Конекцијата е неуспешна: Приложеното име е невалидно
nl: Verbinding mislukt. Ongeldige gebruikersnaam opgegeven!
pl: Połączenie nieudane. Podano nieprawidłowy nick!
pt_br: Falha na conexão. Apelido inválido!
ro: Conectarea a eșuat. Numele de utilizator specificat este invalid!
ru: Подключение не удалось. Некорректное имя пользователя!
sk: Pripájanie zlyhalo. Neplatný nick!
sl: Povezava prekinjena. Neveljavno ime!
sv: Anslutningen misslyckades. Ogiltigt nick angivet!
uk: Не вдалося виконати з'єднання. Хибне ім'я користувача!

source: Error
de: Fehler
et: Viga
hr: Pogreška
hu: Hiba
it: Errore
ja: エラー
lt: Klaida
lv: Kļūda
mk: Грешка
nl: Fout
pl: Błąd
pt_br: Erro
ro: Eroare
ru: Ошибка
sk: Chyba
sl: Napaka
sv: Fel
uk: Помилка

source: Connecting failed. Invalid host provided!
de: Verbindung fehlgeschlagen. Ungültiger Hostname!
et: Ühendamine ebaõnnestus. Vale serveri IP!
hr: Povezivanje neuspjelo. Nevažeći poslužitelj unesen!
hu: Kapcsolódás sikertelen. A megadott hoszt érvénytelen!
it: Connessione fallita. Fornito host non valido!
ja: 接続に失敗しました。無効なホストです!
lt: Prisijungimas nepavyko. Pateiktas netinkamas adresas!
lv: Savienošanās neizdevās. Norādīts nederīgs hosts!
mk: Конекцијата е неуспешна: Приложениот хост е невалиден
nl: Verbinding mislukt. Ongeldige host opgegeven!
pl: Połączenie nieudane. Podano nieprawidłowy host!
pt_br: Falha na conexão. IP inválido!
ro: Conectarea a eșuat. Hostul specificat este invalid!
ru: Не удалось подключится. Неверный адрес сервера!
sk: Pripájanie zlyhalo. Neplatný hostiteľ!
sl: Povezava prekinjena. Napačen gostitelj!
sv: Anslutningen misslyckades. Felaktig host angiven!
uk: Не вдалося під'єднатися. Неприпустима адреса серверу!

source: Connecting to %s at port %u failed!
de: Verbindung zu %s an Port %u fehlgeschlagen!
et: Ühendumine serveriga %s pordiga %u ebaõnnstus!
hr: Povezivanje na %s sa portom %u je neuspjelo!
hu: Kapcsolódás ide %s:%u sikertelen!
it: Connessione a %s con porta %u fallita!
ja: %sの%uの接続に失敗しました！
lt: Prisijungimas į %s su portu %u nepavyko!
lv: Savienošanās ar %s caur %u portu neizdevās!
mk: Конектирањето до %s портата %u е неуспешно!
nl: Verbinding met %s op poort %u is mislukt!
pl: Połączenie z adresem %s na porcie %u nie powiodło się!
pt_br: Não foi possível conectar a %s na porta %u!
ro: Conectarea la %s cu portul %u a eșuat!
ru: Подключение на %s с портом %u не удалось!
sk: Pripájanie k %s na porte %u zlyhalo!
sl: Vzpostavljanje povezave s %s pri vratih %u ni uspelo!
sv: Anslutningen till %s och port %u misslyckades!
uk: Під'єднання на %s з портом %u не вдалося!

source: Connecting to %s:%u ...
de: Verbinde zu %s:%u ...
et: Loon ühendust serveriga %s:%u ...
hr: Povezivanje na %s:%u ...
hu: Csatlakozás ide %s:%u ...
it: Connessione a %s:%u ...
ja: %s:%uに接続中。。。
lt: Jungiamasi į %s:%u ...
lv: Savienojas ar %s:%u ...
mk: Се конектира на %s:%u ...
nl: Verbinden met %s:%u ...
pl: Łączenie z %s:%u ...
pt_br: Conectando a %s:%u ...
ro: Se conectează la %s:%u ...
ru: Подключение к %s:%u ...
sk: Pripájanie k %s:%u ...
sl: Vzpostavljanje povezave s %s:%u ...
sv: Ansluter till %s:%u ...
uk: Під'єднатися до %s:%u ...

source: CONNECTING
de: VERBINDE
et: Ühendan
hr: POVEZIVANJE
hu: CSATLAKOZÁS
it: CONNESSIONE
ja: 接続中
lt: JUNGIAMASI
lv: SAVIENOJAS
mk: Поврзување
nl: VERBINDEN
pl: ŁĄCZENIE
pt_br: CONECTANDO
ro: SE CONECTEAZĂ
ru: ПОДКЛЮЧЕНИЕ
sk: PRIPÁJANIE
sl: VZPOSTAVLJANJE POVEZAVE
sv: ANSLUTER
uk: ПІД'ЄДНАННЯ

source: Connection timed out
de: Zeitüberschreitung beim Verbinden
et: Ühendus aegus
hr: Veza je istekla
hu: Időtúllépés miatt a kapcsolat megszakadt
it: Connessione scaduta
ja: 接続がタイムアウトしました
lt: Baigėsi prisijungimui skirtas laikas
lv: Savienojums iztecējis
mk: Конекцијата е прекината
nl: Verbinden duurde te lang
pl: Połączenie przekroczyło czas oczekiwania
pt_br: O tempo da conexão expirou
ro: Conexiunea a expirat
ru: Время подключения истекло
sk: Časový limit spojenia vypršal
sl: Povezava je potekla
sv: Anslutningen nådde en maxtidsgräns
uk: Час під'єднання минув

source: Disconnected: unknown protocol error
de: Verbindung getrennt: Unbekannter Protokollfehler
et: Ühendus katkestati: teadmata protokolli viga
hr: Odspojeni: nepoznata greška protokola
hu: Lecsatlakozva: ismeretlen protokoll hiba
it: Disconnesso: protocollo d'errore sconosciuto
ja: 切断：不明なプロトコルエラー
lt: Atjungta: nežinoma protokolo klaida
lv: Atvienošanās: nezināma protokola kļūda
mk: Дисконектиран: непозната грешка на протоколот
nl: Verbinding verbroken: onbekende protocol fout
pl: Rozłączono: Nieznany błąd protokołu
pt_br: Desconectado: ocorreu um erro de protocolo desconhecido.
ro: Deconectat: eroare de protocol necunoscută
ru: Отключено: неизвестная ошибка протокола
sk: Odpojené: neznámy protokol
sl: Prekinjeno: neznana napaka protokola
sv: Frånkopplad: okänt protokollfel
uk: Від'єднано: невідома помилка протоколу

source: Disconnected: disconnected remotely
de: Verbindung getrennt: Verbindung zum Server getrennt
et: Ühendus katkestati: katkestati kuskilt mujalt
hr: Odspojeni: odspojeni ste daljinski
hu: Lecsatlakozva: lecsatlakozva távolról
it: Disconnesso: disconnesso remotamente
ja: 切断：リモートで切断しました
lt: Atjungta: buvote atjungtas nuotoliniu būdu
lv: Atvienošanās: savienojums pazuda attālināti
mk: Дисконектиран: дисконектиран рачно
nl: Verbinding verbroken: verbroken op afstand
pl: Rozłączono: Rozłączono zdalnie
pt_br: Desconectado: desconectado remotamente
ro: Deconectat: deconectat automat
ru: Отключено: удалённое отключение
sk: Odpojené: odpojené vzdialene
sl: Povezava prekinjena: povezava prekinjena na daljavo
sv: Frånkopplad: frånkopplad på distans
uk: Від'єднано: віддалене від'єднання

source: Disconnected: connection lost remotely
de: Verbindung getrennt: Verbindung zum Server verloren
et: Ühendus katkestati: ühendus kadus
hr: Odspojeni: veza izgubljena daljinski
hu: Lecsatlakozva: kapcsolat megszakítva távolról
it: Disconnesso: connessione persa remotamente
ja: 切断： リモートで接続が失われました
lt: Atsijungta: Nutrūko ryšys su nuotoliu
lv: Atvienošanās: savienojums pazuda attālināti
mk: Дисконектиран: конекцијата е изгубена рачно
nl: Verbinding verbroken: verbinding verloren op afstand
pl: Rozłączono: Utracono połączenie zdalne
pt_br: Desconectado: conexão foi perdida remotamente
ro: Deconectat: conexiune pierdută
ru: Отключение: потеряно удаленное соединение
sk: Odpojené: spojenie vzdialene stratené
sl: Povezava prekinjena: povezava izgubljena na daljavo
sv: Frånkopplad: anslutningen tappad på distans
uk: Від'єднано: втрачено віддалене з'єднання

source: Disconnected: you are banned from this server
de: Verbindung getrennt: Du wurdest von diesem Server gebannt
et: Ühendus katkestati: sa oled bannitud selles serverist
hr: Odspojeni: trajno ste izbačeni sa ovog servera
hu: Lecsatlakozva: ki lettél tiltva a szerverről
it: Disconnesso: sei stato bannato da questo server
ja: 切断： あなたはこのサーバーから禁止されました
lt: Atjungta: jūsų prisijungimas yra užblokuotas šiame serveryje
lv: Atvienots: jums ir liegta piekļuve šim serverim
mk: Дисконектиран: Вие сте баниран од серверот
nl: Verbinding verbroken: u bent verbannen van deze server
pl: Rozłączono: Zostałeś zbanowany na tym serwerze
pt_br: Desconectado: você está banido desse servidor
ro: Deconectat: ai interdicție pe acest server
ru: Отключение: вы забанены на этом сервере
sk: Odpojené: si zabanovaný na tomto serveri
sl: Povezava prekinjena: Nimate več dostopa do strežnika
sv: Frånkopplad: du är bannlyst från denna server
uk: Від'єднано: ви забанені на цьому сервері

source: Disconnected: disconnected from the server
de: Verbindung getrennt: Verbindung zum Server getrennt
et: Ühendus katkestati: lahkusid serverist
hr: Odspojeni: odspojeni sa servera
hu: Lecsatlakozva: lecsatlakozva a szerverről
it: Disconnesso: disconnesso dal server
ja: 切断： サーバーから切断されました
lt: Atsijungta: atsijungta nuo serverio
lv: Atvienots: atvienojās no servera
mk: Дисконектиран: Дисконектиран од серверот
nl: Verbinding verbroken: verbinding verbroken met de server
pl: Rozłączono: Rozłączono z serwerem
pt_br: Desconectado: desconectado do servidor
ro: Deconectat: deconectat de la server
ru: Отключено: отключен от сервера
sk: Odpojené: odpojené zo servera
sl: Povezava prekinjena: Odjava iz strežnika
sv: Frånkopplad: frånkopplad från servern
uk: Від'єднано: від'єднаний від сервера

source: Disconnected: connection to the server was lost
de: Verbindung getrennt: Verbindung zum Server verloren
et: Ühendus katkestati: ühendus serveriga katkes
hr: Odspojeni: veza sa serverom se izgubila
hu: Lecsatlakozva: a kapcsolat megszakadt a szerverrel
it: Disconnesso: la connessione al server è stata perduta
ja: 切断：サーバーとの接続が失われました
lt: Atsijungta: ryšys su serveriu buvo prarastas
lv: Atvienojās: pārtrūka savienojums ar serveri
mk: Врската со серверот беше прекината.
nl: Verbinding verbroken: verbinding naar de server is verbroken
pl: Rozłączono: Połączenie z serwerem zostało przerwane
pt_br: Desconectado: conexão com o servidor foi perdida
ro: Deconectat: conexiunea la server a fost pierdută
ru: Отключено: связь с сервером была потеряна
sk: Odpojené: pripojenie na server bolo stratené
sl: Povezava prekinjena: Povezava s strežnikom je bila prekinjena.
sv: Frånkopplad: anslutningen till servern gick förlorad
uk: Від'єднано: зв'язок з сервером було втрачено

source: Disconnected: connection was refused
de: Verbindung getrennt: Verbindung verweigert
et: Ühendus katkestati: server ei soovi ühendada
hr: Odspojeni: veza je odbijena
hu: Lecsatlakozva: a kapcsolat visszautasítva
it: Disconnesso: la connessione è stata rifiutata
ja: 切断: 接続が拒否されました
lt: Atjungta: prisijungimas buvo atmestas
lv: Atvienots: neizdevās savienoties
mk: Дисконектиран: конекцијата e oдбиена
nl: Verbinding verbroken: verbinding geweigerd
pl: Rozłączono: Połączenie zostało odrzucone
pt_br: Desconectado: conexão foi recusada
ro: Deconectat: conectarea a fost refuzată
ru: Отключено: соединение было сброшено
sk: Odpojené: pripojenie bolo odmietnuté
sl: Povezava prekinjena: Povezava je bila zavrnjena
sv: Frånkopplad: anslutningen tilläts ej
uk: Від'єднано: з'єднання було скинуто

source: No such mod installed (%s)
de: Mod %s ist nicht installiert
et: Pole sellist modifikatsiooni installeeritud (%s)
hr: Takva modifikacija nije instalirana (%s)
hu: Nincs ilyen mód telepítve (%s)
it: Questa mod non è installata (%s)
ja: (%s) MODはインストールしていません
lt: Tokia modifikacija nėra įdiegta (%s)
lv: Nav ieinstalēta šī modifikācija (%s)
mk: Непостоечки мод (%s)
nl: Geen dergelijke mod geïnstalleerd (%s)
pl: Ten mod nie jest zainstalowany (%s)
pt_br: Este mod não está instalado: (%s)
ro: Nu există asemena mod instalat (%s)
ru: Не установлен модуль (%s)
sk: Nie je inštalovaný taký mód (%s)
sl: Tak način ni nameščena (%s)
sv: Ingen sådan modifikation installerad (%s)
uk: Не встановлений модуль (%s)

source: Bad server response (2)
de: Ungültige Serverantwort (2)
et: Server ei vasta (2)
hr: Pogrešan odgovor poslužitelja (2)
hu: Nincs szerver válasz (2)
it: Cattiva risposta del server (2)
ja: 不正なサーバーレスポンス (2)
lt: Blogas atsakas iš serverio (2)
lv: Nav servera atbildes (2)
mk: Погрешен одговор од серверот (2)
nl: Slecht antwoord van de server (2)
pl: Nieprawidłowa odpowiedź serwera (2)
pt_br: Resposta do servidor inválida (2)
ro: Răspuns invalid de la server (2)
ru: Неверный ответ сервера (2)
sk: Chybná odpoveď servera (2)
sl: Slab odziv strežnika (2)
sv: Fel vid serversvar (2)
uk: Хибна відповідь сервера (2)

source: Bad server response (1)
de: Ungültige Serverantwort (1)
et: Server ei vasta (1)
hr: Pogrešan odgovor poslužitelja (1)
hu: Nincs szerver válasz (1)
it: Cattiva risposta del server (1)
ja: 不正なサーバー返答でした (1)
lt: Blogas atsakas iš serverio (1)
lv: Nav servera atbildes (1)
mk: Погрешен одговор од серверот (1)
nl: Slecht antwoord van de server (1)
pl: Nieprawidłowa odpowiedź serwera (1)
pt_br: Resposta do servidor inválida (1)
ro: Răspuns invalid de la server (1)
ru: Неверный ответ сервера (1)
sk: Chybná odpoveď servera (1)
sl: Slab odziv strežnika (1)
sv: Fel vid serversvar (1)
uk: Хибна відповідь сервера (1)

source: CONSOLE
de: KONSOLE
et: KONSOOL
hr: KONZOLA
hu: KONZOL
ja: コンソール
lt: KONSOLĖ
lv: KONSOLE
mk: Конзола
pl: KONSOLA
ro: CONSOLĂ
ru: КОНСОЛЬ
sk: KONZOLA
sl: KONZOLA
sv: KONSOL
uk: КОНСОЛЬ
