Repository: multitheftauto/mtasa-blue
Catalog: Shared/data/MTA San Andreas/MTA/locale/*/client.po
Languages: de, et, hr, hu, it, ja, lt, lv, mk, nl, pl, pt_br, ro, ru, sk, sl, sv, uk

source: Accelerate Axis
de: Beschleunigungsachse
et: Kiirenduse kang
hr: Os ubrzanja
hu: Gyorsulás
it: Accelera asse
ja: 加速軸
lt: Pagreičio Ašis
lv: Akselerācijas Ass
mk: Забрзана оска
nl: Versnel Assen
pl: Oś przyspieszenia
pt_br: Eixo de Aceleração
ro: Axa de accelerare
ru: Ось ускорения
sk: Os akcelerácie
sl: Pospešitvena os
sv: Accelerations Axel
uk: Вісь прискорення

source: Brake Axis
de: Bremsachse
et: Pidurdamise kang
hr: Os kočnice
hu: Lassulás
it: Rallenta asse
ja: ブレーキ軸
lt: Stabdymo Ašis
lv: Bremžu Ass
mk: Запирачка оска
nl: Vertraag Assen
pl: Oś hamowania
pt_br: Eixo de Freio
ro: Axa de frânare
ru: Ось торможения
sk: Os brzdenia
sl: Zavorna os
sv: Broms Axel
uk: Вісь гальмування

source: Fire
de: Feuer
et: Tulistamine
hr: Pucaj
hu: Tűz
it: Spara
ja: 撃つ
lt: Šaudymas
lv: Uguns
mk: Пукај
nl: Schiet
pl: Strzał
pt_br: Atirar
ro: Trăgaci
ru: Огонь
sk: Streľba
sl: Ogenj
sv: Skjut
uk: Вогонь

source: Next weapon
de: Nächste Waffe
et: Järgmine relv
hr: Sljedeće oružje
hu: Következő fegyver
it: Arma successiva
ja: 次の武器
lt: Kitas ginklas
lv: Nākošais ierocis
mk: Следно оружје
nl: Volgend wapen
pl: Następna broń
pt_br: Arma seguinte
ro: Arma următoare
ru: Следующее оружие
sk: Ďalšia zbraň
sl: Naslednje orožje
sv: Nästa vapen
uk: Наступна зброя

source: Previous weapon
de: Vorherige Waffe
et: Eelmine relv
hr: Prijašnje oružje
hu: Előző fegyver
it: Arma precedente
ja: 前の武器
lt: Ankstesnis ginklas
lv: Iepriekšējais ierocis
mk: Претходно оружје
nl: Vorig wapen
pl: Poprzednia broń
pt_br: Arma anterior
ro: Arma precedentă
ru: Предыдущее оружие
sk: Predchádzajúca zbraň
sl: Prejšnje orožje
sv: Föregående vapen
uk: Попередня зброя

source: Forwards
de: Vorwärts
et: Edasi suunas
hr: Naprijed
hu: Előre
it: Avanti
ja: 前方へ
lt: Pirmyn
lv: Uz priekšu
mk: Нанапред
nl: Voorwaarts
pl: Do przodu
pt_br: Andar para frente
ro: Înainte
ru: Вперёд
sk: Dopredu
sl: Naprej
sv: Framåt
uk: Вперед

source: Backwards
de: Rückwärts
et: Tagasi suunas
hr: Unatrag
hu: Hátra
it: Indietro
ja: 後方へ
lt: Atgal
lv: Atpakaļ
mk: Наназад
nl: Achterwaarts
pl: Do tyłu
pt_br: Andar para trás
ro: Înapoi
ru: Назад
sk: Späť
sl: Nazaj
sv: Bakåt
uk: Назад

source: Left
de: Links
et: Vasakule
hr: Lijevo
hu: Balra
it: Sinistra
ja: 左
lt: Kairėn
lv: Pa kreisi
mk: Лево
nl: Links
pl: W lewo
pt_br: Ir para esquerda
ro: Stânga
ru: Влево
sk: Vľavo
sl: Levo
sv: Vänster
uk: Ліворуч

source: Right
de: Rechts
et: Paremale
hr: Desno
hu: Jobbra
it: Destra
ja: 右
lt: Dešinėn
lv: Pa labi
mk: Десно
nl: Rechts
pl: W prawo
pt_br: Ir para direita
ro: Dreapta
ru: Вправо
sk: Vpravo
sl: Desno
sv: Höger
uk: Праворуч

source: Zoom in
de: Vergrößern (Hineinzoomen)
et: Zoomi sisse
hr: Uvećaj
hu: Nagyítás
it: Aumenta lo zoom
ja: 拡大表示ボタン
lt: Priartinti
lv: Pietuvināšana
mk: Зумирај
nl: Inzoomen
pl: Przybliżenie
pt_br: Ampliar
ro: Mărește
ru: Увеличить
sk: Priblížiť
sl: Povečaj
sv: Zooma in
uk: Збільшити

source: Zoom out
de: Verkleinern (Herauszoomen)
et: Zoomi välja
hr: Umanji
hu: Kicsinyítés
it: Diminiusce lo zoom
ja: 縮小表示ボタン
lt: Patolinti
lv: Attālināšana
mk: Одзумирај
nl: Uitzoomen
pl: Oddalenie
pt_br: Diminuir
ro: Micșorează
ru: Уменьшить
sk: Oddialiť
sl: Pomanjšaj
sv: Zooma ut
uk: Зменшити

source: Enter/Exit
de: Einsteigen/Aussteigen
et: Sisene/Välju
hr: Uđi/Izađi
hu: Beszállás/Kiszállás
it: Entra/Esci
ja: 入る/出る
lt: Įlipti/Išlipti
lv: Iekāpšana/Izkāpšana
mk: Излези/Влези
nl: Instappen/Uitstappen
pl: Wejście/wyjście
pt_br: Entrar/Sair do veículo
ro: Intrare/Ieşire
ru: Вход/Выход
sk: Vstúpiť/Vystúpiť
sl: Vstop/Izstop
sv: In/Ut
uk: Вхід/Вихід

source: Change camera
de: Kameraansicht ändern
et: Vaheta kaamerat
hr: Promijeni kameru
hu: Kamera váltása
it: Cambia visuale
ja: カメラを変更する
lt: Pakeisti kamerą
lv: Mainīt kameru
mk: Смени ја камерата
nl: Camera veranderen
pl: Zmień tryb kamery
pt_br: Mudar a câmera
ro: Schimbă camera
ru: Сменить камеру вида
sk: Zmeniť kameru
sl: Spremeni pogled
sv: Ändra kamera
uk: Змінити камеру виду

source: Jump
de: Springen
et: Hüppamine
hr: Skoči
hu: Ugrás
it: Salta
ja: ジャンプ
lt: Šokti
lv: Lekt
mk: Скокни
nl: Spring
pl: Skok
pt_br: Pular
ro: Săritură
ru: Прыжок
sk: Skok
sl: Skok
sv: Hoppa
uk: Стрибок

source: Sprint
de: Sprinten
et: Sprintimine
hr: Trčanje
hu: Futás
it: Scatto
ja: 走る
lt: Bėgti
lv: Skriet
mk: Спринтај
pt_br: Correr
ru: Бег
sk: Šprint
sl: Šprint
sv: Spring
uk: Біг

source: Look behind
de: Nach hinten schauen
et: Taha vaatamine
hr: Pogled iza
hu: Hátranézés
it: Guarda dietro
ja: 後ろを見る
lt: Pažiūrėti atgal
lv: Paskatīties uz atpakaļu
mk: Погледни наназад
nl: Kijk achterom
pl: Patrz za siebie
pt_br: Olhar para trás
ro: Privire in urmă
ru: Смотреть назад
sk: Pohľad zozadu
sl: Poglej za sabo
sv: Titta bakåt
uk: Оглядатися назад

source: Crouch
de: Hinhocken
et: Kükitama
hr: Čučni
hu: Guggolás
it: Inginocchiati
ja: かがむ
lt: Pritūpti
lv: Notupties
mk: Ползи
nl: Bukken
pl: Kucnięcie
pt_br: Agaixar
ro: Ghemuire
ru: Присесть
sk: Skrčiť sa
sl: Počepni
sv: Huka
uk: Присісти

source: Action
de: Aktion
et: Tegutsema
hr: Akcija
hu: Akció
it: Azione
ja: アクション
lt: Veiksmas
lv: Darbība
mk: Акција
nl: Actie
pl: Czynność
pt_br: Ação
ro: Acţiune
ru: Действие
sk: Akcia
sl: Dejanje
sv: Åtgärd
uk: Дія

source: Walk
de: Laufen
et: Kõndima
hr: Hodati
hu: Séta
it: Cammina
ja: 歩く
lt: Eiti
lv: Iet
mk: Оди
nl: Lopen
pl: Chód
pt_br: Andar
ro: Mers
ru: Шаг
sk: Chôdza
sl: Hoja
sv: Gå
uk: Крок

source: Vehicle fire
de: Waffe des Fahrzeugs abfeuern
et: Autoga tulistamine
hr: Pucanje iz vozila
hu: Jármű fegyvere
it: Spara da veicolo
ja: 運転席で攻撃する
lt: Transporto priemonės ugnis
lv: Šaušana no transporta
mk: Автомобилско пукање
nl: Schieten uit voertuig
pl: Strzał (pojazd)
pt_br: Atirar de um veículo
ro: Trăgaci vehicul
ru: Транспорт: Огонь
sk: Streľba z vozidla
sl: Požar na vozilu
sv: Fordon skjuta
uk: Транспорт: Вогонь

source: Vehicle secondary fire
de: Sekundärwaffe des Fahrzeugs abfeuern
et: Autoga tulistamine teisest relvast
hr: Sekundarno pucanje iz vozila
hu: Jármű másodlagos fegyvere
it: Fuoco secondario da veicolo
ja: 助手席で攻撃する
lt: Tr. priemonės antrinė ugnis
lv: Transportlīdzekļa alternatīvā šaušana
mk: Секундарно оружје
nl: Alternatief schieten uit voertuig
pl: Strzał dodatkowy (pojazd)
pt_br: Atirar de um veículo com a arma secundária
ro: Trăgaci secundar vehicul
ru: Транспорт: Огонь (2)
sk: Sekundárna streľba z vozidla
sl: Sekundarni požar na vozilu
sv: Fordon alternativ skjuta
uk: Транспорт: Вогонь (2)

source: Vehicle left
de: Nach links lenken
et: Autoga vasakule
hr: Vozilo ulijevo
hu: Balra kanyarodás
it: Sterza a sinistra
ja: 車両の左
lt: Pasukti tr. priemonę kairėn
lv: Braukt pa kreisi
mk: Десно возило
nl: Voertuig links
pl: W lewo (pojazd)
pt_br: Virar à esquerda
ro: Vehicul stânga
ru: Транспорт: Влево
sk: Vozidlo vľavo
sl: Vozilo levo
sv: Fordon vänster
uk: Транспорт: Ліворуч

source: Vehicle right
de: Nach rechts lenken
et: Sõidukiga paremale
hr: Vozilo udesno
hu: Jobbra kanyarodás
it: Sterza a destra
ja: 車両の右
lt: Pasukti tr. priemonę dešinėn
lv: Braukt pa labi
mk: Лево возило
nl: Voertuig rechts
pl: W prawo (pojazd)
pt_br: Virar à direita
ro: Vehicul dreapta
ru: Транспорт: Вправо
sk: Vozidlo vpravo
sl: Vozilo desno
sv: Fordon höger
uk: Транспорт: Праворуч

source: Steer forwards/down
de: Nach vorn/unten lenken
et: Juhtima edasi/alla
hr: Usmjeriti prema naprijed/dolje
hu: Irányítás előre/lefele
it: Movimento speciale avanti/sotto (stoppie/atterra)
ja: 舵を下/前方に取る
lt: Palinkti į priekį/žemyn
lv: Stūrēt uz priekšu/atpakaļ
mk: Управувај нанпред/надоле
nl: Stuur vooruit/naar beneden
pl: Do przodu/tyłu
pt_br: Rotacionar para frente/baixo
ro: Dirijare înainte/jos
ru: Транспорт: Наклон вперед/Вниз
sk: Riadenie odpredu/dozadu
sl: Usmerjati naprej/navzdol
sv: Styr framåt/nedåt
uk: Транспорт: Нахил вперед/Вниз

source: Steer backwards/up
de: Nach hinten/oben lenken
et: Juhtima tagasi/üles
hr: Usmjeriti prema natrag/gore
hu: Irányítás hátra/felfele
it: Movimento speciale dietro/sopra (impennata/decolla)
ja: 舵を上/後方に取る
lt: Palinkti atgal/aukštyn
lv: Stūrēt atpakaļ/uz priekšu
mk: Управувај наназад/нагоре
nl: Stuur vooruit/omhoog
pl: Do dołu/góry
pt_br: Rotacionar para trás/cima
ro: Dirijare înapoi/sus
ru: Транспорт: Наклон назад/Вверх
sk: Riadenie dozadu/hore
sl: Usmerjati nazaj/gor
sv: Styr bakåt/upp
uk: Транспорт: Нахил назад/Вгору

source: Accelerate
de: Beschleunigen
et: Kiirendamine
hr: Ubrzanje
hu: Gáz
it: Accelera
ja: アクセル
lt: Didinti greitį
lv: Akselerācija
mk: Забрзај
nl: Versnellen
pl: Przyspieszanie
pt_br: Acelerar
ro: Accelerare
ru: Транспорт: Газ
sk: Akcelerácia
sl: Pospešiti
sv: Accelerera
uk: Транспорт: Газ

source: Brake/Reverse
de: Bremse/Rückwärts
et: Pidurdamine/Tagurdamine
hr: Kočnica/Unatrag
hu: Fék/Tolatás
it: Freno/retromarcia
ja: ブレーキ/バック
lt: Stabdyti/Atgal
lv: Bremzes/Atpakaļgaita
mk: Закочи/Наназад
nl: Rem/Achteruit
pl: Hamowanie/Cofanie
pt_br: Freiar/Ré
ro: Frână/Marşarier
ru: Транспорт: Тормоз/Задний ход
sk: Brzda/Cúvanie
sl: Zavora/Vzvratno
sv: Bromsa/Backa
uk: Транспорт: Гальмо/Задній хід

source: Radio next
de: Nächsten Radiokanal auswählen
et: Järgmine raadiojaam
hr: Sljedeća stanica
hu: Következő rádió csatorna
it: Stazione radio successiva
ja: 次のラジオチャンネル
lt: Sekanti radijo
lv: Nākošais radio
mk: Следно радио
nl: Volgend radio station
pl: Następna stacja
pt_br: Próxima rádio
ro: Stația radio următoare
ru: След. радиостанция
sk: Ďalšie rádio
sl: Naslednja radijska postaja
sv: Radio nästa
uk: Наст. радіостанція

source: Radio previous
de: Vorherigen Radiokanal auswählen
et: Eelmine raadiojaam
hr: Prethodna stanica
hu: Előző rádió csatorna
it: Stazione radio precedente
ja: 前のラジオチャンネル
lt: Ankstesnė radijo
lv: Iepriekšējais radio
mk: Претходно радио
nl: Vorig radio station
pl: Poprzednia stacja
pt_br: Rádio anterior
ro: Stația radio anterioară
ru: Пред. радиостанция
sk: Predchádzajúce rádio
sl: Prejšnja radijska postaja
sv: Radio föregående
uk: Попер. радіостанція

source: Radio user track skip
de: User Track Player Song überspringen
et: Raadio kasutaja lugude vahele jätmine
hr: Preskoči radio stanicu
hu: Egyedi zene átugrása
it: Traccia successiva (user tracks)
ja: ユーザラジオトラックをスキップ
lt: Praleisti user track dainą
lv: Lietotāja dziesmas pārslēgšana
mk: Корисничко радио
nl: User Track Player nummer overslaan
pl: Pomiń ścieżkę radiową
pt_br: Pular faixa do usuário
ro: Salt stație radio personalizată
ru: Пропустить трек
sk: Preskočiť rádio user track
sl: Preskoči glasbo uporabnika
sv: Radio hoppa över låt
uk: Пропустити трек

source: Horn
de: Hupe
et: Signaal
hr: Truba
hu: Duda
it: Clacson
ja: 警笛
lt: Garso signalas
lv: Signāls
mk: Свири
nl: Claxon
pl: Klakson
pt_br: Buzinar
ro: Claxon
ru: Транспорт: Сигнал
sk: Klaksón
sl: Hupa
sv: Tuta
uk: Транспорт: Сигнал

source: Sub-mission
de: Nebenmission
et: Kõrval missioon
hr: pod-misija
hu: Mellékküldetés
it: Sotto-missioni
ja: サブミッション
lt: Papildoma misija
lv: Pieteikšanās
mk: Секундарна мисија
nl: Sub-missie
pl: Misja poboczna
pt_br: Ativar uma missão secundária
ro: Sub-misiune
ru: Транспорт: Подмиссия/Шасси
sk: Sub-misia
sl: Stranske misije
sv: Sub-uppdrag
uk: Транспорт: Підмісія/Шасі

source: Handbrake
de: Handbremse
et: Käsipidur
hr: Ručna kočnica
hu: Kézifék
it: Freno a mano
ja: ハンドブレーキ
lt: Rankinis stabdis
lv: Rokas bremze
mk: Рачна кочница
nl: Handrem
pl: Hamulec ręczny
pt_br: Usar o freio de mão
ro: Frână de mână
ru: Транспорт: Ручной тормоз
sk: Ručná brzda
sl: Ročna zavora
sv: Handbroms
uk: Транспорт: Ручні гальма

source: Vehicle look left
de: Im Fahrzeug nach links schauen
et: Sõidukis vasakule vaatamine
hr: Pogled lijevo iz vozila
hu: Járműből balra nézés
it: Guarda a sinistra (veicolo)
ja: 車で左に見る
lt: Tr. priemonėje žiūrėti kairėn
lv: Skats pa kreisi no transportlīdzekļa
mk: Поглед налево од возилото
nl: Voertuig kijk links
pl: Spójrz w lewo (pojazd)
pt_br: Olhar para esquerda (veículo)
ro: Vehicul privire stânga
ru: Транспорт: Взгляд налево
sk: Pohľad vozidla vľavo
sl: Pogled levo v vozilu
sv: Fordon titta vänster
uk: Транспорт: Дивитися ліворуч

source: Vehicle look right
de: Im Fahrzeug nach rechts schauen
et: Sõidukis paremale vaatamine
hr: Pogled desno iz vozila
hu: Járműből jobbra nézés
it: Guarda a destra (veicolo)
ja: 車で右に見る
lt: Tr. priemonėje žiūrėti dešinėn
lv: Transportlīdzekļa skats pa labi
mk: Поглед надесно од возилото
nl: Voertuig kijk rechts
pl: Spójrz w prawo (pojazd)
pt_br: Olhar para direita (veículo)
ro: Vehicul privire dreapta
ru: Транспорт: Взгляд направо
sk: Pohľad vozidla vpravo
sl: Pogled desno v vozilu
sv: Fordon titta höger
uk: Транспорт: Дивитися праворуч

source: Vehicle look behind
de: Im Fahrzeug nach hinten schauen
et: Sõidukis taha vaatamine
hr: Pogled iza iz vozila
hu: Járműből hátra nézés
it: Guarda dietro (veicolo)
ja: 車で後ろに見る
lt: Tr. priemonėje žiūrėti atgal
lv: Transportlīdzekļa aizmugurējais skats
mk: Поглед наназад од возилото
nl: Voertuig kijk achterom
pl: Spójrz za siebie (pojazd)
pt_br: Olhar para trás (veículo)
ro: Vehicul privire înapoi
ru: Транспорт: Смотреть назад
sk: Pohľad vozidla vzad
sl: Poglej za vozilom
sv: Fordon titta bakom
uk: Транспорт: Оглядатись назад

source: Vehicle mouse look
de: Im Fahrzeug mit der Maus umsehen
et: Sõidukiga hiirega vaatamine
hr: Pogled iza vozila
hu: Járműben egérhasználat
it: Visuale col mouse (veicolo)
ja: 車にマウスで見る
lt: Tr. priemonėje žvalgytis pele
lv: Transportlīdzekļa peles skats
mk: Поглед со маусот од возилото
nl: Voertuig muis kijk
pl: Kamera związana z myszką (pojazd)
pt_br: Câmera ao redor (veículo)
ro: Vehicul privire mouse
ru: Транспорт: Обзор мышью
sk: Pohľad vozidla myšou
sl: Pogled okrog vozila z miško
sv: Fordon mus look
uk: Транспорт: Огляд мишею

source: Special control left
de: Spezialsteuerung links
et: Eriline käsk vasakule
hr: Specijalna kontrola lijevo
hu: Speciális irányítás balra
it: Azione speciale sinistra
ja: スペシャルコントロール左
lt: Spec. valdiklis kairėn
lv: Īpašā vadība pa kreisi
mk: Специјална контрола лево
nl: Speciale controle links
pl: Specjalne - w lewo
pt_br: Controle especial - esquerda
ro: Control special stânga
ru: Транспорт: Доп. влево
sk: Špeciálne ovládanie vľavo
sl: Poseben ukaz levo
sv: Specialkontroll vänster
uk: Транспорт: Дод. ліворуч

source: Special control right
de: Spezialsteuerung rechts
et: Eriline käsk paremale
hr: Specijalna kontrola desno
hu: Speciális irányítás jobbra
it: Azione speciale destra
ja: スペシャルコントロール右
lt: Spec. valdiklis dešinėn
lv: Īpašā vadība pa labi
mk: Специјална контрола лево
nl: Speciale controle rechts
pl: Specjalne - w prawo
pt_br: Controle especial - direita
ro: Control special dreapta
ru: Транспорт: Доп. вправо
sk: Špeciálne ovládanie vpravo
sl: Poseben ukaz desno
sv: Specialkontroll höger
uk: Транспорт: Дод. праворуч

source: Special control down
de: Spezialsteuerung unten
et: Eriline käsk alla
hr: Specijalna kontrola dolje
hu: Speciális irányítás le
it: Azione speciale sotto
ja: スペシャルコントロール下
lt: Spec. valdiklis žemyn
lv: Īpašā vadība uz leju
mk: Специјална контрола надолу
nl: Special controle beneden
pl: Specjalne - w dół
pt_br: Controle especial - baixo
ro: Control special jos
ru: Транспорт: Доп. вниз
sk: Špeciálne ovládanie dole
sl: Poseben ukaz dol
sv: Specialkontroll ned
uk: Транспорт: Дод. вниз

source: Special control up
de: Spezialsteuerung oben
et: Eriline käsk üles
hr: Specijalna kontrola gore
hu: Speciális irányítás fel
it: Azione speciale sopra
ja: スペシャルコントロール上
lt: Spec. valdiklis aukštyn
lv: Īpašā vadība uz augšu
mk: Специјална контрола нагоре
nl: Speciale controle omhoog
pl: Specjalne - w górę
pt_br: Controle especial - cima
ro: Control special sus
ru: Транспорт: Доп. вверх
sk: Špeciálne ovládanie hore
sl: Poseben ukaz gor
sv: Special kontroll upp
uk: Транспорт: Дод. вгору

source: Aim weapon
de: Waffe zielen
et: Sihi relvaga
hr: Ciljanje oružjem
hu: Célzás
it: Mira con l'arma
ja: 武器で狙う
lt: Taikymasis ginklu
lv: Ieroča mērķēšana
mk: Нишани со оружјето
nl: Richt wapen
pl: Celowanie bronią
pt_br: Mira
ro: Ţintă armă
ru: Прицел оружия
sk: Mieriť zbraňou
sl: Nameri z orožjem
sv: Sikta vapen
uk: Приціл

source: Conversation yes
de: Konversation bejahen
et: Vestlus jaatav
hr: Razgovarati
hu: Társalgás: igen
it: Conversazione positiva
ja: 会話はい
lt: Atsakyti taip
lv: Sarunas piekrišana
mk: Конверзација да
nl: Accepteer gesprek
pl: Rozmowa - Tak
pt_br: Conversação - Sim
ro: Conversaţie afirmativă
ru: Группа: согласиться
sk: Konverzácia áno
sl: Pogovor da
sv: Konversation ja
uk: Спільнота: погодитися

source: Conversation no
de: Konversation verneinen
et: Vestlus eitav
hr: Ne razgovarati
hu: Társalgás: nem
it: Conversazione negativa
ja: 会話いいえ
lt: Atsakyti ne
lv: Sarunas noraidījums
mk: Конверзација не
nl: Geen gesprek voeren
pl: Rozmowa - Nie
pt_br: Conversação - Não
ro: Conversaţie negativă
ru: Группа: отказаться
sk: Konverzácia nie
sl: Pogovor ne
sv: Konversation nej
uk: Спільнота: відмовитися

source: Group control forwards
de: Gruppenkontrolle vorwärts
et: Grupi käsk edasi
hr: Grupna kontrola naprijed
hu: Csoportos irányítás előre
it: Controlli di gruppo (avanzare)
ja: グループコントロール前方
lt: Gaujos nurodymas pirmyn
lv: Grupas kontrole uz priekšu
mk: Групна контрола нанапред
nl: Groepbesturing vooruit
pl: Kieruj grupę do przodu
pt_br: Ordenar ao grupo para avançar
ro: Control de grup înainte
ru: Группа: вперёд
sk: Skupinové ovládanie dopredu
sl: Nadzor skupine naprej
sv: Grupp kontroll framåt
uk: Спільнота: вперед

source: Group control backwards
de: Gruppenkontrolle rückwärts
et: Grupi käsk tagasi
hr: Grupna kontrola nazad
hu: Csoportos irányítás hátra
it: Controlli di gruppo (ritirarsi)
ja: グループコントロール後方
lt: Gaujos nurodymas atsitraukti
lv: Grupas kontrole uz atpakaļu
mk: Групна контрола наназад
nl: Groepsbesturing achteruit
pl: Kieruj grupę do tyłu
pt_br: Ordenar ao grupo para recuar
ro: Control de grup înapoi
ru: Группа: назад
sk: Skupinové ovládanie dozadu
sl: Nadzor skupine nazaj
sv: Grupp kontroll bakåt
uk: Спільнота: назад

source: English
et: Eesti
hr: Hrvatski
hu: Magyar
ja: 日本語
lt: Lietuvių
lv: Latviešu
mk: Македонски
pl: Polski
pt_br: Português (BR)
ro: Română
ru: Русский
sk: Slovenčina
sl: slovensko
sv: svenska
uk: Українська

source: You are using a feature-branch build! This is a test build only which cannot be used to connect to public servers!
hu: Te egy olyan MTA:SA-t használsz, ami a későbbiekben lesz hivatalosan kiadva! Ez egy teszt verzió, amellyel nem tudsz felcsatlakozni publikus szerverekre!
lt: Naudojate kūrėjų versiją! Tai yra versija skirta testavimui ir negali būti naudojama prisijungimui į viešus serverius!
mk: Вие користите нова верзија, и истата не може да се конектира на јавни сервери!
pt_br: Você está usando uma compilação de teste! Esta versão não pode ser usada para se conectar a servidores públicos!
ru: Вы используете feature-branch разработку! Это тестовая сборка, которая не может использоваться для подключения к публичным серверам!
uk: Ви використовуєте функціональну структуру! Це лише тестова побудова, яка не може бути використана для підключення до загальнодоступних серверів!

source: This will disconnect you from the current server. Are you sure you want to disconnect?
de: Dies wird deine Verbindung zum aktuellen Server trennen. Bist du sicher, dass du die Verbindung trennen willst?
et: See toiming katkestab ühenduse praeguse serveriga. Oled sa kindel, et tahad ühendust katkestada?
hr: Odspojit će te se sa trenutnog servera. Jeste li sigurni da se želite odspojiti?
hu: Ezzel lefogsz csatlakozni a jelenlegi szerverről. Biztos vagy benne, hogy lecsatlakozol?
it: Questo ti disconnetterà dal server corrente. Sei sicuro di volerti disconnettere?
ja: サーバーから切断されることになります。 本当にサーバーから切断しますか。
lt: Ketinate atsijungti iš serverio. Ar tikrai to norite?
lv: Šī darbība Jūs atslēgs no esošā servera. Vai Jūs tik tiešām vēlaties atslēgties?
mk: Ова ќе ве дисконектира од серверот. Дали сте сигурни дека сакате да се дисконектирате?
nl: Dit zal de verbinding met de huidige server verbreken. Weet je zeker dat je de verbinding wilt verbreken?
pl: Zostaniesz zaraz rozłączony z bieżącym serwerem. Czy jesteś pewien, że chcesz się rozłączyć?
pt_br: Isto vai te desconectar do seu servidor atual. Você tem certeza que quer continuar?
ro: Acest lucru te va deconecta de la server. Ești sigur că vrei să te deconectezi?
ru: Это действие приведёт к отключению от текущего сервера. Вы действительно хотите отключиться?
sk: Toto ťa odpojí z aktuálneho serveru. Si si istý, že sa chceš odpojiť?
sl: To bo prekinilo povezavo s trenutnim strežnikom. Ali ste prepričani da želite prekiniti povezavo?
sv: Detta kommer att avbryta anslutningen till nuvarande server. Vill avbryta anslutningen?
uk: Ця дія призведе до від'єднання від поточного сервера. Ви дійсно бажаєте від'єднатися?

source: DISCONNECT WARNING
de: VERBINDUNG GETRENNT
et: ÜHENDUSE KATKEMISE HOIATUS
hr: ODSPAJANJE UPOZORENJE
hu: LECSATLAKOZÁS FIGYELMEZTETÉS
it: AVVERTIMENTO DI DISCONNESSIONE
ja: 切断警告
lt: ATSIJUNGIMO PERSPĖJIMAS
lv: ATSLĒGŠANĀS BRĪDINĀJUMS
mk: ДИСКОНЕКЦИЈА ПРЕДУПРЕДУВАЊЕ
nl: VERBINDINGSWAARSCHUWING
pl: UWAGA - ROZŁĄCZENIE
pt_br: AVISO DE DESCONEXÃO
ro: AVERTISMENT DECONECTARE
ru: ПРЕДУПРЕЖДЕНИЕ ОТКЛЮЧЕНИЯ
sk: VAROVANIE O ODPOJENÍ
sl: OPOZORILO O PREKINJENI POVEZAVI
sv: FRÅNKOPPLINGSVARNING
uk: ПОПЕРЕДЖЕННЯ ВІД'ЄДНАННЯ

source: No host specified!
de: Kein Host angegeben!
et: Unustasite lisada serveri ip!
hr: Nije odabran poslužitelj!
hu: Nincs megadva kiszolgáló!
it: Nessun host specificato!
ja: ホストが指定されていません！
lv: Nav norādīts hosts!
mk: Хостот не е специфициран!
nl: Geen host opgegeven!
pl: Nie podano serwera!
pt_br: IP não especificado!
ro: Host nespecificat!
ru: Адрес не указан!
sk: Nie je určený hostiteľ!
sl: Gostitelj ni določen!
sv: Ingen värddator angiven!
uk: Не вказано адресу!

source: No port specified!
de: Kein Port angegeben!
et: Unustasite lisada serveri pordi!
hr: Nije određen port!
hu: Nincs megadva port!
it: Nessuna porta Specificata!
ja: ポートが指定されていません！
lv: Nav norādīts ports!
mk: Портот не е специфициран!
nl: Geen poort opgegeven!
pl: Nie podano portu!
pt_br: Porta não especificada!
ro: Port nespecificat!
ru: Не указан порт!
sk: Nie je určený port!
sl: Vrata niso določena!
sv: Ingen port angiven!
uk: Не вказаний порт!

source: Invalid port specified!
de: Ungültiger Port angegeben!
et: See port ei sobi!
hr: Određen nevaljan port!
hu: A megadott port érvénytelen!
it: Porta specificata non valida!
ja: 無効なポート指定です
lv: Norādīts nederīgs ports!
mk: Портот што е специфициран е неважечки!
nl: Ongeldige poort opgegeven!
pl: Podano nieprawidłowy port!
pt_br: Porta especificada inválida!
ro: Portul specificat este invalid!
ru: Указан неверный порт!
sk: Neplatný port!
sl: Določena so bila napačna vrata!
sv: Ogiltig port angiven!
uk: Вказано хибний порт!
