Repository: multitheftauto/mtasa-blue
Catalog: Shared/data/MTA San Andreas/MTA/locale/*/client.po
Languages: de, et, hr, hu, it, ja, lt, lv, mk, nl, pl, pt_br, ro, ru, sk, sl, sv, uk

source: Trouble restarting MTA:SA If the problem persists, open Task Manager and stop the 'gta_sa.exe' and 'Multi Theft Auto.exe' processes Try to launch MTA:SA again?
de: Problem beim Neustart von MTA:SA Wenn dieses Problem weiterhin besteht, öffne den Task Manager und beende die 'gta_sa.exe' und 'Multi Theft Auto.exe' Prozesse Starten von MTA:SA erneut versuchen?
et: Probleem MTA:SA taaskäivitamisel Kui probleem jätkub siis avage Task Manager ja lõpetage 'gta_sa.exe' ning 'Multi Theft Auto.exe' protsessid Kas avan MTA:SA uuesti?
hr: Kvar u ponovnom pokretanju MTA:SA Ako problem ustraje, otvorite Task Manager i zaustavite 'gta_sa.exe' i 'Multi Theft Auto.exe' procese Pokušaj pokrenuti MTA:SA opet?
hu: Probléma lépett fel az MTA:SA újraindításával Ha ez a probléma továbbra is fenn áll, nyisd meg a feladatkezelőt és zárd be a 'gta_sa.exe' és 'Multi Theft Auto.exe' folyamatokat. Megpróbálod újraindítani az MTA:SA-t?
it: Problemi nel riavvio di MTA:SA Se il problema persiste, aprire Task Manager e fermare i processi 'gta_sa.exe' e 'Multi Theft Auto.exe' Avviare nuovamente MTA:SA?
ja: MTA:SA再スタート失敗 この問題が続いたら、タスクマネジャーをあけて 「gta_sa.exe」と「Multi Theft Auto.exe」のプロセスを止めてください 再起動しますか。
lt: Problema paleidžiant MTA:SA Jei problema kartosis, atidarykite užduočių tvarkyklę ir sustabdykite 'gta_sa.exe' bei 'Multi Theft Auto.exe' procesus Ar norite pabandyti paleisti MTA:SA dar kartą?
lv: Kļūda restartējot MTA:SA Ja problēma atkartojās, atveriet Uzdevumu Pārvaldnieku un apstādiniet 'gta_sa.exe' un 'Multi Theft Auto.exe' procesus Mēģināt palaist MTA:SA vēlreiz?
mk: Проблеми со рестартирање на MTA:SA доколку проблемот продолжи отворете Task Manager и стопирајте го 'gta_sa.exe' и 'Multi Theft Auto.exe' прецесот Пробајте да ја вклучите MTA:SA повторно?
nl: Moeite met MTA:SA herstarten Als het probleem aanhoudt, open taakbeheer en stop het 'gta_sa.exe' and 'Multi Theft Auto.exe' proces MTA:SA proberen te herstarten?
pl: Problem ze zrestartowaniem MTA:SA Jeśli problem się powtarza, otwórz Menedżer Zadań i zatrzymaj procesy 'gta_sa.exe' i 'Multi Theft Auto.exe' Czy chcesz zrestartować MTA:SA jeszcze raz?
pt_br: Houve um problema ao reiniciar o MTA:SA Se o problema persistir, abra o Gerenciador de Tarefas e pare os processos 'gta_sa.exe' e 'Multi Theft Auto.exe' Tentar iniciar o MTA:SA mais uma vez?
ro: A apărut o problemă la repornirea MTA:SA Dacă problema persistă, deschide Managerul de activități și oprește procesele 'gta_sa.exe' și 'Multi Theft Auto.exe'. Încearcă să relansezi MTA:SA?
ru: Проблема перезапуска MTA:SA Если проблема сохранилась, то откройте диспетчер задач и остановите процессы 'gta_sa.exe' и 'Multi Theft Auto.exe' Попробовать запустить MTA:SA снова?
sk: Problémy pri reštartovaní MTA:SA Ak problém pretrváva, otvor Správcu úloh a ukonči procesy 'gta_sa.exe' a 'Multi Theft Auto.exe' Pokúsiť sa spustiť MTA:SA znova?
sl: Težava pri ponovnem zagonu MTA:SA Če se problem ponavlja, zaženite Upravitelja opravil in končajte procesa 'gta_sa.exe' in 'Multi Theft Auto.exe' Želite ponovno zagnati MTA:SA?
sv: Ett problem uppstod vid omstart utav MTA:SA Om problemet kvarstår, öppna aktivitetshanteraren och stoppa 'gta_sa.exe' och 'Multi Theft Auto.exe' processerna Vill du prova att öppna MTA:SA igen?
uk: Проблема перезапуску MTA:SA Якщо проблема збереглася, то відкрийте диспетчер завдань і зупиніть процеси 'gta_sa.exe' і 'Multi Theft Auto.exe' Спробувати запустити MTA:SA знову?

source: Another instance of MTA is already running. If this problem persists, please restart your computer
de: Eine weitere Instanz von MTA läuft bereits. Wenn dieses Problem weiterhin besteht starte bitte deinen Computer neu
et: Üks MTA klient juba käib. Kui probleem jätkub siis palun taaskäivitage oma arvuti
hr: Jedna instanca MTA je već pokrenuta. Ako ovaj problem ustraje, molimo da ponovno pokrenite vaše računalo.
hu: Egy másik példánya az MTA-nak fut. Ha ez a probléma továbbra is fenn áll, indítsd újra a számítógéped.
it: Un'altra istanza di MTA è già in esecuzione. Se il problema persiste riavviare il computer
ja: 他のMTAインスタンスが実行しています。 この問題が続いたら、パソコンを再起動してください
lt: MTA jau yra paleistas. Jei problema kartosis, prašome perkrauti savo kompiuterį
lv: Cita MTA instance darbojās. Ja šī problēma atkārtojās, lūdzu restartējiet savu datoru
mk: Уште една копија од MTA е веќе вклучена. Доколку проблемот продолжи, рестартирајте го компјутерот
nl: Een ander exemplaar van MTA is al actief. Als dit probleem aanhoudt, gelieve uw computer te herstarten
pl: Proces MTA jest już włączony. Jeśli problem się powtarza, zrestartuj swój komputer
pt_br: O MTA já está rodando. Se o problema persistir, por favor reinicie o seu computador
ro: O altă instanță a MTA rulează deja. Dacă această problemă persistă, te rugăm restartează-ți calculatorul
ru: Другой процесс с MTA уже запущен. Если проблема не решена, попробуйте перезагрузить ваш компьютер
sk: Iná súčasť MTA už beží. Ak tento problém pretrváva, reštartuj svoj počítač
sl: Druga instanca MTA že teče. Če se ta problem ponavlja, prosimo, da ponovno zaženete svoj računalnik
sv: En annan instans av MTA körs redan. Ifall det här problemet kvarstår, var god starta om din dator
uk: Інший процес з MTA вже запущений. Якщо проблема не вирішена, спробуйте перезавантажити комп'ютер

source: Another instance of MTA is already running. Do you want to terminate it?
de: Eine weitere Instanz von MTA läuft bereits. Möchtest du sie beenden?
et: Üks MTA klient juba käib. Kas soovite selle sulgeda?
hr: Jedna instanca MTA je već pokrenuta. Želite li je okončati?
hu: Egy másik példánya az MTA-nak már fut. Leakarod állítani?
it: Un'altra istanza di MTA è già in esecuzione. Desideri terminarla?
ja: 他のMTAインスタンスが実行しています。 終了しますか。
lt: MTA jau yra paleistas. Ar norite sunaikinti šį procesą?
lv: Cita MTA instance darbojās. Vai vēlaties to izbeigt?
mk: Уште една копија од MTA е вклучена. Дали сакате да ја исклучите?
nl: Een ander exemplaar van MTA is al actief. Wilt u het beëindigen?
pl: Proces MTA jest już uruchomiony. Czy chcesz go zatrzymać?
pt_br: O MTA já está rodando. Você deseja fechá-lo?
ro: O altă instanță a MTA rulează deja. Dorești să o închizi?
ru: Другой процесс MTA уже запущен. Вы хотите завершить этот процесс?
sk: Iná súčasť MTA už beží. Chceš ju ukončiť?
sl: Druga instanca MTA že teče. Ali jo želite ustaviti?
sv: En annan instans av MTA körs redan. Vill du avsluta den?
uk: Інший процес MTA вже запущений. Ви хочете завершити цей процес?

source: Are you having problems running MTA:SA?. Do you want to revert to an earlier version?
de: Hast du Probleme beim Starten von MTA:SA? Möchtest du auf eine ältere Version zurücksetzen?
et: Kas on probleeme MTA:SA käivitamisega?. Kas soovid proovida vanemat versiooni?
hr: Imate li probleme s pokretanjem MTA:SA?. Želite li se vratiti na raniju verziju?
hu: Problémád akadt az MTA:SA futtatásával? Akarod hogy a játék egy régebbi verzióját telepítse?
it: Stai avendo problemi utilizzando MTA:SA?. Vuoi riutilizzare una versione precedente?
ja: MTA:SAの実行と問題がありますか？ 以前のバージョンに戻しますか？
lt: Ar jūs turite problemų paleidžiant MTA:SA?. Norite sugražinti ankstesnę versiją?
lv: Vai Jums ir problēmas ar MTA:SA darbību? Vai vēlaties atgriezt vecāku versiju?
mk: Дали имате проблеми со вклучување на MTA:SA?. Дали сакате да ја вратите во постара верзија?
nl: Heeft u problemen met MTA:SA?. Wilt u terugkeren naar een oudere versie?
pl: Masz problemy z uruchamianiem MTA:SA? Czy chcesz powrócić do poprzedniej wersji?
pt_br: Você está tendo problemas ao rodar o MTA:SA?. Você quer voltar a uma versão anterior?
ro: Ai probleme la rularea MTA:SA? Vrei să revi la o versiune anterioară?
ru: У вас есть проблемы с запуском MTA:SA?. Попробовать откатиться к ранней версии?
sk: Máš problémy s behom MTA:SA? Povoliť návrat na staršiu verziu?
sl: Imate probleme med igranjem MTA:SA? Ali želite namestiti starejšo različico?
sv: Har du problem med att köra MTA:SA?. Vill du återställa till en tidigare version?
uk: У вас є проблеми з запуском MTA:SA?. Спробувати повернутися до попередньої версії?

source: There seems to be a problem launching MTA:SA. Resetting GTA settings can sometimes fix this problem. Do you want to reset GTA settings now?
de: Es scheint ein Problem beim Starten von MTA:SA vorzuliegen. Manchmal kann das Zurücksetzen der GTA Einstellungen dieses Problem beheben. Möchtest du die GTA Einstellungen jetzt zurücksetzen?
et: Tundub, et on probleeme MTA:SA käivitamisel. GTA seadete taastamine suudab mõnikord selle probleemi kõrvaldada. Kas soovid GTA seadeid taastada?
hr: Čini se da postoji problem s pokretanjem MTA:SA. Resetiranje GTA postavka može ponekada popraviti ovaj problem. Želite li resetirati GTA postavke sada?
hu: Úgy tűnik, hogy probléma akadt az MTA:SA elindításával. A GTA beállításainak resetelése megoldhatja ezt a problémát. Akarod resetelni a GTA beállításait most?
it: Sembra ci sia un problema nell'avvio di MTA:SA. Resettare le impostazioni di GTA può risolvere questo problema. Vuoi resettare le impostazioni di GTA ora?
ja: MTA:SAの実行と問題があるそうです。 GTAのセッティングをリセットすると、問題が直されるかもしれません。 GTAのセッティングをリセットしますか。
lt: Atrtodo, jog yra problemų paleidžiant MTA:SA. Sugražinant numatytuosius GTA nustatymus kartais padeda sutvarkyti šią problemą. Ar norite sugražinti GTA nustatymus dabar?
lv: Notika problēma palaižot MTA:SA. Atgriežot GTA iestatījumus, dažreiz šo problēmu izdodās salabot. Vai jūs vēlaties atgriezt GTA iestatījumus?
mk: Се појави проблем со стартување на MTA:SA. Рестартирање на GTA опциите може да го реши проблемот. Дали сакате да ги рестартирате GTA опциите сега?
nl: Er lijkt een probleem te zijn bij het starten van MTA:SA. GTA instellingen resetten kan dit probleem soms oplossen. Wilt u de GTA instellingen nu resetten?
pl: Wykryto problem z uruchomieniem MTA:SA. Możliwe, że zresetowanie ustawień dla GTA:SA pomoże go rozwiązać. Czy chcesz zresetować ustawienia gry GTA:SA?
pt_br: Parece que houve um problema ao iniciar o MTA:SA. Redefinir as configurações do GTA pode resolver este problema. Você deseja redefini-las agora?
ro: Se pare că o problemă împiedică lansarea MTA:SA. Restabilirea setărilor inițiale a GTA poate rezolva uneori problema. Vrei să restabilești setările GTA acum?
ru: Возникли проблемы с запуском MTA:SA. Сброс настроек GTA, возможно, устранит эту проблему.. Вы хотите сбросить настройки GTA?
sk: Vypadá to že nastal problém pri spúšťaní MTA:SA. Resetnutie GTA nastavení niekedy tento problém vyrieši. Chceš resetovať GTA nastavenia teraz?
sl: Pri zagonu MTA:SA se je pojavil problem. Ponastavitev GTA nastavitev včasih reši ta problem. Ali želite ponastaviti GTA nastavitve zdaj?
sv: Det har uppstått ett problem med att öppna MTA:SA Återställning av inställningarna i GTA kan ibland åtgärda problemet. Vill du återställa inställningarna i GTA nu?
uk: Виникли проблеми з запуском MTA:SA. Скидання налаштувань GTA, цілком можливо, усуне цю проблему. Ви хочете скинути налаштування GTA?

source: GTA settings have been reset. Press OK to continue.
de: GTA Einstellungen wurden zurückgesetzt. Drücke OK um fortzufahren.
et: GTA seaded on taastatud. Vajuta OK et jätkata.
hr: GTA postavke su resetirane. Pritisnike OK za nastavak.
hu: GTA beállításai resetelve. Nyomd meg az OK gombot.
it: Le impostazioni di GTA sono state resettate. Premi OK per continuare.
ja: GTAセッティングがリセットされました。 「OK」を押してください。
lt: GTA nustatymai sugražinti. Spauskite Gerai.
lv: GTA uzstādījumi tika atgriezti. Spiediet LABI, lai turpinātu.
mk: GTA поставувањата се ресетирани. Притиснете OK за да продолжите.
nl: GTA instellen zijn gereset. Druk OK om door te gaan.
pl: Ustawienia gry GTA:SA zostały zresetowane. Wciśnij OK aby kontynuować.
pt_br: As configurações do GTA foram restauradas. Clique OK para continuar.
ro: Setările GTA au fost restabilite. Apasă OK pentru a continua.
ru: Настройки GTA сброшены. Нажмите OK, чтобы продолжить.
sk: GTA nastavenia boli resetované. Stlač OK pre pokračovanie.
sl: GTA nastavitve so bile ponastavljene. Pritisnite V redu za nadaljevanje.
sv: GTA-inställningarna har återställs. Tryck OK för att fortsätta.
uk: Налаштування GTA скинуті. Натисніть OK, щоб продовжити.

source: File could not be deleted: '%s'
de: Datei konnte nicht gelöscht werden: '%s'
et: Ei suutnud faili kustutada: '%s'
hr: Fajl nije mogao biti izbrisan: '%s'
hu: Fájl nem törölhető: '%s'
it: Il file non può essere cancellato: '%s'
ja: 次のファイルを消すことができませんでした: '%s'
lt: Neišėjo ištrinti bylos: '%s'
lv: Failu nevar izdzēst: '%s'
mk: Фајлот не може да се избрише: '%s'
nl: Bestand kon niet worden verwijderd: '%s'
pl: Plik nie mógł zostać usunięty: '%s'
pt_br: Arquivo não pode ser deletado: '%s'
ro: Fișierul nu a putut fi șters: '%s'
ru: Файл не может быть удален. '%s'
sk: Súbor nemôže byť zmazaný: '%s'
sl: Datoteke ni mogoče zbrisati: '%s'
sv: Filen kunde inte tas bort: '%s'
uk: Файл не може бути видалений. '%s'

source: Are you having problems running MTA:SA?. Do you want to see some online help?
de: Hast du ein Problem beim Starten von MTA:SA? Möchtest du dazu eine Onlinehilfe sehen?
et: Kas esineb probleeme MTA:SA käivitamisel?. Kas soovid näha onlain abi?
hr: Imate li problema s pokretanjem MTA:SA?. Želite li vidjeti neku online pomoć?
hu: Problémád akadt az MTA:SA futtatásával?. Szeretnél online segítséget kapni?
it: Stai avendo problemi utilizzando MTA:SA?. Vuoi controllare il supporto online?
ja: MTA:SAの実行と問題がありますか。 オンラインでヘルプを探しますか？
lt: Ar turite problemų paleidžiant MTA:SA?. Norėtumėt pamatyti šiek tiek pagalbos tinkle?
lv: Vai jums ir problēmas ar MTA:SA dabināšanu?. Vai jūs vēlaties saņemt tiešsaistes palīdzību?
mk: Дали имате проблеми со стартување на MTA:SA?. Дали сакате да побарате помош онлајн?
nl: Heeft u problemen met MTA:SA?. Wilt u online hulp raadplegen?
pl: Masz problemy z uruchamianiem MTA:SA? Czy chcesz uzyskać pomoc on-line?
pt_br: Você está tendo problemas ao rodar o MTA:SA?. Você deseja obter ajuda online?
ro: Ai probleme la rularea MTA:SA? Vrei să vezi niște ajutor on-line?
ru: Возникли проблемы с запуском MTA:SA? . Хотите посмотреть онлайн помощь?
sk: Máš problémy so spustením MTA:SA?. Chceš si pozrieť nejakú pomoc online?
sl: Ali imate težave med igranjem MTA:SA? Ali si želite ogledati spletno pomoč?
sv: Har du problem med att köra MTA:SA?. Vill du ha onlinehjälp?
uk: Виникли проблеми з запуском MTA:SA? . Хочете побачити онлайн-довідку?

source: Are you having problems running MTA:SA?. Do you want to change the following setting?
de: Hast du Probleme mit MTA:SA?. Möchtest du folgende Einstellung ändern?
hr: Imate problem s pokretanjem MTA:SA?. Želite li promijeniti sljedeću postavku?
hu: Problémáid vannak az MTA:SA futtatásával?. Szeretnéd megváltoztatni a következő beállításokat?
ja: MTA:SAを実行するには問題がありまか？ 次の設定に変更したいですか？
lt: Turite problemų dėl MTA:SA paleidimo?. Norite pakeisti šiuos nustatymus?
mk: Дали имате проблеми со стартување на MTA:SA?. Дали сакате да ги промените следните опции?
pt_br: Está tendo problemas ao executar o MTA:SA?. Deseja mudar a seguinte configuração?
ru: У вас проблемы с загрузкой MTA:SA? Вы хотите изменить текущие настройки?
uk: У вас виникли труднощі під час завантаження MTA:SA? Ви хочете змінити поточні налаштування?

source: Are you having problems running MTA:SA?. Try disabling the following products for GTA and MTA:
de: Hast du Probleme mit MTA:SA?. Versuche die folgenden Produkte für GTA und MTA zu deaktivieren:
hr: Imate problem s pokretanjem MTA:SA?. Pokušajte s onesposobljavanjem sljedećih proizvoda za GTA i MTA:
hu: Problémáid vannak az MTA:SA futtatásával?. Próbáld meg kikapcsolni a következő programokat a GTA és az MTA miatt:
ja: MTA：SAを実行するには問題ありますか？ 次のソフトを無効してみてください：
lt: Turite problemų dėl MTA:SA paleidimo?. Pabandykite išjungti šiuos produktus žaidimui GTA ir MTA:
mk: Дали имате проблеми со стартување на MTA:SA?. Пробајте со деактивирање на следните продукти за GTA и MTA:
pt_br: Está tendo problemas ao executar o MTA:SA?. Tente desabilitando os seguintes produtos para o GTA e o MTA:
ru: У вас возникли проблемы с запуском MTA:SA? Попробуйте выключить следующие продукты для MTA и GTA:
uk: У вас виникли проблеми з запуском MTA:SA? Спробуйте вимкнути наступні продукти для MTA та GTA:

source: WARNING MTA:SA has detected unusual activity. Please run a virus scan to ensure your system is secure.
de: WARNUNG MTA:SA hat ungewöhnliche Aktivitäten erkannt. Bitte starte einen Virusscan, um die Sicherheit deines Systems sicherzustellen.
hr: UPOZORENJE MTA:SA je prepoznao neobičnu aktivnost. Molimo pokrenite skeniranje na viruse da biste bili sigurni da je Vaš sistem siguran.
hu: FIGYELEM MTA:SA szokatlan tevékenységet észlelt. Kérjük, futtass egy víruskeresést, amely biztosítja, hogy a rendszer biztonságos.
ja: 警告 MTA:SAは珍しい活動が検出されました。 システムの安全のために、ウイルススキャンをしてください。
lt: ĮSPĖJIMAS MTA:SA aptiko neįprastą veiklą. Prašome paleisti virusų skenavimo programą, kad įsitikintumėte sistemos saugumu.
lv: BRĪDINĀJUMS MTA:SA konstatēja neparastu aktivitāti. Lūdzu veiciet datora skenēšanu lai novērstu draudus sistēmai.
mk: ПРЕДУПРЕДУВАЊЕ MTA:SA забележа необични активности. Ве молиме направете вирус скенирање за да се осигурате дека вашиот систем е безбеден.
nl: WAARSCHUWING MTA:SA heeft vreemde activiteiten ontdekt. Gelieve een virusscan uit te voeren om te verzekeren dat uw systeem veilig is.
pl: OSTRZEŻENIE MTA:SA wykryło podejrzaną aktywność na tym komputerze. Proszę przeskanować komputer przy użyciu programu antywirusowego aby upewnić się, że jest on bezpieczny.
pt_br: ATENÇÃO O MTA:SA detectou atividades suspeitas. Por gentileza, rode seu antivírus para verificar se seu sistema está seguro.
ro: AVERTISMENT MTA:SA a detectat activități neobișnuite. Te rugăm rulează o scanare de detectare a virușilor pentru a te asigura că sistemul tău este în siguranță.
ru: ВНИМАНИЕ MTA:SA обнаружил подозрительную активность. Проверьте вашу систему на наличие вирусов, чтобы убедиться в безопасности.
uk: УВАГА MTA:SA виявив підозрілу активність. Перевірте вашу систему на наявність вірусів, щоб переконатися в безпеці.

source: The detected file was: %s
de: Die erkannte Datei ist: %s
hr: Pronađena datoteka je: %s
hu: Az észlelt fájl volt: %s
ja: 検出されたファイルは: %s
lt: Aptiktas failas buvo: %s
lv: Konstatētais fails bija: %s
mk: Детектираниот фајл е: ~ ~%s
nl: Het gedetecteerde bestand was: %s
pl: Wykryty plik to: %s
pt_br: O arquivo detectado foi: %s
ro: Fișierul detectat a fost: %s
ru: Был обнаружен файл: %s
uk: Був виявлений файл: %s

source: An instance of GTA: San Andreas is already running. It needs to be terminated before MTA:SA can be started. Do you want to do that now?
de: Eine Instanz von GTA: San Andreas läuft bereits. Diese muss beendet werden, bevor MTA:SA gestartet werden kann. Möchtest du dies jetzt tun?
et: Üks GTA: San Andreas juba käib. See peab olema suletud enne kui soovite MTA:SA käivitada. Kas soovid seda kohe teha?
hr: Instanca GTA:SA je već pokrenuta. Mora biti prekinuta prije nego li MTA:SA može biti pokrenut. Želite li to učiniti sada?
hu: Egy példánya a GTA: San Andreas-nak már fut. Le kell állítani, mielőtt az MTA:SA elindítható. Leakarja állítani most?
it: Un'istanza di GTA: San Andreas è già in esecuzione. Ha bisogno di essere chiusa prima di poter avviare MTA:SA. Vuoi farlo adesso?
ja: GTA: San Andreasのインスタンスはまだ実行しています。スタートする前に終了しなければなりません。そうしますか？
lt: GTA: San Andreas jau yra paleistas. Šį procesą reikia sunaikinti prieš paleidžiant MTA:SA. Ar norite tai padaryti dabar?
lv: Kāda no GTA: San Andreas instancēm šobrīd darbojās. Tām ir jābūt aizvērtām, pirms startējat MTA:SA. Vai vēlaties to darīt tagad?
mk: Уште една копија од GTA: San Andreas е веќе вклучена и треба да се исклучи пред MTA:SA да биде стартувана.Дали сакате тоа да го направите сега?
nl: Een exemplaar van GTA: San Andreas is al actief. Het moet gestopt worden voor MTA:SA kan worden gestart. Wilt u dit nu doen?
pl: Proces gry GTA: San Andreas jest już uruchomiony. Przed włączeniem MTA:SA proces ten musi być zatrzymany. Czy chcesz go teraz zatrzymać?
pt_br: O GTA: San Andreas já esta rodando. Ele precisa ser fechado antes para que o MTA:SA possa ser iniciado. Você quer continuar?
ro: O instanță a GTA: San Andreas rulează deja. Ea trebuie închisă înainte ca MTA:SA să file lansat. Vrei să o închizi acum?
ru: Необходимо завершить процесс GTA: San Andreas перед запуском MTA:SA. Сделать это сейчас?
sk: Časť GTA: San Andreas je už spustená. Je potrebné ju pred štartom MTA:SA ukončiť. Chceš to urobiť teraz?
sl: Proces GTA: San Andreas že teče. Biti mora prekinjen, preden zaženete MTA:SA. Ali želite to narediti zdaj?
sv: En instans av GTA: San Andreas körs redan. Programmet måste avslutas innan MTA:SA kan startas. Vill du göra det nu?
uk: Необхідно завершити процес GTA: San Andreas перед запуском MTA:SA. Зробити це зараз?

source: Unable to terminate GTA: San Andreas. If the problem persists, please restart your computer.
de: Konnte GTA: San Andreas nicht beenden. Wenn dieses Problem weiterhin besteht starte deinen Computer neu.
et: Ei suutnud GTA: San Andreas sulgeda. Kui probleem jätkub siis palun taaskäivitage oma arvuti.
hr: Nemoguće prekinuti GTA: San Andreas. Ako problem ustraje, molimo ponovno pokrenite vaše računalo.
hu: Nem lehet leállítani a GTA: San Andreas-t. Ha a probléma továbbra is fennáll, indítsa újra a számítógépet.
it: Impossibile terminare GTA: San Andreas. Se il problema persiste riavviare il computer.
ja: GTA: San Andreasを中止できませんでした。この問題が続いたら、パソコンを再起動してください。
lt: Neįmanoma sunaikinti GTA: San Andreas proceso. Jei problema kartosis, prašome perkrauti savo kompiuterį.
lv: Nespēj apturēt GTA: San Andreas. Ja problēma joprojām pastāv, restartējiet datoru.
mk: Исклучување на GTA: San Andreas беше невозможно.Доколку проблемот продолжи, рестартирајте го вашиот компјутер.
nl: Kan GTA: San Andreas niet beëindigen. Als dit probleem aanhoudt, gelieve uw computer te herstarten.
pl: Nie udało się zatrzymać procesu GTA: San Andreas. Jeśli problem się powtarza, zrestartuj swój komputer.
pt_br: Não foi possível fechar o GTA: San Andreas. Se o problema persistir, por favor reinicie o seu computador.
ro: GTA: San Andreas nu poate fi închis. Dacă problema persistă te rugăm restartează-ți calculatorul.
ru: Невозможно завершить процесс GTA: San Andreas. Если проблема сохранилась, то попробуйте перезагрузить ваш компьютер.
sk: Nemožno ukončiť GTA: San Andreas. Ak problém pretrváva, reštartuj prosím svoj počítač.
sl: Ni bilo mogoče prekiniti GTA: San Andreas. Če problem ostaja, prosimo, da ponovno zaženete svoj računalnik.
sv: Kunde inte avsluta GTA: San Andreas. Om problemet kvarstår, var god starta om datorn.
uk: Не вдається завершити процес GTA: San Andreas. Якщо проблема збереглася, то спробуйте перезавантажити ваш комп'ютер.
