Repository: multitheftauto/mtasa-blue
Catalog: Shared/data/MTA San Andreas/MTA/locale/*/client.po
Languages: de, et, hr, hu, it, ja, lt, lv, mk, nl, pl, pt_br, ro, ru, sk, sl, sv, uk

source: Registry entries are missing. Please reinstall Multi Theft Auto: San Andreas.
de: Registrierungseinträge fehlen. Bitte installiere Multi Theft Auto: San Andreas neu.
et: Registrikanne puudub. Palun paigaldage Multi Theft Auto: San Andreas uuesti.
hr: Unosi registra nedostaju. Molimo ponovno instalirajte Multi Theft Auto: San Andreas.
hu: Registry bejegyzések hiányoznak. Telepítse újra a Multi Theft Auto: San Andreas-t.
it: Voci di registro mancanti. Per favore reinstalla Multi Theft Auto: San Andreas
ja: レジストリエントリ不足。MTA:SAを再インストールしてください。
lt: Trūksta reikalingų įvesčių registre. Prašome įdiegti Multi Theft Auto: San Andreas iš naujo.
lv: Iztrūkst reģistru ieraksti. Lūdzu pārinstalējiet Multi Theft Auto: San Andreas.
mk: Регистарските влеза недостигаат.Ве молиме реинсталирајте ја Multi Theft Auto: San Andreas.
nl: Registervermeldingen ontbreken. Gelieve Multi Theft Auto: San Andreas te herinstalleren.
pl: Nie odnaleziono wymaganych wpisów w Rejestrze systemu. Zainstaluj ponownie MTA:SA.
pt_br: Entradas de registro estão faltando. Por favor reinstale o MTA:SA.
ro: Intrările din registru lipsesc. Te rugăm reinstalează Multi Theft Auto: San Andreas.
ru: Отсутствуют необходимые записи в реестре. Переустановите Multi Theft Auto: San Andreas.
sk: Záznamy v registroch chýbajú. Preinštaluj prosím Mutli Theft Auto: San Andreas.
sl: Vpisi registra manjkajo. Prosimo, ponovno namestite Multi Theft Auto: San Andreas.
sv: Registerposter saknas. Var god installera om Multi Theft Auto: San Andreas.
uk: Відсутні необхідні записи в реєстрі. Переінсталюйте Multi Theft Auto: San Andreas.

source: The path to your installation of GTA: San Andreas contains unsupported (unicode) characters. Please move your Grand Theft Auto: San Andreas installation to a compatible path that contains only standard ASCII characters and reinstall Multi Theft Auto: San Andreas.
de: Der Pfad zu deiner Installation von GTA: San Andreas enthält ungültige Unicode Zeichen. Bitte ändere den Pfad deiner GTA: San Andreas Installation, sodass dieser nur ASCII Zeichen enthält und installiere Multi Theft Auto: San Andreas neu.
et: GTA: San Andrease paigalduse kaust sisaldab toetamatuid tähti. Palun liigutage oma Grand Theft Auto: San Andreas kuhugi mujale, mis koosneks ainult tavalistest ASCII tähtedest ja paigaldage Multi Theft Auto: San Andreas uuesti.
hr: Put do vaše GTA: San Andreas instalacije sadrži nepodržane (unikod) znakove.Molimo pomaknite vašu Grand Theft Auto: San Andreas instalaciju na kompatibilno mjesto koje sadrži samo standardne ASCII znakove i ponovno instalirajte Multi Theft Auto: San Andreas.
hu: A GTA: San Andreas útja nem támogatott (Unicode) karaktereket tartalmaz. Kérjük helyezze a Grand Theft Auto: San Andreas telepítését egy kompatibilis útra, amely csak szabványos ASCII karaktereket tartalmaz és telepítse újra a Multi Theft Auto: San Andreas-t.
it: Il percorso d'installazione di GTA: San Andreas contiene dei caratteri non supportati (unicode). Per favore muovi la tua installazione di Grand Theft Auto: San Andreas in un percorso compatibile che contenga solo caratteri ASCII standard e reinstalla Multi Theft Auto: San Andreas.
ja: GTA: San Andreasのインストールパスのキャラクタがサポートされていません（ユニコード）。GTA:SAのインストールフォルダをASCIIのパスに移動して、MTA:SAを再インストールしてください。
lt: Nurodyta vieta iki GTA: San Andreas susideda iš nepalaikomų simbolių. Prašome patraukti savo Grand Theft Auto: San Andreas įdiegimo aplanką į palaikomą vietą, kuri susideda tik iš standartinių ASCII simbolių ir įdiekite Multi Theft Auto: San Andreas iš naujo.
lv: Ceļs uz Jūsu GTA: San Andreas instalāciju satur neatbalstītas (unicode) rakstzīmes. Lūdzu pārvietojiet savu Grand Theft Auto: San Andreas instalāciju, lai izveidotu saderīgu ceļu, kurš satur standarta ASCII rakstzīmes un lūdzu pārinstalējiet Multi Theft Auto San Andreas.
mk: Линкот од инсталацијата на GTA: San Andreas содржат неподржани (уникод) карактери. Ве молиме инсталацијата на Grand Theft Auto: San Andreas преместете ја на компатибилен линк што содржи само стандарни ASCII карактери и реинсталирајте ја Multi Theft Auto: San Andreas.
nl: Het pad naar uw GTA: San Andreas installatie bevat niet ondersteunde (unicode) karakters. Gelieve uw Grand Theft Auto: San Andreas installatie naar een compatibel pad te verplaatsen dat enkel ASCII karakters bevat. En Multi Theft Auto: San Andreas te herinstalleren.
pl: Ścieżka do Twojej instalacji gry GTA: San Andreas zawiera niewspierane znaki Unicode. Przenieś swoją instalację gry Grand Theft Auto: San Andreas do ścieżki zawierającej wyłącznie znaki ASCII i przeinstaluj moda Multi Theft Auto: San Andreas.
pt_br: O caminho para a sua instalação do GTA: San Andreas contém caracteres não suportados (unicode). Por favor mova o seu GTA: San Andreas para um caminho compatível que contenha apenas caracteres ASCII padrão e reinstale o MTA:SA.
ro: Calea către dosarul tău cu instalarea GTA: San Andreas conține caractere nesuportate (unicode). Te rugăm mută instalarea Grand Theft Auto: San Andreas într-un loc compatibil care conține numai caractere standard de tip ASCII și reinstalează Multi Theft Auto: San Andreas.
ru: Путь к папке с вашей GTA: San Andreas имеет неподдерживаемые символы (юникод). Измените путь к Grand Theft Auto: San Andreas, чтобы в нём были только ASCII символы и переустановите Multi Theft Auto: San Andreas.
sk: Umiestnenie tvojej inštalácie GTA: San Andreas obsahuje nepodporované (unicode) znaky. Presuň prosím túto inštaláciu do kompatibilného umiestnenia ktoré obsahuje iba štandardné ASCII znaky a potom preinštaluj Multi Theft Auto: San Andreas.
sl: Pot, kjer je nameščen GTA: San Andreas vsebuje nepodprte (unicode) znake. Prosimo, premaknite Grand Theft Auto: San Andreas namestitev na združljivo pot, ki vsebuje samo standardne ASCII znake in ponovno namestite Multi Theft Auto: San Andreas
sv: Installationssökvägen till GTA: San Andreas innehåller otillåtna (unicode) tecken. Var god flytta din Grand Theft Auto: San Andreas installation till en kompatibel sökväg som endast innehåller standard ASCII tecken och installera om Multi Theft Auto: San Andreas.
uk: Шлях до теки з вашим GTA: San Andreas має непідтримувані символи (юнікод). Змінити шлях до Grand Theft Auto: San Andreas, щоб в ньому були тільки ASCII символи і переінсталюйте Multi Theft Auto: San Andreas.

source: It appears you have a Steam version of GTA:SA, which is currently incompatible with MTASA. You are now being redirected to a page where you can find information to resolve this issue.
de: Anscheinend besitzt du die Steamversion von GTA:SA. Diese ist derzeit inkompatibel mit MTA:SA. Du wirst nun auf eine Website weitergeleitet, auf der du weiterführende Informationen zur Behebung dieses Fehlers finden kannst.
et: Tundub, et jooksutate Stiimi versiooni GTA:SA-st, mis hetkel ei sobi kokku MTA:SA-ga. Teid suunatakse edasi leheküljele, kust leiate informatsiooni selle probleemi kohta.
hr: Čini se da imate Steam verziju GTA:SA, koja je trenutno nekompatibilna sa MTASA.Preusmjeravamo vas na stranicu gdje možete pronaći informacije o tome kako riješiti ovaj problem.
hu: Úgy tűnik, hogy van egy Steam verziója GTA: SA, amely jelenleg nem egyeztethető össze az MTA:SA-val. Átirányítjuk egy oldalra ahol megtalál minden információt, hogy megoldja ezt a problémát.
it: Sembra che tu abbia la versione Steam di GTA:SA, attualmente incompatibile con MTA:SA. Stai per essere reindirizzato ad una pagina dove puoi trovare le informazioni per risolvere questo problema.
ja: あなたはGTA:SAのSteamバーションを使っているそうです。現在、Steamバーションはサポートされていませんので、オンラインでフィックスにあるページにリダイレクトされます。
lv: Izskatās, ka Jūs izmantojāt GTA:SA Steam versiju, kura šobrīd nav saderīga ar MTA:SA. Jūs tiekāt novirzīts uz lapu, kur varat atrast informāciju kā atrisināt šo problēmu.
mk: Вие имате steam верзија од GTA:SA, која во моментот е некомпатибилна со MTASA. ~ ~ Сега ќе бидете пренасочени до страница каде што може да го решите овој проблем.
nl: Het lijkt alsof u een Steam versie van GTA:SA heeft, dit wordt momenteel niet ondersteund door MTA:SA. U wordt nu doorverwezen naar een pagina waar u informatie kan vinden om dit probleem op te lossen.
pl: Wygląda na to, że posiadasz wersję Steam gry GTA:SA, która jest obecnie niekompatybilna z MTASA. Zostaniesz teraz przeniesiony na stronę, gdzie znajdziesz informacje o rozwiązywaniu tego problemu.
pt_br: Parece que você tem uma versão Steam do GTA: San Andreas, que atualmente não é compatível com o MTA:SA. Você vai ser direcionado a uma página em que poderá encontrar informações de como resolver este problema.
ro: Se pare că aveți o versiune Steam a GTA: San Andreas care este momentan incompatibilă cu MTA: San Andreas. Veți fi redirecționat către o pagină unde veți putea găsi informații despre cum să rezolvați această problemă.
ru: Похоже, у вас Steam версия GTA:SA, которая в настоящее время не совместима с MTA:SA. Вы будете перенаправлены на страницу, где вы можете найти информацию для решения этого вопроса.
sk: Vypadá to že máš Steam verziu GTA:SA ktorá momentálne nie je kompatibilná s MTA:SA. Teraz budeš presmerovaný na stránku kde môžeš nájsť viacej informácií pre vyriešenie tohto problému.
sl: Kot kaže, imate Steam različico programa GTA:SA, ki trenutno ni združljiva z MTA:SA. Sedaj boste preusmerjeni na spletno stran, kjer lahko najdete informacije kako rešiti ta problem.
sv: Det verkar som att du har en Steam version utav GTA: SA, som för tillfället ej stöds utav MTA: SA. Du vidarebefordras nu till en webbplats där du kan hitta information för att åtgärda problemet.
uk: Схоже, у вас Steam версія GTA:SA, яка в даний час не сумісна з MTA:SA. Ви будете перенаправлені на сторінку, де можна знайти інформацію для вирішення цього питання.

source: The path to your installation of 'MTA:SA' or 'GTA: San Andreas' contains a ';' (semicolon). If you experience problems when running MTA:SA, move your installation(s) to a path that does not contain a semicolon.
de: Der Pfad zu deiner Installation von 'MTA:SA' oder 'GTA: San Andreas' enthält ';' (Semikolon). Wenn du Probleme bei der Ausführung von MTA:SA hast, ändere bitte deinen Installationspfad auf einen Pfad der kein Semikolon enthält.
et: Asukoht 'MTA:SA' või 'GTA: San Andrease' jaoks sisaldab ';' (semikoolonit). Kui sul tekib probleeme MTA:SA käivitamisega siis paigaldage need sinna, kus pole semikooloneid.
hr: Direktorij od instalacije 'MTA:SA' ili 'GTA: San Andreas' sadrži ';' (točka-zarez). Ukoliko budete imali problema tijekom korištenja MTA:SA, premjestite instalaciju(e) u direktorij koji ne sadrži točku-zarez.
hu: A telepítési útvonala 'MTA:SA' vagy 'GTA: San Andreas' tartalmaz ';' (pontosvessző). Ezzel problémák merülhetnek fel, ha fut az MTA:SA, Helyezze át egy pontosvesszőt nem tartalmazó útvonalra.'
it: Il percorso d'installazione di 'MTA:SA' o 'GTA: San Andreas' contiene un ';' (punto e virgola). Se riscontri problemi utilizzando MTA:SA, sposta l'installazione/installazioni in un percorso che non contiene il punto e virgola.
ja: 「MTA:SA」や「GTA:SA」のインストールパスに「；」が含んでいます。 問題があったら、 「；」のないパスにインストールを移動してください。
lt: Vieta iki įdiegtos 'MTA:SA' ar 'GTA: San Andreas' versijos susideda iš ';' (kabliataškio). Jei patirsite problemų paleidžiant MTA:SA, patraukite savo žaidimą(us) į vietą, nesusidedančią iš kabliataškio.
lv: Ceļš uz jūsu 'MTA:SA' vai 'GTA: San Andreas' instalāciju satur ';' (semikolu). Ja jūs satopieties ar problēmām darbinot MTA:SA, pārvietojiet instalāciju(s) uz vietu kura nesatur semikolu.
mk: Линкот до инсталацијата на 'MTA:SA' или 'GTA: San Andreas' содржи ';' (точказапирка). ~Доколку имате проблеми со MTA:SA, ~преместете ја инсталацијата во друг линк што не содржи точказапирка.
nl: Het pad naar uw 'MTA:SA' of 'GTA: San Andreas' installatie bevat een ';' (puntkomma). Als u problemen ondervindt met MTA:SA, verplaats dan uw installatiepad(en) naar een pad dat geen puntkomma bevat.
pl: Ścieżka do Twojej instalacji 'MTA:SA' lub 'GTA: San Andreas' zawiera znak ';' (średnik). Jeśli będziesz miał problemy z działaniem MTA:SA, zainstaluj grę i moda w ścieżkach, które nie zawierają znaku średnika.
pt_br: O caminho para a sua instalação do 'MTA:SA' ou 'GTA: San Andreas' contém um ';' (Ponto e vírgula). Se você perceber problemas ao rodar o MTA:SA, mova sua(as) instalação(ões) para um caminho que não contenha um Ponto e vírgula.
ro: Calea către instalarea MTA: San Andreas sau instalarea GTA: San Andreas conține un simbol ';' (punct și virgulă). Dacă întâmpinați probleme în timpul rulării MTA:SA, mutați-vă instalarea sau instalările într-un loc care nu conține acest simbol.
ru: Путь к папке MTA:SA или GTA: San Andreas имеет символ ';' (точку с запятой). Переустановите MTA:SA и GTA: San Andreas, так, чтобы в пути до папок не было точки с запятой.
sk: Umiestnenie tvojej inštalácie 'MTA:SA' alebo 'GTA: San Andreas' obsahuje znak ';' (bodkočiarka). Pokiaľ budeš mať problémy pri spustení MTA:SA, presuň tvoju inštaláciu(e) do umiestnenie ktoré neobsahuje bodkočiarku.
sl: Pot do vaše namestitvije 'MTA:SA' ali 'GTA: San Andreas' vsebuje ';' (podpičje), Če naletite na probleme med igranjem MTA:SA, premaknite namestitev na pot, ki ne vsebuje podpičja.
sv: Sökvägen till din installation av 'MTA:SA' eller 'GTA: San Andreas' innehåller ett ';' (semikolon). Om du får problem när du kör MTA:SA, flytta din(a) installation(er) till en sökväg som ej innehåller ett semikolon.
uk: Шлях в теку MTA:SA або GTA: San Andreas має символ ';' (крапку з комою). Переінсталюйте MTA:SA и GTA: San Andreas, так, щоб в шляху до тек не було крапки з комою.

source: Load failed. Please ensure that the latest data files have been installed correctly.
de: Ladevorgang fehlgeschlagen. Bitte stelle sicher, dass die aktuellen Data Files korrekt installiert wurden.
et: Laadimine ebaõnnestus: Palun tehke kindlaks, et viimased andmefailid on paigaldatud korrektselt.
hr: Učitavanje neuspješno. Uvjerite se da su zadnje data datoteke instalirane pravilno.
hu: Betöltés sikertelen. Győződjön meg arról, hogy a legfrissebb data fájlok vannak telepítve.
it: Caricamento fallito. Per favore assicurati che i file dati più recenti siano stati installati correttamente.
ja: 読み込み失敗。最新データがインストールしているのを確認して下さい。
lt: Įkėlimas nepavyko. Prašome įsitikinti, jog paskutinės data bylos buvo įdiegtos teisingai.
lv: Ielāde neizdevās. Lūdzu pārliecinieties, ka pēdējie datu faili ir uzinstalēti pareizi.
mk: Вчитувањето е неуспешно. Ве молиме проверете дали најновите фајлови ви се инсталирани.
nl: Laden mislukt. Gelieve te verzekeren dat de laatste data bestanden correct zijn geïnstalleerd.
pl: Uruchomienie moda nie powiodło się. Upewnij się, że zainstalowano najnowsze pliki danych moda.
pt_br: Não foi possível carregar os arquivos necessários do MTA. Certifique-se que todos eles estão instalados corretamente.
ro: Încărcarea a eșuat. Te rugăm asigură-te că ultimele fișiere cu date au fost instalate corect.
ru: Ошибка запуска, проверьте правильность установки последних data-файлов.
sk: Načítanie zlyhalo. Prosím uisti sa že posledné data súbory boli nainštalované správne.
sl: Nalaganje se je izjalovilo. Prosimo preverite, da so bile najnovejše podatkovne datoteke nameščene pravilno.
sv: Initiering misslyckades. Försäkra dig om att de senaste datafilerna installerats korrekt.
uk: Помилка запуску, перевірте правильність інсталювання останніх data-файлів.

source: Load failed. Please ensure that %s is installed correctly.
de: Ladevorgang fehlgeschlagen. Bitte stelle sicher, dass %s korrekt installiert wurde.
et: Laadimine ebaõnnestus. Palun tehke kindlaks, kas %s on paigaldatud korrektselt.
hr: Učitavanje neuspjelo. Molimo uvjerite se da je %s instaliran ispravno.
hu: Betöltés sikertelen. Győződjön meg arról, hogy a %s jól van-e telepítve.
it: Caricamento fallito. Per favore assicurati che %s sia installato correttamente.
ja: 読み込み失敗。%s が正しくにインストールされたのが確認して下さい。
lt: Įkėlimas nepavyko. Prašome įsitikinti, kad %s yra įdiegtas teisingai.
lv: Ielāde neizdevās. Lūdzu pārliecinieties, ka %s ir instalēts pareizi.
mk: Вчитувањето е неуспешно. Ве молиме проверете дали %s е инсталиран правилно.
nl: Laden mislukt. Gelieve te verzekeren dat %s correct is geïnstalleerd.
pl: Uruchomienie moda nie powiodło się. Upewnij się, że %s zostało poprawnie zainstalowane.
pt_br: Não foi possível carregar o arquivo %s. Certifique-se que este está instalado corretamente.
ro: Încărcarea a eșuat. Te rugăm asigură-te că %s este instalat corect.
ru: Загрузка не удалась. Убедитесь что %s установлен правильно.
sk: Načítanie zlyhalo. Uisti sa prosím že %s je nainštalovaný správne.
sl: Nalaganje se je izjalovilo. Prosimo preverite, da je %s nameščen pravilno.
sv: Initiering misslyckades. Försäkra dig om att %s är installerat korrekt.
uk: Завантаження не вдалася. Впевніться, що %s встановлено правильно.

source: Load failed. Could not find gta_sa.exe in %s.
de: Ladevorgang fehlgeschlagen. Konnte gta_sa.exe nicht in %s finden.
et: Laadimine ebaõnnestus. Ei suutnud leida gta_sa.exe kohast %s.
hr: Učitavanje neuspjelo. Nije moguće pronaći gta_sa.exe u %s.
hu: Betöltés sikertelen. Nem találom a gta_sa.exe-t itt %s.
it: Caricamento fallito. Impossibile trovare gta_sa.exe in %s.
ja: 読み込み失敗。gta_sa.exe は %s に見つかれませんでした
lt: Įkėlimas nepavyko. Nerastas gta_sa.exe nurodytoje vietoje %s.
lv: Ielāde neizdevās. Nespēj atrast gta_sa.exe iekš %s.
mk: Вчитувањето е неуспешно. gta_sa.exe во %s не може да се пронајде.
nl: Laden mislukt. Kon gta_sa.exe niet vinden in %s.
pl: Uruchomienie moda nie powiodło się. Nie znaleziono pliku gta_sa.exe w %s.
pt_br: Falha ao carregar. Não foi possível localizar o gta_sa.exe em %s.
ro: Încărcarea a eșuat. Nu s-a putut găsi 'gta_sa.exe' în %s.
ru: Загрузка не удалась, поскольку gta_sa.exe не был найден в %s
sk: Načítanie zlyhalo. Nemožno nájsť gta_sa.exe v %s.
sl: Nalaganje se je izjalovilo. Ni bilo mogoče najti gta_sa.exe v %s.
sv: Initiering misslyckades. gta_sa.exe kunde inte hittas i %s.
uk: Не вдалося завантажити, оскільки gta_sa.exe не був знайдений в %s

source: Load failed. %s exists in the GTA directory. Please delete before continuing.
de: Ladevorgang fehlgeschlagen. Die Datei %s existiert im GTA Installationsordner. Bitte lösche diese Datei.
et: Laadimine ebaõnnestus. %s eksisteerib GTA kaustas. Palun kustutage ennem jätkamist.
hr: Učitavanje neuspjelo. %s postoji u GTA direktoriju. Molimo izbrišite ga prije nastavljanja.
hu: Betöltés sikertelen. %s létezik a GTA könyvtárban. Kérjük törölje a folytatás előtt.
it: Caricamento fallito: %s esiste nella directory di GTA. Per favore eliminalo prima di continuare.
ja: 読み込み失敗。%s は存在しています。続く前に、消しておいてください。
lt: Įkėlimas nepavyko. %s egzistuoja GTA direktorijoje. Prašome ištrinti prieš tęsiant.
lv: Ielāde neizdevās. %s atrodas GTA mapē. Lūdzu izdzēsiet, pirms turpiniet.
mk: Вчитувањето е неуспешно. %s постои во GTA дирекцијата. Ве молиме тргнете го пред да продолжите.
nl: Laden mislukt. %s bestaat in uw GTA pad. Gelieve het te verwijderen voor u doorgaat.
pl: Uruchomienie moda nie powiodło się. %s istnieje w katalogu z GTA:SA. Usuń ten plik przed kontynuowaniem.
pt_br: Não foi possível carregar o MTA, pois o arquivo %s está na pasta do GTA. Delete-o antes de continuar.
ro: Încărcarea a eșuat. %s se află în directorul GTA. Te rugăm șterge-l înainte de a continua.
ru: Загрузка не удалась. Удалите файл %s в папке GTA перед запуском.
sk: Načítanie zlyhalo. %s existuje v GTA umiestnení. Zmaž ho prosím pred pokračovaním.
sl: Nalaganje se je izjalovilo. %s obstaja v GTA mapi. Prosimo, da ga pred nadaljevanjem izbrišete.
sv: Initiering misslyckades. %s finns i GTA sökvägen. Ta bort innan du fortsätter.
uk: Завантаження не вдалася. Видаліть файл %s в теці GTA перед запуском.

source: Main file has an incorrect name (%s)
de: Hauptdatei hat einen falschen Namen (%s)
hr: Glavna datoteka ima pogrešno ime (%s)
hu: Az alap fájlnak helytelen a neve (%s)
ja: メインファイルは正しくない名前をもっています(%s)
lt: Pagrindinis failas yra blogai užvadintas (%s)
lv: Galvenajam failam ir nepareizs nosaukums (%s)
mk: Главниот фајл има погрешно име (%s)
nl: Hoofdbestand had een foute naam (%s)
pl: Plik główny ma nieprawidłową nazwę (%s)
pt_br: O arquivo executável do GTA:SA está com nome incorreto (%s)
ro: Fișierul principal are un nume incorect (%s)
ru: У основного файла неверное имя (%s)
uk: Основний файл має неправильне ім'я (%s)

source: Main file is unsigned. Possible virus activity. See online help if MTA does not work correctly.
de: Hauptdatei ist nicht signiert. Grund dafür könnte ein Virus sein. Siehe Onlinehilfe, wenn MTA nicht korrekt funktioniert.
hr: Glavna datoteka je neupisana. Moguća aktivnost virusa. Potražite pomoć na internetu ako MTA ne radi kako treba.
hu: Az alap fájl aláíratlan. Lehetséges vírus aktivitása. Nézd meg az online segítséget, ha az MTA nem működik megfelelően.
ja: メインファイルが割り当てられていません。ウイルスの活動があるかもしれません。 MTAになにか、珍しいことまたは実行していないは、オンラインヘルプを探してください。
lt: Pagrindinis failas yra nepatvirtintas. Galimas virusų aktyvumas. Peržiūrėkite pagalbą internete, jei MTA neveikia.
lv: Galvenā faila certifikāta problēma. Iespējama vīrusu aktivitāte.. Skatiet tiešsaistes palīdzību, ja MTA nestrādā pareizi.
mk: Главниот фајл е непотпишан. Можни вирусни активности. Побарајте онлјан помош доколку MTA не работи како што треба.
nl: Hoofdbestand is niet ondertekend. Mogelijke virusactiviteit. Gelieve online hulp te raadplegen als MTA niet correct werkt.
pl: Plik główny jest niepodpisany. Możliwa aktywność wirusa. Zapoznaj się z pomocą on-line jeśli MTA nie działa poprawnie.
pt_br: O executável do GTA:SA apresenta uma assinatura diferente, portanto pode conter um vírus. Se o MTA não funcionar corretamente, procure por ajuda online.
ro: Fișierul principal este nesemnat. Posibilă activitate a virușilor. Vezi ajutor on-line dacă MTA nu funcționează corect.
ru: Основной файл не подписан. Возможна вирусная угроза. Используйте онлайн помощь, если MTA работает некорректно
uk: Основний файл не підписаний. Можлива вірусна загроза. Використовуйте онлайн-довідку, якщо MTA працює неправильно

source: Data files modified. Possible virus activity. See online help if MTA does not work correctly.
de: Datendateien wurden modifiziert. Möglicher Virus. Siehe Onlinehilfe, wenn MTA nicht korrekt funktioniert.
hr: Datoteke modificirane. Moguća aktivnost virusa. Potražite pomoć na internetu ako MTA ne radi kako treba.
hu: Az adatfájlok módosultak. Lehetséges vírus aktivitása. Nézd meg az online segítséget, ha az MTA nem működik megfelelően.
ja: データファイルが変わりました。ウイルス活動の可能性があります。 MTAになにか、珍しいことまたは実行していないは、オンライン手伝いを探してください。
lt: Data failai pakeisti. Galimas virusų aktyvumas. Peržiūrėkite pagalbą internete, jei MTA neveikia.
lv: Datu faili ir modificēti. Iespējama vīrusu aktivitāte. Skatiet tiešsaistes palīdzību, ja MTA nestrādā pareizi.
mk: Дата фајловите се модифицрани.Можни вирусни активности. Побарајте онлјан помош доколку MTA не работи како што треба.
nl: Data bestanden aangepast. Mogelijke virus activiteit. Raadpleeg online hulp als MTA niet correct werkt.
pl: Pliki danych zostały zmodyfikowane. Możliwa aktywność wirusa. Zapoznaj się z pomocą on-line jeśli MTA nie działa poprawnie.
pt_br: Alguns arquivos do GTA:SA foram alterados, portanto podem conter um vírus. Se o MTA não funcionar corretamente, procure por ajuda online.
ro: Fișierele cu date sunt modificate. Posibilă activitate a virușilor. Vezi ajutor on-line dacă MTA nu funcționează corect.
ru: Файл данных модифицирован. Возможна вирусная активность. Используйте онлайн помощь, если MTA работает некорректно.
uk: Файл даних модифікований. Можлива вірусна активність. Використовуйте онлайн-довідку, якщо MTA працює неправильно.
