Repository: multitheftauto/mtasa-blue
Catalog: Shared/data/MTA San Andreas/MTA/locale/*/client.po
Languages: de, et, hr, hu, it, ja, lt, lv, mk, nl, pl, pt_br, ro, ru, sk, sl, sv, uk

source: Resources
de: Resourcen
et: Ressursid
hr: Resursi
hu: Erőforrások
it: Risorse
ja: 資源
lt: Resursai
lv: Resursi
mk: Ресурси
nl: Bronnen
pl: Zasoby
pt_br: Recursos
ro: Resurse
ru: Ресурсы
sl: Sredstva
sv: Resurser
uk: Ресурси

source: Server name:
et: Serveri nimi:
hr: Ime poslužitelja:
hu: Szerver neve:
it: Nome del server:
ja: サーバ名:
lt: Serverio pavadinimas:
lv: Servera nosaukums:
mk: Име на сервер:
nl: Server naam:
pl: Nazwa serwera:
pt_br: Nome do servidor:
ro: Nume server:
ru: Имя сервера:
sk: Meno serveru:
sl: Ime strežnika:
sv: Server namn:
uk: Ім'я сервера:

source: Password:
de: Passwort:
et: Salasõna:
hr: Lozinka:
hu: Jelszó:
ja: パスワード:
lt: Slaptažodis:
lv: Parole:
mk: Пасворд:
nl: Wachtwoord:
pl: Hasło:
pt_br: Senha:
ro: Parolă:
ru: Пароль:
sk: Heslo:
sl: Geslo:
sv: Lösenord:
uk: Пароль:

source: Max players:
de: Max Spieler:
et: Maks mängijaid:
hr: Ime poslužitelja:
hu: Max játékos:
it: N. massimo di giocatori:
ja: 最大プレイヤー数:
lt: Maks. žaidėjai:
lv: Max spēlētāji:
mk: Максимум играчи:
nl: Max spelers:
pl: Maks. liczba graczy:
pt_br: Capacidade máxima:
ro: Număr sloturi:
ru: Макс. кол-во игроков:
sk: Max hráčov:
sl: Največje število igralcev:
sv: Max spelare:
uk: Макс. кількість гравців:

source: Broadcast:
et: Ülekanne:
hr: Odašiljanje:
it: Trasmissione:
ja: 放送：
lt: Transliavimas:
lv: Apraide:
mk: Емитување:
nl: Uitzenden:
pl: Rozgłaszaj w sieci:
ro: Transmisie:
ru: Видимость в:
sk: Vysielanie:
sl: Oddajanje:
sv: Utsändning:
uk: Видимість в:

source: LAN
mk: Мрежно
ru: Локальная сеть
uk: Локальна мережа

source: Selected
de: Ausgewählte
et: Valitud
hr: Odabrano
hu: Kijelölve
it: Selezionato
ja: 選択
lt: Pasirinktas
lv: Izvēlēts
mk: Селектиран
nl: Geselecteerde
pl: Wybrane
pt_br: Habilitado
ro: Selectate
ru: Выбрано
sk: Zvolené
sl: Izbrano
sv: Vald
uk: Вибрано

source: All
de: Alle
et: Kõik
hr: Sve
hu: Összes
it: Tutti
ja: 全部
lt: Visi
lv: Visi
mk: Се
nl: Alle
pl: Wszystkie
pt_br: Todos
ro: Toate
ru: Всё
sk: Všetko
sl: Vse
sv: Alla
uk: Усе

source: Start
de: Starten
et: Alusta
hr: Pokreni
it: Inizia
ja: 開始
lt: Pradėti
lv: Sākt
mk: Старт
pl: Uruchom
pt_br: Iniciar
ro: Lansează
ru: Запустить
sk: Štart
sl: Začni
sv: Starta
uk: Запустити

source: Disconnected: Invalid nickname
de: Verbindung getrennt: Ungültiger Nickname
et: Ühendus katkestatud: Ebasobiv mängunimi
hr: Odspojeni: Nevažeći nadimak
hu: Lecsatlakozva: Hibás felhasználónév
it: Disconnesso: Nickname non valido
ja: 接続切断：不正なニックネーム
lt: Atjungta: netinkamas slapyvardis
lv: Atslēgšanās: Nederīgs segvārds
mk: Дисконектиран: Никот е погрешен
nl: Verbinding verbroken: Ongeldige gebruikersnaam
pl: Rozłączono: Nieprawidłowy nick
pt_br: Desconectado: Apelido inválido
ro: Deconectat: Nume invalid
ru: Отключение: неверный никнейм.
sk: Odpojené: Neplatný nick
sl: Povezava prekinjena: Napačen vzdevek
sv: Ifrånkopplad: Ogiltigt användarnamn
uk: Від'єднання: невірний нікнейм.

source: Disconnect from server
de: Verbindung vom Server getrennt
et: Katkesta ühendus
hr: Prekini vezu s poslužiteljem
hu: Lecsatlakozva a szerverről
it: Disconnesso dal server
ja: サーバから切断する
lt: Atsijungta iš serverio
lv: Atslēgties no servera
mk: Дисконектирање од серверот
nl: Verbinding verbroken
pl: Rozłącz z serwerem
pt_br: Desconectado do servidor
ro: Deconectează-te de la server
ru: Отключение от сервера
sk: Odpojené zo serveru
sl: Prekini povezavo s strežnikom
sv: Avbryt anslutningen från servern
uk: Від'єднання від сервера

source: Disconnected: Serial is banned. Reason: %s
de: Verbindung getrennt: Serial ist gebannt. Grund:%s
et: Ühendus katkestatud: Serial on bannitud. Põhjus: %s
hr: Odspojeni: Serial je prognan. Razlog: %s
hu: Lecsatlakozva: A serialod kivan tiltva. Indok: %s
it: Disconnesso: Il seriale è bannato. Ragione: %s
ja: 切断：シリアルが禁止されました。 理由： %s
lt: Atjungta: Serijinis numeris užblokuotas. Priežastis: %s
lv: Atslēgšanās: Seriāls ir melnajā sarakstā. Iemesls: %s
mk: Дисконектиран: Серискиот број е баниран. Причина %s
nl: Verbinding verbroken: Serienummer is verbannen. Reason: %s
pl: Rozłączono: Twój numer seryjny jest zablokowany. Powód: %s
pt_br: Desconectado: Serial está banido. Razão: %s
ro: Deconectat: Serialul tău are interdicție. Motiv: %s
ru: Отключение: Серийный номер заблокирован. Причина: %s
sk: Odpojené: Serial je zabanovaný. Dôvod: %s
sl: Povezava prekinjena: Serijska številka je izključena. Razlog: %s
sv: Frånkopplad: Serienumret är avstängt. Orsak: %s
uk: Від'єднання: Серійний номер заблокований. Причина: %s

source: Disconnected: You are banned. Reason: %s
de: Verbindung getrennt: Du bist gebannt. Grund: %s
et: Ühendus katkestatud: Oled bannitud. Põhjus: %s
hr: Odspojeni: Prognani ste. Razlog: %s
hu: Lecsatlakozva: Ki vagy tiltva. Indok: %s
it: Disconnesso: Sei stato bannato. Ragione: %s
ja: 切断： あなたが禁止されました。 理由：%s
lt: Atjungta: Priėjimas užblokuotas. Priežastis: %s
lv: Atslēgšanās: Jūs esat melnajā sarakstā. Iemesls: %s
mk: Дисконектиран: Вие сте банирани. Причина: %s
nl: Verbinding verbroken: U werd verbannen. Reden: %s
pl: Rozłączono: Zostałeś zbanowany. Powód: %s
pt_br: Desconectado: Você está banido. Razão: %s
ro: Deconectat: Ai interdicție. Motiv: %s
ru: Отключение: Вы забанены. Причина: %s
sk: Odpojené: Si zabanovaný. Dôvod: %s
sl: Povezava prekinjena: Bili ste izključeni. Razlog: %s
sv: Frånkopplad: Du är avstängd. Orsak: %s
uk: Від'єднання: Ви забанені. Причина: %s

source: Disconnected: Account is banned. Reason: %s
de: Verbindung getrennt: Account wurde gebannt. Grund: %s
et: Ühendus katkestatud: Kasutaja on bannitud. Põhjus: %s
hr: Odspojeni: Račun je prognan. Razlog: %s
hu: Lecsatlakozva: Az accountod ki van tiltva. Indok: %s
it: Disconnesso: Account bannato. Ragione: %s
ja: 切断：アカウントが禁止されました。 理由： %s
lt: Atjungta: Sąskaita užblokuota. Priežastis: %s
lv: Atslēgšanās: Kontam ir liegta piekļuve. Iemesls: %s
mk: Дисконектиран: Акаунтот е баниран. Причина: %s
nl: Verbinding verbroken: Account is verbannen. Reden: %s
pl: Rozłączono: To konto jest zablokowane. Powód: %s
pt_br: Desconectado: Conta banida. Razão: %s
ro: Deconectat: Contul este banat. Motiv: %s
ru: Отключение: Аккаунт заблокирован. Причина: %s
sk: Odpojené: Účet je zabanovaný. Dôvod: %s
sl: Povezava prekinjena: Račun je izključen. Razlog: %s
sv: Frånkopplad: Konto är avstängt. Orsak: %s
uk: Від'єднання: Обліківка заблокована. Причина: %s

source: Disconnected: Version mismatch
de: Verbindung getrennt: Versionen stimmen nicht überein
et: Ühendus katkestatud: Versioonid ei kattu
hr: Odspojeni: Neusklađenost verzija
hu: Lecsatlakozva: Nem megfelelő verziópárosítás
it: Disconnesso: Versione non corrispondente
ja: 切断： バージョンミスマッチ
lt: Atjungta: Versija nesutampa
lv: Atslēgšanās: Versijas nesakrišana
mk: Дисконектиран: Погрешна верзија
nl: Verbinding verbroken: Versies komen niet overeen
pl: Rozłączono: Rozbieżność wersji
pt_br: Desconectado: Versões não coincidem
ro: Deconectat: Nepotrivire de versiune
ru: Отключение: Версии не совпадают
sk: Odpojené: Nezhoda verzií
sl: Povezava prekinjena: Neusklajenost različice
sv: Frånkopplad: Version matchar ej
uk: Від'єднання: Версії не збігаються

source: Disconnected: Join flood. Please wait a minute, then reconnect.
de: Verbindung getrennt: Zu viele Verbindungsversuche. Bitte warte eine Minute und versuche es dann erneut.
et: Ühendus katkestatud: Proovid liituda liiga kiiresti. Palun oota minut ja siis proovi uuesti.
hr: Odspojeni: Previše igrača se pridružuje istovremeno. Molimo pričekajte minutu, te se ponovno povežite.
hu: Lecsatlakozva: Belépés flood. Kérjük várjon egy percet, majd csatlakozzon újra.
it: Disconnesso: Flood di ingresso. Per favore aspetta un minuto, quindi riprova.
ja: 切断： 参加溢水。しばらくお待ちください、そして再接続してください。
lt: Atjungta: Per daug prisijungimų. Prašome palaukti minutę ir bandyti dar kartą.
lv: Atslēgšanās: Pārmērīga pieslēgšanās. Uzgaidiet minūti, un tad mēģiniet vēlreiz.
mk: Дисконектиран: Ве молиме почекајте минута и после тоа реконектирајте се.
nl: Verbinding verbroken: Teveel aanmeldingen. Een minuut wachten alstublieft, probeer het dan opnieuw.
pl: Rozłączono: Zbyt duża ilość prób podłączeń. Poczekaj kilka minut i spróbuj ponownie.
pt_br: Você foi desconectado, pois detectamos que você está reentrando no jogo diversas vezes. Por favor, espere um minuto e tente novamente.
ro: Deconectat: Server supraîncărcat. Te rugăm așteaptă un minut, apoi reconectează-te.
ru: Отключение: Флуд подключениями. Подождите минуту перед новой попыткой.
sk: Odpojené: Join flood. Počkaj prosím minútu, potom sa znovu pripoj.
sl: Povezava prekinjena: Poplava prijav. Prosimo, počakajte minuto, potem poskusite znova.
sv: Frånkopplad: Anslutningsflod. Vänta en minut och anslut igen.
uk: Від'єднання: Флуд підключеннями. Зачекайте хвилину перед новою спробою.

source: Disconnected: Server from different branch. Information: %s
de: Verbindung getrennt: Server ist aus anderem Branch. Information: %s
et: Ühendus katkestatud: Server asub teises alas. Informatsioon: %s
hr: Odspojeni: Poslužitelj je sa drukčije grane. Informacija: %s
hu: Lecsatlakozva: A szerver forráskódja eltér a hivatalos verziótól. Információ: %s
it: Disconnesso: Server di ramo differente. Informazioni: %s
ja: 切断： サーバのブランチは違います。 情報： %s
lt: Atjungta: Serveris iš skirtingos šakos. Informacija: %s
lv: Atslēgšanās: Serveris ir no citas nozares. Informācija: %s
mk: Дисконектиран: Сервер од различна верзија. Информации: %s
nl: Verbinding verbroken: Server van andere tak. Informatie: %s
pl: Rozłączono: Serwer oparty na innej gałęzi moda. Informacja: %s
pt_br: Você foi desconectado, pois o servidor pertence a outro ramo. Razão: %s
ro: Deconectat: Serverul este dintr-o branșă diferită. Informații: %s
ru: Отключение: Сервер другой версии. Информация: %s
sk: Odpojené: Server z inej vetvy. Informácie: %s
sl: Povezava prekinjena: Strežnik je iz različne veje. Informacije: %s
sv: Frånkopplad: Server från annan gren. Information: %s
uk: Від'єднання: Сервер іншою версією. Інформація: %s

source: Disconnected: Bad version. Information: %s
de: Verbindung getrennt: Ungültige Version. Information: %s
et: Ühendus katkes: Ebasobiv versioon. Informatsioon: %s
hr: Odspojeni: Loša verzija. Informacija: %s
hu: Lecsatlakozva: Rossz verzió. Információ: %s
it: Disconnesso: Versione errata. Informazioni: %s
ja: 切断： 不正バージョン。 情報： %s
lt: Atjungta: Bloga versija. Informacija: %s
lv: Atslēgšanās: Nepareiza versija. Informācija: %s
mk: Дисконектиран: Лоша верзија. Информации: %s
nl: Verbinding verbroken: Slechte versie. Informatie: %s
pl: Rozłączono: Niewłaściwa wersja. Informacja: %s
pt_br: Você foi desconectado, pois possui uma versão inválida. Detalhes: %s
ro: Deconectat: Versiune incorectă. Informații: %s
ru: Отключение: Неподходящая версия. Информация: %s
sk: Odpojené: Zlá verzia. Informácie: %s
sl: Povezava prekinjena: Slaba različica. Informacije: %s
sv: Frånkopplad: Ogiltig version. Information: %s
uk: Від'єднання: Невідповідна версія. Інформація: %s

source: Disconnected: Server is running a newer build. Information: %s
de: Verbindung getrennt: Server nutzt einen neueren Build. Information: %s
et: Ühendus katkes: Server jooksutab uuemat versiooni. Informatsioon: %s
hr: Odspojeni: Poslužitelj je na novijoj građi. Informacija: %s
hu: Lecsatlakozva: A szerver újabb verzión fut. Információ: %s
it: Disconnesso: Il server sta utilizzando una nuova versione. Informazioni: %s
ja: 切断： サーバが新しいビルドを実行しています。 情報： %s
lt: Atjungta: Serveris naudoja naujesnę versiją. Informacija: %s
lv: Atslēgšanās: Serveris darbojās zem jaunākas būvversijas. Informācija: %s
mk: Дисконектиран: Серверот работи на поново верзија. Информации: %s
nl: Verbinding verbroken: Server draait een nieuwere versie. Informatie: %s
pl: Rozłączono: Serwer działa w oparciu o nowszą wersję. Informacja: %s
pt_br: Você foi desconectado, pois o servidor está rodando uma versão mais recente. Motivo: %s
ro: Deconectat: Serverul rulează o versiune mai nouă. Informații: %s
ru: Отсоединен: Сервер работает на более новой версии. Информация: %s
sk: Odpojené: Server beží na novšej verzií (build). Informácie: %s
sl: Povezava prekinjena: Strežnik teče na novejši različici. Informacije: %s
sv: Frånkopplad: Servern kör en nyare build. Information: %s
uk: Від'єднання: Сервер працює на більш новій версії. Інформація: %s

source: Disconnected: Server is running an older build. Information: %s
de: Verbindung getrennt: Server nutzt einen älteren Build. Information: %s
et: Ühendus katkes: Server jooksutab vanemat versiooni. Informatsioon: %s
hr: Odspojeni: Poslužitelj je na starijoj građi. Informacija: %s
hu: Lecsatlakozva: A szerver régebbi verzión fut. Információ: %s
it: Disconnesso: Il server sta utilizzando una vecchia versione. Informazioni: %s
ja: 接続切断： サーバが古いビルドを実行しています。情報： %s
lt: Atjungta: Serveris naudoja senesnę versiją. Informacija: %s
lv: Atslēgšanās: Serveris darbojās uz vecāku būvējumu. Informācija: %s
mk: Дисконектиран: Серверот работи на постара верзија. Информации: %s
nl: Verbinding verbroken: Server draait een oudere versie. Informatie: %s
pl: Rozłączono: Serwer działa w oparciu o starszą wersję. Informacja: %s
pt_br: Você foi desconectado, pois o servidor está rodando uma versão mais antiga. Motivo: %s
ro: Deconectat: Serverul rulează o versiune mai veche. Informații: %s
ru: Отсоединен: Сервер работает на более старой версии. Информация: %s
sk: Odpojené: Server beží na staršej verzií. Informácie: %s
sl: Povezava prekinjena: Strežnik teče na starejši različici. Informacije: %s
sv: Frånkopplad: Servern kör en äldre build. Information: %s
uk: Від'єднання: Сервер працює на більш старій версії. Інформація: %s

source: Disconnected: Nick already in use
de: Verbindung getrennt: Nickname wird bereits verwendet
et: Ühendus katkestati: Mängunimi on juba kasutusel
hr: Odspojeni: Nadimak se već koristi
hu: Lecsatlakozva: A felhasználónév már használatban van
it: Disconnesso: Nickname già in uso
ja: 接続切断： ニックネームは今使われています
lt: Atjungta: Slapyvardis jau naudojamas
lv: Atslēgšanās: Segvārds jau tiek izmantots
mk: Дисконектиран: Името е веќе во употреба
nl: Verbinding verbroken: Gebruikersnaam al in gebruik
pl: Rozłączono: Ten nick jest już w użyciu
pt_br: Você foi desconectado, pois o seu apelido já está em uso
ro: Deconectat: Numele tău este deja folosit
ru: Отключение: Такой никнейм уже используется
sk: Odpojené: Nick sa už používa
sl: Povezava prekinjena: Vzdevek je že v uporabi
sv: Frånkopplad: Nick redan i bruk
uk: Від'єднання: Такий нікнейм вже використовується

source: Disconnected: Player Element Could not be created.
de: Verbindung getrennt: Spielerelement konnte nicht erstellt werden.
et: Ühendus katkestati: Mängija elementi ei suudetud luua.
hr: Odspojeni: Element Igrača Nije mogao biti izrađen.
hu: Lecsatlakozva: Játékos elem nem hozható létre.
it: Disconnesso: Gli elementi del giocatore non possono essere creati.
ja: 切断： プレーヤーエレメントが作成できませんでした。
lv: Atslēgšanās: Spēlētāja Elementu Nespēj izveidot.
mk: Дисконектиран: Играч Елемент не може да се креира.
nl: Verbinding verbroken: Speler element kon niet worden aangemaakt.
pl: Rozłączono: Nie udało się stworzyć Player Element.
pt_br: Você foi desconectado, pois o jogador não pôde ser criado.
ro: Deconectat: Instanța jucătorului nu a putut fi creată
ru: Отключение: Элемент-Игрок не может быть создан.
sk: Odpojené: Hráčsky prvok nemohol byť vytvorený.
sl: Povezava prekinjena: Ni bilo mogoče ustvariti igralca.
sv: Frånkopplad: Spelarelement kunde inte skapas.
uk: Від'єднання: Елемент-Гравець не може бути створений.

source: Disconnected: Server refused the connection: %s
de: Verbindung getrennt: Server hat die Verbindung verweigert: %s
et: Ühendus katkestati: Serveri ei soovi ühendust luua %s
hr: Odspojeni: Poslužitelj je odbacio vezu: %s
hu: Lecsatlakozva: A szerver megtagadta a kapcsolatot: %s
it: Disconnesso: Il server ha rifiutato la connessione: %s
ja: 切断： サーバが接続をことわりました： %s
lt: Atjungta: Serveris atmetė prisijungimą: %s
lv: Atslēgšanās: Serveris noraida savienojumu: %s
mk: Дисконектиран: Серверот ја одби конекцијата: %s
nl: Verbinding verbroken: server weigerde de verbinding: %s
pl: Rozłączono: Serwer odrzucił połączenie: %s
pt_br: Você foi desconectado, pois o servidor recusou sua conexão: %s
ro: Deconectat: Serverul a refuzat conexiunea: %s
ru: Отключение: Сервер сбросил подключение: %s
sk: Odpojené: Server odmietol spojenie: %s
sl: Povezava prekinjena: Strežnik je zavrnil povezavo: %s
sv: Frånkopplad: Servern vägrade anslutningen: %s
uk: Від'єднання: Сервер скинув під'єднання: %s

source: Disconnected: Serial verification failed
de: Verbindung getrennt: Verfizierung der Serial fehlgeschlagen
et: Ühendus katkestatud: Seriali auditeerimine ebaõnnestus
hr: Odspojeni: Potvrda seriala neuspjela
hu: Lecsatlakozva: Serial aktiválás hiba
it: Disconnesso: Verifica del seriale fallita
ja: 切断： シリアル確認失敗
lt: Atjungta: Serijinio kodo patvirtinimas nepavyko
lv: Atslēgšanās: Seriāla pārbaude neizdevās
mk: Дисконектиран: Верификацијата на серискиот број е неуспешен
nl: Verbinding verbroken: Serienummer verificatie mislukt
pl: Rozłączono: Nie udało się zweryfikować numeru seryjnego
pt_br: Desconectado: Falha ao verificar o serial
ro: Deconectat: Verificarea serialului a eșuat
ru: Отключение: не удалась проверка серийного ключа.
sk: Odpojené: Overovanie serialu zlyhalo
sl: Povezava prekinjena: Serijsko preverjanje se je izjalovilo
sv: Frånkopplad: Serienummerverifikation misslyckades
uk: Від'єднання: не вдалася перевірка серійного ключа.

source: Disconnected: Connection desync %s
de: Verbindung getrennt: Verbindungsdesynchronisation %s
et: Ühendus katkestatud: Ühendus pole sünkroonitud %s
hr: Odspojeni: Veza nesinkronizirana %s
hu: Lecsatlakozva: A kapcsolat nem szinkronizált %s
it: Disconnesso: desync connessione %s
ja: 切断： 接続非同期化 %s
lt: Atjungta: Prisijungimo desinchronizacija %s
lv: Atslēgšanās: Savienojuma pārsinhronizēja %s
mk: Дисконектиран: Десинк на конекцијата %s
nl: Verbinding verbroken: Verbindings-desynchronisatie %s
pl: Rozłączono: Zdesynchronizowane połączenie %s
pt_br: Você foi desconectado, pois a conexão dessincronizou: %s
ro: Deconectat: Desincronizare de conexiune %s
ru: Отключение: подключение десинхронизировано %s
sk: Odpojené: Chyba pripojenia (desync) %s
sl: Povezava prekinjena: Povezava se je desinhronizirala %s
sv: Frånkopplad: Anslutning desynkroniserad %s
uk: Від'єднання: під'єднання десинхронізовано %s

source: Disconnected: You were kicked by %s
de: Verbindung getrennt: Du wurdest von %s gekickt
et: Ühendus katkestatud: Said kicki %s poolt
hr: Odspojeni: Izbacio/la vas je %s
hu: Lecsatlakozva: Ki lettél rúgva általa: %s
it: Disconnesso: Sei stato espulso da %s
ja: 切断： %s にキックされました
lt: Atjungta: %s išmetė jus iš serverio
lv: Atslēgšanās: Jūs izmeta %s no servera
mk: Дисконектиран: Вие сте кикнати од %s
nl: Verbinding verbroken: U werd uit de server gegooid door %s
pl: Rozłączono: Zostałeś wyrzucony przez %s
pt_br: Desconectado: Você foi expulso do servidor por %s
ro: Deconectat: Ai fost dat afară de către %s
ru: Отключение: %s кикнул вас
sk: Odpojené: Bol si vyhodený hráčom %s
sl: Povezava prekinjena: %s te je brcnil iz strežnika
sv: Frånkopplad: Du blev utsparkad av %s
uk: Від'єднання: %s кікнув вас

source: Disconnected: You were banned by %s
de: Verbindung getrennt: Du wurdest von %s gebannt
et: Ühendus katkestatud: Said banni %s poolt
hr: Odspojeni: Prognao/la vas je %s
hu: Lecsatlakozva: Ki lettél tiltva általa: %s
it: Disconnesso: Sei stato bannato da %s
ja: 切断： %s に禁止されました
lt: Atjungta: %s uždraudė jums priėjimą prie serverio
lv: Atslēgšanās: %s liedza Jums piekļuvi
mk: Дисконектиран: Вие бевте банирани од %s
nl: Verbinding verbroken: U werd verbannen door %s
pl: Rozłączono: Zostałeś zbanowany przez %s
pt_br: Desconectado: Você foi banido do servidor por %s
ro: Deconectat: Ai primit interdicție de la %s
ru: Отключение: %s заблокировал вас
sk: Odpojené: Bol si zabanovaný hráčom %s
sl: Povezava prekinjena: %s te je izključil iz strežnika
sv: Frånkopplad: Du blev avstängd av %s
uk: Від'єднання: %s заблокував вас

source: Disconnected: Server shutdown or restarting
de: Verbindung getrennt: Server wurde heruntergefahren oder startet neu
hr: Odspojeni: Server ugašen ili se ponovno pali
hu: Lecsatlakozva: Szerver leállt vagy újraindul
ja: 切断：サーバー停止、また再起動
lt: Atjungta: Serveris išsijungė arba persikrauna
mk: Дисконектиран: Серверот е исклучен или се рестартира
pl: Rozłączono: Serwer został wyłączony lub zrestartowany.
pt_br: Desconectado: O servidor desligou ou está reiniciando
ru: Отключено: Сервер выключен или перезапущен
uk: Від'єднання: Сервер вимкнений або перезапущений

source: Time Remaining:
de: Zeit verbleibend:
et: Aega jäänud:
hr: Preostalo Vrijeme:
hu: Hátralevő idő:
it: Tempo Rimanente:
ja: 残り時間:
lt: Liko Laiko:
lv: Atlikušais Laiks:
mk: Преостанато време:~
nl: Resterende Tijd:
pl: Pozostały czas:
pt_br: Tempo restante:
ro: Timp rămas:
ru: Оставшееся время:
sk: Zostávajúci čas:
sl: Preostali čas:
sv: Tid Kvar:
uk: Залишилося часу:

source: %d day
de: %d Tag
et: %d päev
hr: %d dan
hu: %d nap
it: %d giorno
ja: %d 日
lt: %d diena
lv: %d diena
mk: %д ден
nl: %d dag
pl: %d dzień
pt_br: %d dia
ro: %d zi
ru: %d день
sk: %d dní
sl: %d dni
sv: %d dag
uk: %d день

source: %d hour
de: %d Stunde
et: %d tund
hr: %d sat
hu: %d óra
it: %d ora
ja: %d 時間
lt: %d valanda
lv: %d stunda
mk: %д час
nl: %d uur
pl: %d godzina
pt_br: %d hora
ro: %d oră
ru: %d час
sk: %d hodín
sl: %d ur
sv: %d timme
uk: %d година

source: %d minute
et: %d minut
hr: %d minuta
hu: %d perc
it: %d minuto
ja: %d 分
lt: %d minutė
lv: %d minūte
mk: %д минута
nl: %d minuut
pl: %d minuta
pt_br: %d minuto
ro: %d minut
ru: %d минута
sk: %d minút
sl: %d minut
sv: %d minut
uk: %d хвилина

source: %d second
lt: %d minutė
mk: %д секунда
pt_br: %d segundo
uk: секунда

source: Disconnected
de: Verbindung getrennt
et: Ühendus katkestatud
hr: Veza prekinuta
hu: Lecsatlakozva
it: Disconnesso
ja: 切断されました
lt: Atjungta
lv: Atslēdzies
mk: Дисконектиран
nl: Verbinding verbroken
pl: Rozłączono
pt_br: Você foi desconectado
ro: Deconectat
ru: Отключение
sk: Odpojené
sl: Povezava prekinjena
sv: Nedkopplad
uk: Від'єднання

source: Download error: %s
de: Downloadfehler: %s
et: Alla laadimise viga: %s
hr: Pogreška preuzimanja: %s
hu: Letöltés hiba: %s
it: Errore di download: %s
ja: ダウンロードエラー: %s
lt: Atsisiuntimo klaida: %s
lv: Lejupielādes kļūda: %s
mk: Грешка во симnувањето: %s
nl: Download fout: %s
pl: Błąd pobierania: %s
pt_br: Erro ao baixar: %s
ro: Eroare de descărcare: %s
ru: Ошибка скачивания: %s
sk: Chyba sťahovania: %s
sl: Napaka pri nalaganju: %s
sv: Nedladdningsfel %s
uk: Помилка завантаження: %s
