Repository: multitheftauto/mtasa-blue
Catalog: Shared/data/MTA San Andreas/MTA/locale/*/client.po
Languages: de, et, hr, hu, it, ja, lt, lv, mk, nl, pl, pt_br, ro, ru, sk, sl, sv, uk

source: Do you want to see some on-line help about this problem ?
de: Möchtest du online Hilfe zu diesem Problem bekommen?
et: Kas soovid näha onlain abi selle probleemi kohta ?
hr: Želite li vidjeti online pomoć oko ovog problema ?
hu: Szeretnél néhány online tanácsot kapni erről a hibáról?
it: Vuoi controllare il supporto in linea riguardo a questo problema?
ja: この問題についてにオンラインで調べたいですか？
lt: Ar norite pamatyti šiek tiek pagalbos tinkle apie šia problemą ?
lv: Vai jūs vēlaties atrast kādu tiešsaistes palīdzību saistībā ar šo problēmu ?
mk: Дали сакате да побарате онлајн помош во врска со овој проблем ?
nl: Wilt u online ondersteuning voor dit probleem?
pl: Czy chcesz uzyskać pomoc dla tego problemu w trybie online?
pt_br: Você deseja verificar a página de ajuda on-line sobre este problema?
ro: Doriți să vedeți niște ajutor on-line despre această problemă?
ru: Вы хотите посмотреть онлайн помощь по этой проблеме?
sk: Chceš sa pozrieť na online pomoc o tomto probléme ?
sl: Ali si želite ogledati internetno pomoč o tem problemu?
sv: Vill du se onlinehjälp kring det här problemet ?
uk: Ви хочете переглянути онлайн допомогу з цього питання?

source: No
de: Nein
et: Ei
hr: Ne
hu: Nem
ja: いいえ
lt: Ne
lv: Nē
mk: Не
nl: Nee
pl: Nie
pt_br: Não
ro: Nu
ru: Нет
sk: Nie
sl: Ne
sv: Nej
uk: Ні

source: Yes
de: Ja
et: Jah
hr: Da
hu: Igen
it: Si
ja: はい
lt: Taip
lv: Jā
mk: Да
nl: Ja
pl: Tak
pt_br: Sim
ro: Da
ru: Да
sk: Áno
sl: Da
sv: Ja
uk: Так

source: MTA:SA cannot continue because drive %s does not have enough space.
de: Aktion kann nicht fortgesetzt werden, da nicht genügend freier Speicher auf Laufwerk %s vorhanden ist.
hr: MTA:SA ne može nastaviti jer disk %s nema dovoljno prostora.
hu: MTA:SA nem folytatható, mert a %s meghajtón nincs elég hely.
ja: %sドライブのスペースが不足しています。MTA:SA続行不能
lt: MTA:SA negali tęsti darbo, nes diske %s nepakanka laisvos vietos.
lv: MTA:SA instalācija nevar turpināties, jo %s diskā nav vietas.
mk: MTA:SA неможе да продолжи бидејќи драјверот %s нема доволно место.
nl: MTA:SA kan niet verdergaan omdat schijf %s niet genoeg ruimte heeft.
pl: MTA:SA nie może kontynuować, ponieważ nie ma wystarczającej ilości wolnego miejsca na dysku %s.
pt_br: O MTA:SA não pôde continuar com a instalação porque o disco %s não possui espaço suficiente.
ro: MTA:SA nu poate continua deoarece partiţia %s nu are destul spaţiu.
ru: Для уставновки MTA:SA не хватает свободного места на диске %s.
uk: Для інсталяції MTA:SA бракує вільного місця на диску %s.

source: Fatal error
de: Fataler Fehler
et: Tõsine viga
hr: Ozbiljna greška
hu: Végzetes hiba
it: Errore fatale
ja: 致命的なエラー
lt: Kritinė klaida
lv: Fatāla kļūda
mk: Опасна грешка
nl: Fatale fout
pl: Błąd krytyczny
pt_br: Erro fatal
ro: Eroare fatală
ru: Критическая ошибка
sk: Fatálna chyba
sl: Usodna napaka
sv: Allvarligt fel
uk: Фатальна помилка

source: TO FIX, REMOVE THIS FILE:
hu: A helyreállításhoz töröld ezt a fájlt:
lt: KAD PATAISYTI, PAŠALINKITE FAILĄ:
mk: ЗА ДА СЕ ПОПРАВИ, ИЗБРИШЕТЕ ГО ОВОЈ ФАЈЛ:
pt_br: PARA CORRIGIR, REMOVA ESTE ARQUIVO:
ru: ДЛЯ ИСПРАВЛЕНИЯ УДАЛИТЕ ФАЙЛ:
uk: ЩОБ ВИПРАВИТИ, ВИЛУЧІТЬ ЦЕЙ ФАЙЛ:

source: %s module is incorrect!
de: Modul %s ist fehlerhaft!
et: %s moodul on ebasobiv!
hr: Modul %s je neispravan!
hu: %s modul hibás!
it: Il modulo %s non è corretto!
ja: %s モジュールは正しくありません！
lt: %s modulis yra neteisingas!
lv: %s modulis ir nepareizs!
mk: %s моделот е неточен!
nl: %s module is niet correct!
pl: Moduł %s jest nieprawidłowy!
pt_br: O módulo %s está incorreto!
ro: Modulul %s este incorect!
ru: Модуль %s некорректен!
sk: %s modul je neplatný!
sl: %s modul je napačen!
sv: %s modul är inkorrekt!
uk: Модуль %s хибний!

source: Error executing URL
de: Fehler beim Ausführen der URL
et: Viga URL-i avamisel
hr: Pogreška tijekom izvršavanja URL-a
hu: Hiba történt az URL megnyitásakor
it: Errore durante l'esecuzione dell'URL
ja: URL実行エラー
lt: Klaida vykdant URL
lv: Kļūda izpildot URL
mk: Грешно извршување URL
nl: Fout bij uitvoeren van URL
pl: Błąd podczas wykonywania adresu URL
pt_br: Erro ao abrir a URL
ro: Eroare la executarea URL-ului
ru: Ошибка выполнения URL
sk: Chyba pri otváraní URL
sl: Napaka pri izvrševanju internetnega naslova
sv: Fel vid körning av URL
uk: Помилка виконання URL

source: Error running mod specified in command line ('%s')
de: Fehler beim Starten des Mods, welcher in der Parameterzeile übergeben wurde ('%s')
et: Viga modifikatsiooni jooksutamises, mis oli edastatud käsus ('%s')
hr: Pogreška tijekom rada modifikacije navedene u naredbenom retku ('%s')
hu: Hiba a módban, az alábbi parancssorban ('%s')
it: Errore durante l'esecuzione della mod specificata nella linea di comando ('%s')
ja: 実行中のMODの具体的なエラーはコマンドラインにあります ('%s')
lt: Klaida veikiant modifikacijai nurodytoje komandos eilutėje ('%s')
lv: Kļūda darbinot modifikāciju, kura norādīta komandrindā ('%s')
mk: Погрешен мод наведен во комадната линија ('%s')
nl: Fout bij het starten van de mod in opdrachtprompt ('%s')
pl: Nie udało się uruchomić modyfikacji podanej w parametrze uruchomieniowym ('%s')
pt_br: Erro ao executar o mod especificado na linha de comando ('%s')
ro: Eroare la rularea modului specificat în comandă ('%s')
ru: Ошибка запуска мода, определенного в командной строке ('%s')
sk: Chybne spustený mód špecifikovaný v príkazovom riadku ('%s')
sl: Napaka pri teku modifikacije je določena v ukazni vrstici ('%s')
sv: Fel vid körning av modifikation angiven i kommandoraden ('%s')
uk: Помилка запуску мода, визначеного в командному рядку ('%s')

source: this help screen
de: Diese Ausgabe
et: see abi leht
hr: ovaj pomoćni zaslon
hu: segítség
it: questa schermata d'aiuto
ja: このヘルプ画面
lt: šis pagalbos ekranas
lv: šis palīdzības ekrāns
mk: ова помошно прозорче
nl: Dit hulpscherm tonen
pl: ten ekran pomocy
pt_br: mostra esta mensagem de ajuda
ro: acest ecran de ajutor
ru: эта страница помощи
sk: táto pomocná obrazovka
sl: ta stran z navodili
sv: denna hjälpsida
uk: ця сторінка допомоги

source: exits the application
de: Beendet die Anwendung
et: sulgeb rakenduse
hr: izlazi iz aplikacije
hu: kilépés az alkalmazásból
it: esci dall'applicazione
ja: アプリケーションを終了
lt: išjungia programą
lv: iziet no aplikācijas
mk: напуштање на апликацијата
nl: de applicatie afstuiten
pl: wyłącza grę
pt_br: fecha o MTA
ro: iese din aplicație
ru: выйти из приложения
sk: ukončí aplikáciu
sl: Končaj aplikacijo
sv: avslutar applikationen
uk: вийти із застосунку

source: shows the version
de: Gibt die Version aus
et: näitab versiooni
hr: pokazuje verziju
hu: verzió mutatása
it: mostra la versione
ja: バージョンを表示
lt: rodo versiją
lv: uzrāda versiju
mk: прикажување на верзијата
nl: toont de versie
pl: pokazuje numer wersji
pt_br: mostra a versão
ro: arată versiunea
ru: показать версию MTA
sk: zobrazí verziu
sl: prikaže različico
sv: visar versionen
uk: показати версію MTA

source: shows the time
de: Gibt die Zeit aus
et: näitab aega
hr: prikazuje vrijeme
hu: idő mutatása
it: mostra l'ora
ja: 時間を表示
lt: rodo laiką
lv: uzrāda laiku
mk: прикажување на времето
nl: toont de tijd
pl: pokazuje bieżący czas
pt_br: mostra o horário
ro: arată timpul
ru: показать текущее время
sk: zobrazí čas
sl: prikaže čas
sv: visar tiden
uk: показати поточний час

source: shows the hud
de: Zeigt alle HUD Komponenten
et: näitab displeid
hr: prikazuje hud
hu: hud mutatása
it: mostra l'hud
ja: HUDを表示
lt: rodo vartotojo sąsają
lv: uzrāda hud
mk: прикажување на HUD
nl: toont de hud
pl: pokazuje interfejs użytkownika
pt_br: habilita o hud
ro: arată HUD-ul
ru: показать интерфейс игрока
sk: zobrazí hud
sl: pokaže hud
sv: visar hud
uk: показати інтерфейс гравця

source: shows all the binds
de: Gibt alle Tastenbelegungen aus
et: näitab kõiki binde
hr: prikazuje sve kontrole
hu: bindek mutatása
it: mostra tutte le associazioni
ja: すべての割り当てを表示
lt: rodo visus mygtukų priskirimus
lv: uzrāda visas saistības
mk: прикажување на сите сврзувања
nl: toont alle besturingselementen
pl: wyświetla wszystkie bindy
pt_br: mostra todos os comandos vinculados
ro: arată toate legăturile
ru: показать все настройки клавиш
sl: pokaže vse bližnjice
sv: visar alla bindningar
uk: показати всі налаштування клавіш

source: shows your serial
de: Zeigt deine Serial an
et: näitab sinu seriali
hr: prikazuje tvoj serijski broj
hu: serial mutatása
it: mostra il tuo seriale
ja: シリアル番号を表示する
lt: rodo jūsų serijinį numerį
lv: uzrāda jūsu seriālu
mk: го покажува твојот сериски број
nl: toont jou seriecode
pl: pokazuje Twój numer seryjny
pt_br: mostra o seu serial
ro: arată serialul tău
ru: показать ваш серийный номер
sk: zobrazí tvoj serial
sl: prikaže vašo serijsko številko
sv: visar ditt serienummer
uk: показати ваш серійний номер

source: connects to a server (host port nick pass)
de: Verbindet zu einem Server (host port nick pass)
et: ühendab serveriga (ip port mängunimi salasõna)
hr: spaja se na server (poslužitelj port nadimak lozinka)
hu: kapcsolódás a szerverre (hoszt port felhasználónév jelszó)
it: connette a un server (host porta nome password)
ja: サーバーに接続する (ホスト ポート ニックネーム パスワード)
lt: jungiasi į serverį (adresas portas slapyvardis slaptažodis)
lv: savienojās ar serveri (hosts pors segvārds parole)
mk: се конектира на серверот (хост порта ник пасворд)
nl: verbind naar een server (host port nick wachtwoord)
pl: łączy z serwerem (host port nick hasło)
pt_br: conecta a um servidor (IP porta nick senha)
ro: te conectează la un server (host, port, nume, parolă)
ru: подключиться к серверу (адрес, порт, ник, пароль)
sk: pripojí na server (hostiteľ port nick heslo)
sl: se povezuje s strežnikom (gostitelj vrata ime geslo)
sv: ansluter till en server (host port nick lösen)
uk: під'єднатися до сервера (адрес, порт, нік, пароль)

source: connects to a previous server
de: Verbindet zum vorherigen Server
et: ühendab eelmise serveriga
hr: spaja se na prethodni server
hu: kapcsolódás az előző szerverhez
it: connette a un server precedente
ja: 以前のサーバーに接続する
lt: jungiasi į ankstesnį serverį
lv: savienojās ar iepriekšējo serveri
mk: се конектира на минатион сервер
nl: verbind naar de vorige server
pl: łączy z poprzednim serwerem
pt_br: conecta ao servidor anterior
ro: te conectează la un server precedent
ru: подключиться к последнему посещённому серверу
sk: pripojí k predchádzajúcemu serveru
sl: se povezuje na prejšnji strežnik
sv: ansluter till en föregående server
uk: під'єднатися до останнього відвіданого сервера

source: binds a key (key control)
de: Belegt eine Taste (Tastenbelegung)
et: bindib nupu (nupp)
hr: veže tipku (tipka kontrole)
hu: Egy gomb bebindelése (billentyűzet)
it: associa un tasto (controllo tasto)
ja: キーを割り当てます。(キーコントローラ)
lt: priskiria mygtuką (mygtukas valdiklis)
lv: savieno pogu (pogu kontrole)
mk: сврзување на контрола (контрола)
nl: wijst een toets toe (toets besturing)
pl: tworzy binda (klawisz komenda/czynność)
pt_br: define um comando a partir de uma tecla
ro: atașează o tastă (control de tastă)
ru: назначить клавишу управления
sl: določi tipko kot funkcijo (tipka ukaz)
sv: binder en tangent (tangent kontroll)
uk: призначити клавішу управління

source: unbinds a key (key)
de: Entfernt eine Tastenbelegung (Taste)
et: vabastab nupu bindist (nupp)
hr: odvezuje tipku (tipka)
hu: Egy gomb unbindelése (billentyűzet)
it: dissocia un tasto (tasto)
ja: キー割り当てを削除します。 (キー)
lt: pašalina priskirimą (mygtukas)
lv: atvieno pogu (poga)
mk: одврзување на контрола
nl: verwijdert de toewijzing (toets)
pl: usuwa binda (klawisz)
pt_br: desfaz um comando vinculado a uma tecla
ro: eliberează o tastă (tastă)
ru: удалить задачу с клавиши
sl: zbriše funkcijo na tipki (tipka)
sv: friar en tangent (tangent)
uk: видалити задачу з клавіші

source: copies the default gta controls
de: Kopiert die Standard GTA Steuerung
et: kopeerib tavalise GTA nupud
hr: kopira zadane GTA kontrole
hu: alap gta irányítási beállítások másolása
it: copia i controlli originali di gta
ja: GTA: San Andreasのデフォルトコントロールをコピー
lt: nukopijuoja numatytuosius gta valdiklius
lv: nokopē noklusējuma gta vadības
mk: се копираат стандарните гта контроли
nl: kopieert de standaard gta besturing
pl: kopiuje ustawienia sterowania z GTA
pt_br: copia os comandos padrões do GTA
ro: atașează controalele implicite din GTA
ru: скопировать настройки из GTA:SA
sk: skopíruje predvolené gta ovládanie
sl: kopira privzete gta nastavitve
sv: kopierar standard gta kontrollerna
uk: скопіювати налаштування з GTA:SA

source: outputs a screenshot
de: gibt ein Bildschirmfoto zurück
et: väljastab pildi mängust
hr: izbacuje fotografiju
hu: kiad egy screenshotot
it: emettere uno screenshot
ja: スクリーンショットを出力する
lt: padaro nuotrauką
lv: izveido ekrānšāviņu
mk: произлегува слика
nl: Geeft een screenshot
pl: wykonuje zrzut ekranu
pt_br: salva uma captura da tela
ro: creează o captură de ecran
ru: сделать скриншот
sk: uloží screenshot
sl: prikaže posnetek zaslona
sv: skapar en skärmdump
uk: зробити знімок екрана

source: immediately saves the config
de: speichert sofort die config
et: salvestab seaded koheselt
hr: odmah sprema konfiguraciju
hu: konfig mentése azonnal
it: salva la configurazione immediatamente
ja: すぐに設定を保存する
lt: nedelsiant išsaugo konfiguraciją
lv: nekavējoties saglabā konfigurāciju
mk: конфигурацијата ќе се зачува веднаш
nl: Slaat de configuratie direct op
pl: wykonuje natychmiastowe zapisanie ustawień
pt_br: salva as configurações imediatamente
ro: salvează configurația imediat
ru: сохранить настройки
sk: okamžite uloží config
sl: takoj shrani konfiguracije
sv: sparar konfigurationen direkt
uk: зберегти налаштування

source: clears the debug view
de: Leert das Debug-Fenster
et: puhastab debug akna
hr: čisti debug pregled
hu: debug chat tisztítás
it: pulisce la visuale di debug
ja: デバッグスクリーンを消す
lt: išvalo derinimo vaizdą
lv: iztīra atkļūdošanās logu
mk: чист дебаг преглед
nl: schakelt het debugscherm uit
pl: czyści okienko debugowania
pt_br: limpa o espaço de debug
ro: curăță ecranul de depanare
ru: очистить окно отладки (debug)
sk: vyčistí debug
sl: počisti pogled odpravljalca napak
sv: rensar felsökningsvyn
uk: почистити вікно зневадження (debug)

source: scrolls the chatbox upwards
de: Scrollt die Chatbox aufwärts
et: kerib chati üles
hr: pomiče čavrljanje nagore
hu: chatbox görgetése felfelé
it: scorre la chatbox verso l'alto
ja: チャットボックスを上にスクロールする
lt: paslenka pokalbį aukštyn
lv: pavirza saraksti uz augšu
mk: скролниго чатот нагоре
nl: scrolt de chatbox omhoog
pl: przesuwa tekst czatu do góry
pt_br: rola o chat para cima
ro: derulează fereastra de chat în sus
ru: прокрутить чат вверх
sk: roluje chatom hore
sl: pomakne klepet navzgor
sv: skrollar chattrutan uppåt
uk: прокрутити чат вгору

source: scrolls the chatbox downwards
de: Scrollt die Chatbox abwärts
et: kerib chati alla
hr: pomiče čavrljanje nadolje
hu: chatbox görgetése lefelé
it: scorre la chatbox verso il basso
ja: チャットボックスを下にスクロールする
lt: paslenka pokalbį žemyn
lv: pavirza saraksti uz leju
mk: скролниго чатот надоле
nl: scrolt de chatbox omlaag
pl: przesuwa tekst czatu do dołu
pt_br: rola o chat para baixo
ro: derulează fereastra de chat în jos
ru: прокрутить чат вниз
sk: roluje chatom dole
sl: pomakne klepet navzdol
sv: skrollar chattrutan nedåt
uk: прокрутити чат вниз

source: scrolls the debug view upwards
de: Scrollt das Debug-Fenster aufwärts
et: kerib debug akent üles
hr: pomiče debug nagore
hu: a debug chat felfelé görgetése
it: scorre la visuale di debug verso l'alto
ja: デバッグを上にスクロールする
lt: paslenka derinimo tekstą aukštyn
lv: pavirza atkļūdošanās skatu uz augšu
mk: скролниго дебаг прегледот нагоре
nl: scrolt het debug zicht omhoog
pl: przesuwa tekst w okienku debugowania do góry
pt_br: rola o painel de depuração para cima
ro: derulează ecranul de depanare în sus
ru: прокрутить окно отладки вверх
sk: roluje debugom hore
sl: pomakne pogled odpravljalca napak navzgor
sv: skrollar felsökningsvyn uppåt
uk: прокрутити вікно зневадження вгору

source: scrolls the debug view downwards
de: Scrollt das Debug-Fenster abwärts
et: kerib debug akent alla
hr: pomiče debug nadolje
hu: a debug chat lefelé görgetése
it: scorre la visuale di debug verso il basso
ja: デバッグを下にスクロールする
lt: paslenka derinimo tekstą žemyn
lv: pavirza atkļūdošanās skatu uz leju
mk: скролниго дебаг прегледот надоле
nl: scrolt het debug zicht omlaag
pl: przesuwa tekst w okienku debugowania do dołu
pt_br: rola o painel de depuração para baixo
ro: derulează ecranul de depanare în jos
ru: прокрутить окно отладки вниз
sk: roluje debugom dole
sl: pomakne pogled odpravljalca napak navzdol
sv: skrollar felsökningsvyn nedåt
uk: прокрутити вікно зневадження вниз

source: shows the memory statistics
de: Zeigt die Speicherstatistik
et: näitab mälu(RAM) statistikat
hr: prikazuje statistike memorije
hu: memória statisztika mutatása
it: mostra le statistiche di memoria
ja: メモリデータを表示
lt: rodo atminties statistikas
lv: uzrāda atmiņas statistiku
mk: прикажување на мемориската статистика
nl: Toont de geheugenstatistieken
pl: pokazuje statystyki pamięci
pt_br: mostra as estatísticas de memória
ro: arată statisticile despre memorie
ru: показать статистику использования памяти
sk: zobrazí štatistiky pamäte
sl: prikaže statistiko spomina
sv: visar minnesstatistik
uk: показати статистику використання пам'яті

source: shows the frame timing graph
de: zeigt das frame timing diagramm
et: näitab kaadrite kohta graafikut
hr: prikazuje okvir vremenskog grafa
hu: frame grafikon mutatása
it: mostra il grafico dei frame
ja: FPSグラフを表示する
lt: rodo kadrų laiko grafiką
lv: uzrāda kadru laikošanas grafiku
mk: прикажување на временската графа
nl: toont de frame tijdsgrafiek
pl: pokazuje wykres czasu klatek
pt_br: mostra um gráfico dos quadros renderizados em relação ao tempo
ro: arată graficul cu timpii cadrului
ru: показать график производительности
sk: zobrazí graf časovania snímkov
sl: prikaže časovni graf okvirja
sv: visar frame timing statistik
uk: показати графік продуктивності

source: Programming
de: Programmierung
et: Programmeerimine
hr: Programiranje
hu: Programozás
it: Programmazione
ja: プログラミング
lt: Programavimas
lv: Programmēšana
mk: Програмирање
nl: Programmeren
pl: Programiści
pt_br: Programação
ro: Programare
ru: Программирование
sk: Programovanie
sl: Programiranje
sv: Programmering
uk: Програмування

source: Contributors
de: Beitragende
et: Panustajad
hr: Doprinositelji
hu: Közreműködők
it: Collaboratori
ja: 寄稿者
lt: Pagalbininkai
lv: Atbalstītāji
mk: Соработници
nl: Bijdragers
pl: Współpracownicy
pt_br: Colaboradores
ro: Contribuitori
ru: Участники
sk: Prispievatelia
sl: Avtorji prispevkov
sv: Medverkande
uk: Учасники

source: Game Design / Scripting
de: Spieldesign / Scripting
et: Mängu disain / Koodimine
hr: Dizajn igre / Skriptanje
hu: Játék Dizájn / Scriptelés
it: Progettazione / Scripting
ja: ゲームデザイン / スクリプティング
lt: Žaidimo Dizainas / Scenarijus
lv: Spēles Dizains / Kodējums
mk: Дизајн на Играта / Скрипти
nl: Spel Ontwerp / Scripting
pl: Twórcy poziomów i skryptów
pt_br: Design / Scripting do Jogo
ro: Design de joc / Scripting
ru: Игровой дизайн / Скриптинг
sk: Herný Design / Scriptovanie
sl: Dizajn igre / Skriptanje
sv: Speldesign / Skriptning
uk: Ігровий дизайн / Скриптинґ

source: Patch contributors
de: Patch Beitragende
et: Patchi koostajad
hr: Doprinositelji zakrpa
hu: Javítás közreműködői
it: Collaboratori per le patch
ja: パッチ協力者
lt: Atnaujinimų autoriai
lv: Ielāpa atbalstītāji
mk: Поврзани соработници
nl: Patch bijdragers
pl: Twórcy łatek
pt_br: Contribuidores de Patch
ro: Contribuitori cu patchuri
ru: Авторы исправлений
sk: Patch prispievatelia
sl: Avtorji popravka
sv: Programfixbidragare
uk: Автори виправлень

source: Language Localization
de: Sprachlokalisierung
et: Keel lokaliseerimine
hr: Lokalizacija jezika
hu: Honosítás
it: localizzazione lingua
ja: 言語ローカリゼーション
lt: Kalbos Plėtra
lv: Valodas Lokalizācija
mk: Локација на Јазикот
nl: Taal Lokaliseren
pl: Tłumacze
pt_br: Tradutores
ro: Localizare limbă
ru: Язык
sk: Jazyková lokalizácia
sl: Prevod
sv: Språklokalisering
uk: Мова

source: Special Thanks
de: Besonderen Dank an
et: Eriline tänu
hr: Posebne zahvale
hu: Külön köszönet:
it: Ringraziamenti particolari
ja: スペシャルサンクス
lt: Ypatinga padėka
lv: Īpašas Pateicības
mk: Специјално Заблагодарување
nl: Met bijzondere dank aan
pl: Specjalne podziękowania dla
pt_br: Agradecimentos especiais
ro: Mulțumiri speciale
ru: Отдельная благодарность
sk: Špeciálne poďakovanie
sl: Prevod
sv: Stort tack till
uk: Особлива подяка

source: This software makes use of the following libraries and software:
de: Diese Software nutzt folgende Bibliotheken und Software:
et: See tarkvara kasutab järgmisi kogusi ja tarkvarasi:
hr: Ovaj program upotrebljava slijedeće biblioteke i programe:
hu: Ez a szoftver a következő könyvtárakat és szoftvereket használja:
it: Questo software fa utilizzo delle seguenti librerie e software:
ja: このソフトウェアが下記のライブラリやソフトウェアを利用しています:
lt: Ši programinė įranga panaudoja sekančias bibliotekas ir programines įrangas:
lv: Šī programmatūra liek mums sekot bibliotēkām un programmatūrām:
mk: Овој софтвер се употребува од следните софтвери:
nl: Deze software maakt gebruik van de volgende bibliotheken en software:
pl: To oprogramowanie korzysta z poniższych bibliotek i technologii:
pt_br: Este programa utiliza as seguintes livrarias e complementos:
ro: Acest software se folosește de următoarele:
ru: Данное программное обеспечение использует следующие библиотеки и ПО:
sk: Tento software používa nasledujúce knižnice a software:
sl: Ta programska oprema omogoča uporabo naslednjih knjižnic in programske opreme:
sv: Denna programvara använder följande bibliotek och programvara:
uk: Це програмне забезпечення використовує такі бібліотеки та ПЗ:

source: The skin you selected could not be loaded, and the default skin also could not be loaded, please reinstall MTA.
de: Der ausgewählte Skin konnte nicht geladen werden und der Standardskin konnte ebenfalls nicht geladen werden. Bitte installiere MTA neu.
et: Valitud välimust pole võimalik laadida, ka tavalist välimust ei suudetud laadida. Palun installi MTA uuesti.
hr: Model kojeg ste izabrali nije se mogao učitati, te se također zadani model nije mogao učitati, molimo ponovno instalirajte MTA.
hu: A kinézet amit választottál nem betölthető, és az alap kinézet sem tölthető be, kérlek telepítsd újra az MTA-t.
it: La skin che hai selezionato e la skin di defalut non possono essere caricate, per favore reinstalla MTA.
ja: 選択したスキンをロードできませんでした。また、デフォルトのスキンもロードできませんでした。MTAを再インストールしてください。
lt: Nepavyko įkelti jūsų pasirinktos išvaizdos bei numatytosios išvaizdos, prašome įdiegti MTA iš naujo.
lv: Motīvs, kuru Jūs izvēlējaties, nav iespējams ielādēt un sākotnējo motīvu arī nevar ielādēt, lūdzu pārinstalējiet MTA.
mk: Скинот што го одбравте неможе се да се прикаже, исто така и стандарниот неможе се да прикаже, ве молиме ре-инсталирајте ја MTA.
nl: Het gekozen thema kon niet geladen worden, en het standaard uiterlijk kon ook niet geladen worden, gelieve MTA te herinstalleren.
pl: Nie udało się załadować ustawionej skórki, a skórka domyślna nie jest dostępna. Proszę zainstalować ponownie MTA.
pt_br: O tema que você selecionou, inclusive o padrão, não puderam ser carregados. Por favor, reinstale o MTA.
ro: Tema selectată de tine nu a putut fi încărcată, iar tema implicită nu a putut fi nici ea încărcată, te rugăm reinstalează MTA.
ru: Выбранная вами графическая тема не может быть загружена, тема по-умолчанию также не может быть загружена, переустановите MTA для решения проблемы.
sk: Vybraný skin nemôže byť načítaný ako aj predvolený skin, prosím preinštaluj MTA.
sl: Preobleka, ki ste jo izbrali, ni bilo mogoče naložiti, tudi privzete preobleke ni bilo mogoče naložiti, prosimo, da ponovno namestite MTA.
sv: Spelarmodellen du valde kunde inte laddas, och standardmodellen kunde inte heller laddas, var god installera om MTA.
uk: Обрана вами графічна тема не може бути завантажена, тема за замовчуванням також не може бути завантажена, перевстановіть MTA для вирішення проблеми.
