Repository: multitheftauto/mtasa-blue
Catalog: Shared/data/MTA San Andreas/MTA/locale/*/client.po
Languages: de, et, hr, hu, it, ja, lt, lv, mk, nl, pl, pt_br, ro, ru, sk, sl, sv, uk

source: Requesting master server list (%lu ms elapsed)
de: Master-Server wird abgefragt (%lu ms vergangen)
et: Nõuan peaserveri listi (%lu ms läbitud)
hr: Zahtijevanje glavne liste svih poslužitelja (proteklo %lu ms)
hu: Mester szerver lista lekérdezése (%lu ms eltelt)
it: Richiedendo la lista del master server (%lu ms elapsed)
ja: マスターリストをリクエストしています。(%lu ms 過ぎました。)
lt: Laukiamas pirminis serverių sąrašas (praėjo %lu ms)
lv: Pieprasa serveru sarakstu (%lu ms pagājušas)
mk: Се бара мастер листа (%lu ms изминал)
nl: Hoofdserver lijst opvragen (%lu ms verstreken)
pl: Pobieranie listy serwerów (upłynęło %lu ms)
pt_br: Esperando fazer o download da lista dos servidores... (Já se passaram %lu ms)
ro: Se încarcă lista cu servere (au trecut %lu ms)
ru: Получение списка серверов (%lu мс прошло)
sk: Požiadavka na hlavný zoznam serverov (%lu ms ubehlo)
sl: Zahtevam glavni seznam strežnikov (%lu ms preteklo)
sv: Begär huvudserverlista (%lu ms förflutet)
uk: Отримання списку серверів (%lu мс пройшло)

source: Master server list could not be parsed.
de: Serverliste konnte nicht verarbeitet werden.
et: Peaserveri listi pole võimalik lugeda.
hr: Glavna lista poslužitelja nije mogla biti analizirana.
hu: A mester szerver lista nem elemezhető.
it: Impossibile analizzare la lista del master server.
ja: マスターサーバーリストが解析できませんでした。
lt: Pirminis serverių sąrašas nepasiekiamas.
lv: Servera sarakstu nespēj parsēt.
mk: Главниот лист на сервер неможе да биде разложен.
nl: Hoofdserver lijst kan niet worden ontcijferd.
pl: Nie udało się odczytać serwerów z głównej listy.
pt_br: A lista de servidores não pôde ser processada.
ro: Lista cu servere nu a putut fi analizată.
ru: Мастер-сервер не отвечает.
sk: Zoznam hlavných serverov nemohol byť načítaný.
sl: Glavnega seznama strežnikov ni bilo mogoče razčleniti.
sv: Huvudserverlistan kunde ej tolkas.
uk: Майстер-сервер не відповідає.

source: Master server list could not be retrieved.
de: Serverliste konnte nicht empfangen werden.
et: Peaserveri listi pole võimalik laadida.
hr: Glavna lista poslužitelja nije mogla biti učitana.
hu: A mester szerver lista nem található.
it: Impossibile recuperare la lista del master server.
ja: マスターサーバーリストが取得できませんでした。
lt: Pirminis serverių sąrašas negautas.
lv: Servera sarakstu nespēj saņemt.
mk: Главната листа на сервери неможе се да биде извадена.
nl: Hoofdserver lijst kan niet worden opgehaald.
pl: Nie udało się pozyskać głównej listy serwerów.
pt_br: A lista de servidores não pôde ser obtida.
ro: Lista cu servere nu a putut fi găsită.
ru: Мастер-сервер не может получить данные.
sk: Zoznam hlavných serverov nemohol byť načítaný.
sl: Glavni seznam strežnikov ni bil najden.
sv: Huvudserverlistan kunde ej hämtas.
uk: Майстер-сервер не може отримати дані.

source: (Backup server list)
de: (Ausweichserverliste)
et: (Tagavara serveri list)
hr: (Rezervna lista poslužitelja)
hu: (Backup szerver lista)
it: (Recupero della lista dei server)
ja: (バックアップサーバーリスト）
lt: (Atsarginių serverių sąrašas)
lv: (Rezerves servera saraksts)
mk: (Резерва листа на сервери)
nl: (Backup server lijst)
pl: (Zapasowa lista serwerów)
pt_br: (Fazendo um backup da lista de servidores)
ro: (Rezervă a listei de servere)
ru: (Резервная копия списка серверов)
sk: (Záložný zoznam serverov)
sl: (Rezervni seznam strežnikov)
sv: (Backupserverlista)
uk: (Резервна копія списку серверів)

source: Cannot bind LAN-broadcast socket
de: LAN-Broadcast-Socket kann nicht gebunden werden
et: Ei suuda siduda LAN-braodcast pesa
hr: Nije moguće povezivanje LAN-broadcast socketa
hu: Nem lehet összekötni: LAN-broadcast socket
it: Impossibile associare un LAN-Broadcast socket
ja: LAN放送ソケットをバインドすることはできませんでした
lt: Neįmanoma pririšti LAN-transliavimo prievado
lv: Nespēj savienot LAN-apraides soketu
mk: Не може се да се сврзе LAN приклучокот
nl: Kan niet verbinden met LAN-uitzending aansluiting
pl: Nie można przypisać socketu dla rozgłaszania w sieci LAN
pt_br: Não foi possível se conectar ao soquete da 'LAN-broadcast'
ro: Nu se poate atașa socketul LAN-broadcast
ru: Не удалось привязать локальный сокет
sl: Ne morem vezati LAN-broadcast vtičnice
sv: Kan ej binda LAN-sändnings socket
uk: Не вдалося прив'язати локальний сокет

source: Attempting to discover LAN servers
de: LAN wird nach Servern durchsucht
et: Proovin avastada LAN servereid
hr: Pokušavanje otkrivanja LAN poslužitelja
hu: Kísérlet a LAN szerverek felfedézésre
it: Tentativo di ricercare i server LAN
ja: LANサーバーを検索中
lt: Bandoma surasti LAN serverius
lv: Mēģina atklāt LAN serverus
mk: Се обидува да истражи LAN сервери.
nl: Probeert LAN servers te vinden
pl: Próba odnalezienia serwerów w sieci LAN
pt_br: Procurando servidores locais...
ro: Se încearcă descoperirea serverelor LAN
ru: Попытка обнаружения локальных серверов
sk: Pokúšam sa nájsť LAN servery
sl: Poskušam odkriti LAN strežnike
sv: Försöker hitta LAN servrar
uk: Спроба виявлення локальних серверів

source: Can't find valid screen resolution.
de: Konnte keine gültigen Bildschirmauflösungen finden.
hr: Nije moguće pronaći ispravnu rezoluciju zaslona.
hu: Nem található érvényes képernyőfelbontás.
ja: 有効な解像度が見つかりませんでした。
lt: Nepavyksta rasti tinkamos ekrano raiškos.
lv: Nevar atrast derīgu ekrāna izšķirtspēju.
mk: Не можам да најдам валидна резолуција за екранот>
nl: Kan geen geschikte schermresolutie vinden.
pl: Nie można znaleźć prawidłowej rozdzielczości ekranu.
pt_br: Não foi possível encontrar uma resolução válida.
ro: Nu se poate găsi o rezoluţie validă a ecranului.
ru: Невозможно подобрать подходящее разрешение экрана.
uk: Неможливо підібрати відповідну роздільність дисплея.

source: Are you sure you want to use this screen resolution?
de: Bist du dir sicher, dass du diese Bildschirmauflösungen verwenden willst?
hr: Jeste li sigurni da želite koristiti ovu rezoluciju zaslona?
hu: Biztos benne, hogy szeretné használni ezt a képernyő felbontását?
ja: 本当にこの解像度を使いますか。
lt: Ar tikrai norite naudoti šią ekrano raišką?
lv: Vai jūs esat pārliecināts, ka vēlaties izmantot šo izšķirtspēju?
mk: Дали сте сигурни дека сакате да ја употребувате оваа резолуција на екранот?
nl: Bent u zeker dat u deze schermresolutie wilt gebruiken?
pl: Czy na pewno chcesz użyć tej rozdzielczości ekranu?
pt_br: Você tem certeza que deseja usar essa resolução?
ro: Eşti sigur că vrei să foloseşti această rezoluţie?
ru: Вы уверены, что хотите использовать это разрешение экрана?
uk: Ви впевнені, що хочете використовувати цю роздільність дисплея?

source: Update Aero setting
de: Aeroeinstellung aktualisieren
et: Uuenda Aero seadeid
hr: Nadogradi Aero postavku
hu: Aero beállítás frissítés
it: Aggiornamento delle impostazioni Aero
ja: Aeroセッティングアップデート
lt: Atnaujinti Aero nustatymą
lv: Atjaunot Aero uzstādījumus
mk: Ажурирање на Аеро опции
nl: Installatie-instellingen vernieuwen
pl: Zmień ustawienie Aero
pt_br: Atualizar configuração do Aero
ro: Actualizează setarea Aero
ru: Обновление Aero настроек
sk: Aktualizovať Aero nastavenie
sl: Posodobi Aero nastavitev
sv: Uppdatera Aero-inställning
uk: Оновлення Aero налаштувань

source: Update Large Memory setting
de: Erneuere Large-Memory-Einstellung
et: Uuenda koguka mälu seadeid
hr: Nadogradi Veliku postavku Memorije
hu: Nagy Memória beállítás frissítés
it: Aggiornamento impostazioni di larga memoria
ja: ラージメモリセッティングアップデート
lt: Atnaujinti Didelės Atminties nustatymą
lv: Atjaunot Lielās Atmiņas uzstādījumus
mk: Ажурирај опции за големи меморија
nl: Grote geheugen instelling vernieuwen
pl: Zmień ustawienie Large Memory
pt_br: Atualizar opção de aumento de memória
ro: Actualizează setarea memoriei largi
ru: Обновление настроек большой памяти
sk: Aktualizovať nastavenia Large Memory
sl: Posodobi nastavitev velikega pomnilnika
sv: Uppdatera Large Memory-inställning
uk: Оновлення налаштувань великої пам'яті

source: Update DEP setting
de: DEP-Einstellung aktualisieren
hr: Ažuriraj DEP postavku
hu: DEP beállítás frissítés
ja: DEP設定アップデート
lt: Atnaujinti DEP nustatymą
lv: Atjaunināt DEP iestatījumus
mk: Ажурирање на DEP опции
nl: DEP instellingen vernieuwen
pl: Zmień ustawienie funkcji DEP
pt_br: Atualizar configurações de DEP (Prevenção de Execução de Dados)
ro: Actualizează setarea DEP
ru: Обновление настроек DEP
uk: Оновлення налаштувань DEP

source: Update graphics driver compliance
de: Aktualisiere Konformität des Grafiktreibers
hr: Ažuriraj grafički driver
hu: Grafikus driver teljesítése frissítés
ja: グラフィックドライバの準拠をアップデートする
lt: Atnaujinti grafikos tvarkykles
lv: Atjaunināt grafikas draivera sadarbību
mk: Ажурирање на графички драјвер
nl: Overeenstemming grafisch stuurprogramma vernieuwen
pl: Zmieć zgodność sterownika karty graficznej
pt_br: Atualizar assistência do driver da placa de vídeo
ro: Actualizează conformitatea driverului grafic
ru: Обновите ваш видео-драйвер.
uk: Оновіть ваш відео-драйвер.

source: Fix file issues
de: Behebe Dateifehler
hr: Popravi probleme datoteka
hu: Fájlproblémák fixálása
ja: ファイル問題を修理する
lt: Sutvarkyti failų problemas
lv: Atkļūdot failus
mk: Поправка на проблем во фајлот
nl: Bestandsprobleem oplossen
pl: Napraw błędy plików
pt_br: Corrigir problemas nos arquivos
ro: Repară problemele fișierelor
ru: Исправить проблемы с файлом
uk: Виправити проблеми з файлом

source: Copy main executable to avoid graphic driver issues
de: Kopieren des Hautprogramms, um Probleme mit dem Grafiktreiber zu vermeiden
hr: Kopiraj glavnu izvršnu datoteku kako bi se izbjegli problemi s grafičkim driverom
hu: Fő exe másolása a grafikus driver hibáinak elkerülésére
ja: 実行可能をコピーする。これはグラフィックエラーを防ぐためです
lt: Nukopijuoti pagrindinį exe failą, kad išvengt grafikos tvarkyklių nesklandumų
lv: Kopēt galveno failu lai novērstu grafikas draivera problēmas
mk: Копирање на главниот извршен за да се избегнат проблеми со графичките драјвери
nl: Kopieer de hoofd-executable om problemen met het grafisch stuurprogramma te voorkomen
pl: Skopiuj główny plik wykonywalny aby uniknąć problemów ze sterownikami
pt_br: Copiar o executável do SA para evitar problemas no driver de vídeo
ro: Copiază executabilul principal pentru a evita probleme cu driverul grafic
ru: Скопируйте главный исполняемый файл чтобы избежать проблем с графическим драйвером
uk: Скопіюйте головний виконуваний файл щоб уникнути проблем з графічним драйвером

source: MTA:SA needs Administrator access for the following task: '%s' Please confirm in the next window.
de: MTA:SA benötigt Administratorberechtigungen für die folgende Operation: '%s' Bitte bestätige dies im nächsten Fenster.
et: MTA:SA vajab administraatori õiguseid järgnevaks tegevuseks: '%s' Palun nõustuge järgnevas aknas.
hr: MTA:SA treba dozvolu Administratora za sljedeći zadatak: '%s' Molimo potvrdite u sljedećem prozoru.
hu: MTA:SA-nak rendszergazda jogosultság kell a következő feladathoz: '%s' Kérlek fogadd el a következő ablakban.
it: MTA:SA richiede l'accesso come amministratore per il seguente compito: '%s' Per favore conferma nella prossima finestra.
ja: 下記のタスクをできるようにため、管理者アクセスが必要です: '%s' 次のウインドウで確認してください。
lt: MTA:SA reikalauja Administratoriaus teisių, kad galėtų: '%s' Prašome suteikti teises sekančiame žingsnyje.
lv: MTA:SA ir nepieciešama Administratora piekļuve sekojošam uzdevumam: '%s' Lūdzu apstipriniet nākošajā logā.
mk: MTA:SA бара дозвола за следнава задача: ~~'%s' Ве молиме потврдете во следниов прозор.
nl: MTA:SA heeft Administrator toegang nodig voor de volgende opdracht: '%s' Gelieve te bevestigen in het volgende venster.
pl: MTA:SA potrzebuje praw administratora dla następującej czynności: '%s' Proszę je potwierdzić w następnym oknie.
pt_br: MTA:SA precisa de acesso do administrador para a seguinte tarefa: '%s' Por favor confirme na próxima janela.
ro: MTA:SA necesită acces de administrator pentru următoarea sarcină: '%s' Te rugăm confirmă în fereastra următoare.
ru: MTA:SA нужны права Администратора для следующей задачи: '%s' Пожалуйста, подтвердите в следующем окне.
sk: MTA:SA potrebuje prístup administrátora pre nasledujúcu operáciu: '%s' Prosím potvrď v nasledujúcom okne.
sl: MTA:SA potrebuje dovoljenje administratorja za naslednjo nalogo: '%s' Prosimo potrdite v naslednjem oknu.
sv: MTA:SA behöver administrativa rättigheter för följande uppgift: '%s' Bekräfta i nästa fönster.
uk: MTA:SA потрібні права адміністратора для наступної задачі: '%s' Будь ласка, підтвердіть в наступному вікні.

source: MTA:SA could not complete the following task: '%s'
de: MTA:SA konnte die folgende Operation nicht erfolgreich durchführen: '%s'
et: MTA:SA ei suutnud täita järgnevat käsku: '%s'
hr: MTA:SA nije mogao dovršiti sljedeći zadatak: '%s'
hu: MTA:SA nem tudta befejezni a feladatot: '%s'
it: MTA:SA non può completare il compito seguente: '%s'
ja: MTA:SAは下記のタスクができませんでした: '%s'
lt: MTA:SA negalėjo užbaigti šios užduoties: '%s'
lv: MTA:SA nespēj izpildīt sekojošu uzdevumu: '%s'
mk: MTA:SA неможе се да ја изврши следнава задача: ~ ~ '%s'
nl: MTA:SA kon te volgende opdracht niet afwerken: '%s'
pl: MTA:SA nie mogło wykonać następującej czynności: '%s'
pt_br: MTA:SA não conseguiu completar a seguinte tarefa: '%s'
ro: MTA nu a reușit să termine următoarea sarcină: '%s'
ru: MTA:SA не может выполнить следующую задачу: '%s'
sk: MTA:SA nemôže dokončiť nasledovnú operáciu: '%s'
sl: MTA:SA ne more dokončati naslednje naloge: '%s'
sv: MTA:SA kunde inte slutföra följande uppgift: '%s'
uk: MTA:SA не може виконати наступну задачу: '%s'

source: ** The crash was caused by a graphics driver error ** ** Please update your graphics drivers **
de: ** Der Absturz wurde durch ein Grafiktreiber-Problem verursacht ** ** Bitte bringen Sie Ihre Grafiktreiber auf den aktuellsten Stand **
et: ** Kokkujooksu põhjustas graafika draiverite viga ** ** Palun uuenda oma graafika draivereid **
hr: ** Pad je uzrokovan greškom drivera grafičke kartice ** ** Molimo ažurirajte svoje drivere grafičke kartice **
hu: ** A crash-t a grafikus driver hibája okozta ** ** Kérlek frissítsd a grafikus drivered **
it: **Il blocco è stato causato da un errore del driver grafico** **Per favore aggiorna i tuoi driver grafici**
ja: ＊＊グラフィックドライバの影響でゲームがクラッシュしました＊＊ ＊＊グラフィックドライバをアップデートしてください＊＊
lt: ** Žaidimas lūžo dėl grafikos tvarkyklių klaidos ** ** Prašome atsinaujinti savo grafikos tvarkykles **
lv: ** Avārija notika graphics driver error ** ** Lūdzu atjaunojiet graphics drivers **
mk: ** Прекинот беше поради грешка во графичкиот драјвер ** ** Ве молиме апдејтирајте ги графичките драјвери **
nl: ** De crash werd veroorzaakt door een grafische driver fout ** ** Gelieve uw grafische driver te updaten **
pl: ** Program zawiesił się z powodu błędu w sterowniku karty graficznej ** ** Proszę zaktualizować swoje sterowniki do karty graficznej **
pt_br: ** O travamento foi causado por uma falha no driver de vídeo ** ** Verifique o driver de sua placa de vídeo **
ro: ** Crashul a fost provocat de o eroare a driverului grafic ** ** Te rugăm actualizează-ți driverele grafice **
ru: ** Вылет был вызван ошибкой графического драйвера ** ** Обновите драйвера вашей видеокарты **
sk: ** Pád bol spôsobený chybou grafického ovládača ** ** Aktualizuj prosím svoj grafický ovládač **
sl: ** Sesutje je povzročila napaka na grafičnem gonilniku ** ** Prosimo, posodobite gonilnik vaše grafične kartice **
sv: ** Kraschen orsakades utav problem med grafikdrivrutiner ** ** Var vänlig uppdatera dina grafikdrivrutiner **
uk: ** Виліт був викликаний помилкою графічного драйвера ** ** Оновіть драйвера вашої відеокарти **

source: Install updated MTA:SA files
de: Aktualisierte MTA:SA Dateien installieren
et: Paigalda uuendatud MTA:SA failid
hr: Instaliraj ažurirane MTA:SA fajlove.
hu: Frissített MTA:SA fájlok telepítése
it: Installa i file aggiornati di MTA:SA
ja: アプデートしたMTA:SAファイルをインストールします
lt: Įdiegti atnaujintas MTA:SA bylas
lv: Instalēt atjaunotos MTA:SA failus
mk: Инсталирај ажурирани MTA:SA фајлови
nl: Geüpdatet MTA:SA bestanden installeren
pl: Zainstaluj zaktualizowane pliki MTA:SA
pt_br: A instalação atualizou os arquivos do MTA:SA
ro: Instalează fișierele MTA:SA actualizate
ru: Установка обновлённых MTA:SA файлов
sk: Inštalovať aktualizované MTA:SA súbory
sl: Namestitev je posodobila MTA:SA datoteke
sv: Installera uppdaterade MTA:SA-filer
uk: Інсталяція оновлених MTA:SA файлів

source: Could not update due to file conflicts. Please close other applications and retry
de: Konnte aufgrund von Dateikonflikten nicht aktualisieren. Bitte schließe andere Programme und versuche es erneut
et: Ei suuda uuendada faili konflikti pärast. Palun sulgege teised rakendused ja proovige uuesti
hr: Nemoguće nadograditi zbog sukoba datoteka. Molimo zatvorite ostale aplikacije i pokušajte ponovno
hu: Nem lehet frissíteni egy fájl ütközése miatt. Kérlek zárj be minden egyéb alkalmazást és próbáld újra.
it: Impossibile aggiornare a causa di un conflitto dei file. Per favore chiudi le applicazioni e riprova
ja: ほかのプログラムの影響でアプデートすることができませんでした。他のプログラムを閉じてください
lt: Neįmanoma atnaujinti dėl konflikto bylose. Prašome uždaryti kitas programas ir bandyti iš naujo
lv: Nespēj atjaunot failu konfliktu dēļ. Lūdzu aizveriet citas aplikācijas un atkārtojiet
mk: Не може се да се ажурира поради конфликт со фајловите. Ве молиме затворете ги другите апликации и пробајте одново
nl: Kon niet updaten door bestandsconflicten. Gelieve andere toepassingen te sluiten en opnieuw te proberen
pl: Nie udało się zaktualizować ze względu na konflikt dostępu do plików. Zamknij inne aplikacje i spróbuj ponownie
pt_br: Não foi possível realizar a atualização devido a conflitos entre arquivos. Feche todos os outros programas e tente novamente
ro: Nu s-a putut actualiza datorită conflictelor fișierelor. Te rugăm închide celelalte aplicații și reîncearcă
ru: Невозможно обновиться, так как файлы заняты другими приложениями, закройте их и попробуйте снова
sk: Nemožno aktualizovať kvôli konfliktom súborov. Zatvor prosím ostatné aplikácie a skús to znovu
sl: Ni mogoče posodobiti zaradi konfliktov z datotekami. Prosimo, zaprite ostale aplikacije in poskusite znova
sv: Kunde inte uppdatera på grund av filkonflikter. Var god stäng av andra applikationer och försök igen
uk: Неможливо оновитися, так як файли зайняті іншими додатками, закрийте їх і спробуйте знову

source: Multi Theft Auto has not been installed properly, please reinstall. %s
de: Multi Theft Auto wurde nicht korrekt installiert. Bitte installiere es erneut. %s
et: Multi Theft Auto ei ole paigaldatud korrektselt, palun paigaldage uuesti. %s
hr: Multi Theft Auto nije instaliran prikladno, molimo instalirajte ponovno. %s
hu: Multi Theft Auto nem lett megfelelően telepítve, kérlek telepítsd újra. %s
it: Multi Theft Auto non è stato installato correttamente, per favore installalo nuovamente. %s
ja: MTAは完全にインストールできませんでした。再インストールしてください。 %s
lt: Multi Theft Auto nebuvo tinkamai įrašytas, prašome įdiegti iš naujo. %s
lv: Multi Theft Auto netika uzinstalēts pareizi, lūdzu pārinstalējiet. %s
mk: Multi Theft Auto не е инсталирана правилно, ве молиме ре-инсталирајте ја. %s
nl: Multi Theft Auto werd niet correct geïnstalleerd, gelieve te herinstalleren. %s
pl: Multi Theft Auto nie zostało prawidłowo zainstalowane, proszę zainstalować ponownie. %s
pt_br: O Multi Theft Auto não foi instalado corretamente. Reinstale por favor. %s
ro: Multi Theft Auto nu a fost instalat corespunzător, te rugăm reinstalează-l. %s
ru: Multi Theft Auto установлена неправильно, переустановите. %s
sk: Multi Theft Auto nebolo správne nainštalované, prosím preinštaluj. %s
sl: Multi Theft Auto no bil nameščen pravilno, prosimo, da ponovno namestite. %s
sv: Multi Theft Auto har inte installerats korrekt, var god installera om. %s
uk: Multi Theft Auto інстальовано неправильно, переінсталюйте. %s

source: Missing file:
de: Fehlende Datei:
hr: Nedostaje datoteka:
hu: Hiányzó fájl:
ja: 不足ファイル:
lt: Trūksta failo:
lv: Nevar atrast failu:
mk: Фајл што недостасува:
nl: Ontbrekend bestand:
pl: Brak pliku:
pt_br: Faltando arquivo:
ro: Fișier lipsă:
ru: Не найден файл:
uk: Не знайдено файл:

source: If MTA fails to load, please re-install GTA:SA
de: Wenn MTA nicht gestartet werden kann, installiere bitte GTA:SA neu.
hr: Ako se MTA ne učita, molimo ponovno instalirajte GTA:SA
hu: Ha az MTA nem tud betölteni, telepítse újra a GTA:SA-t
ja: もしMTAがロードを失敗したら、GTA:SAを再インストールをしてください
lt: Jei MTA nepasileidžia, prašome perrašyti GTA:SA
lv: Ja MTA nespēj ieslēgties, lūdzu pārinstalējiet GTA:SA
mk: Ако MTA не успее да вчита, ве молиме ре-инсталирајте ја GTA:SA
nl: Als MTA niet kan starten, gelieve GTA:SA te herinstalleren
pl: Jeśli MTA się nie uruchamia, proszę przeinstalować GTA:SA
pt_br: Se o MTA falhar ao carregar, por favor reinstale o GTA:SA
ro: Dacă MTA nu reușește să se încarce, te rugăm reinstalează GTA:SA
ru: Переустановите GTA:SA, если MTA не запускается
uk: Переінсталюйте GTA:SA, якщо MTA не запускається

source: Update install settings
de: Installationseinstellung aktualisieren
et: Uuenda paigaldamise seadeid
hr: Nadogradi instalacijske postavke
hu: Telepítési beállítások frissítés
it: Aggiorna le impostazioni di installazione
ja: アップデートインストール設定
lt: Atnaujinti diegimo nustatymus
lv: Atjaunot instalācijas uzstādījumus
mk: Ажурирање на опции за инсталирање
nl: Installatie instellingen vernieuwen
pl: Zmień ustawienia instalacji
pt_br: Atualizar as configurações de instalação
ro: Actualizează setările de instalare
ru: Обновление настроек установки
sk: Aktualizovať nastavenia inštalácie
sl: Posodobi namestitveno nastavitev
sv: Uppdatera installationsinställningar
uk: Оновлення налаштувань інсталювань

source: Update compatibility settings
de: Kompatibilitätseinstellungen aktualisieren
hr: Ažuriraj postavke kompatibilnosti
hu: Kompatibilitási beállítások frissítés
ja: 互換性セッティングアップデート
lt: Atnaujinti suderinamumo nustatymus
lv: Atjaunot saderības uzstādījumus
mk: Ажурирање на опции за компатибилност
nl: Compatibiliteitsinstellingen vernieuwen
pl: Zmień ustawienia zgodności
pt_br: Atualizar configurações de compatibilidade
ro: Actualizează setările de compatibilitate
ru: Обновить настройки совместимости
uk: Оновити налаштування сумісності

source: Quit
de: Verlassen
hr: Izlaz
hu: Kilépés
ja: 終了
lt: Išeiti
lv: Iziet
mk: Исклучи
nl: Afsluiten
pl: Zakończ
pt_br: Sair
ro: Ieșire
ru: Выйти
uk: Вийти

source: MTA: San Andreas has encountered a problem
de: MTA:SA hat einen Fehler festgestellt
hr: MTA: San Andreas je naišao na problem
hu: MTA: San Andreas hibát észlelt
ja: MTA: San Andreasは問題が見つかりました
lt: MTA: San Andreas aptiko problemą
lv: MTA: San Andreas radās kļūda
mk: MTA: San Andreas наиде на проблем
pl: MTA: San Andreas napotkało problem
pt_br: MTA: San Andreas encontrou um problema
ro: MTA: San Andreas a întâmpinat o problemă
ru: MTA: San Andreas обнаружила ошибку
uk: MTA: San Andreas виявив помилку

source: Crash information
de: Absturzinformation
hr: Informacije o padu
hu: Crash információ
ja: クラッシュ情報
lt: Lūžio informacija
lv: Avārijas informācija
mk: Информации за исклучувањето
nl: Crash informatie
pl: Informacje o zawieszeniu się programu
pt_br: Informação do erro
ro: Informații crash
ru: Информация об аварийном завершении программы
uk: Інформація про аварійне завершення програми
