Repository: multitheftauto/mtasa-blue
Catalog: Shared/data/MTA San Andreas/MTA/locale/*/client.po
Languages: de, et, hr, hu, it, ja, lt, lv, mk, nl, pl, pt_br, ro, ru, sk, sl, sv, uk

source: Mute Voice sounds when minimized
de: Schaltet die Voice Töne stumm wenn minimiert
et: Vaigista mängijate mikrofoni helid kui mäng on all
hr: Isključi zvukove glasa kada je minimizirano
hu: Némítsa a Beszéd hangokat amikor minimalizálva van
it: Muta la voce quando il suono è minimo
ja: ウインドウを隠す際、声の音をミュートする
lt: Nutildyti šnekančiųjų garsus kol žaidimas nuleistas
lv: Apklusināt Balss skaņas, ja minimizēts
mk: Мутирај гласовен звук кога е минимизирано
nl: Demp stemgeluiden als MTA geminimaliseerd is
pl: Wycisz głos gdy zminimalizowane
pt_br: Silenciar sons da voz ao minimizar
ro: Oprește sunetele voce la minimizare
ru: Заглушить голосовой чат, когда игра свёрнута
sk: Stlmiť zvuky hlasu pri minimalizovaní
sl: Utišaj glasovne zvoke, ko je MTA minimiran
sv: Stäng röstljud i minimerat läge
uk: Заглушити голосовий чат, коли гра згорнута

source: Resolution:
de: Auflösung:
et: Resolutsioon:
hr: Rezolucija:
hu: Felbontás:
it: Risoluzione:
ja: 解像度:
lt: Skiriamoji geba:
lv: Izšķirtspēja:
mk: Резолуција:
nl: Resolutie:
pl: Rozdzielczość:
pt_br: Resolução:
ro: Rezoluție:
ru: Разрешение:
sk: Rozlíšenie:
sl: Ločljivost:
sv: Upplösning:
uk: Дозвіл:

source: Draw Distance:
de: Renderweite:
et: Vaatekaugus:
hr: Udaljenost Slike:
hu: Látóhatár:
it: Distanza di visualizzazione:
ja: レンダリング距離:
lt: Matomumo distancija:
lv: Redzamības Attālums:
mk: Составна Дистанца:
nl: Tekenafstand:
pl: Odległość rysowania:
pt_br: Distância do horizonte:
ro: Distanță de redare:
ru: Дальность прорисовки:
sk: Vykreslovacia vzdialenosť:
sl: Razdalja risanja:
uk: Дальність промальовування:

source: Brightness:
de: Helligkeit:
et: Heledus:
hr: Svjetlina:
hu: Fényerő:
it: Luminosità:
ja: 輝度:
lt: Ryškumas:
lv: Spilgtums:
mk: Светлина:
nl: Helderheid:
pl: Jasność:
pt_br: Brilho:
ro: Luminozitate:
ru: Яркость:
sk: Jas:
sl: Svetlost:
sv: Ljusstyrka:
uk: Яскравість:

source: FX Quality:
de: FX Qualität:
et: FX kvaliteet:
hr: FX Kvaliteta:
hu: FX Minőség:
it: Qualità FX:
ja: FXの質:
lt: Efektų kokybė:
lv: FX Kvalitāte:
mk: FX квалитет:
nl: Beeldkwaliteit:
pl: Jakość efektów graficznych:
pt_br: Qualidade dos efeitos:
ro: Calitate FX:
ru: Качество эффектов:
sk: Kvalita FX:
sl: FX kakovost:
sv: FX Kvalitet:
uk: Якість ефектів:

source: Anisotropic filtering:
de: Anisotropische Filterung:
et: Anisotroopne filtreering:
hr: Anizotropno filtriranje:
hu: Anizotróp szűrés:
it: Filtro anisotropico:
ja: 異方性フィルタリング:
lt: Anisotropic filtravimas:
lv: Anizotropā filtrēšana:
mk: Анизотропски филтер:
nl: Anisotropische filtering:
pl: Filtrowanie anizotropowe:
pt_br: Filtragem anisotrópica:
ro: Modul de filtrare anizotropic:
ru: Анизотропная фильтрация:
sk: Anizotropné filtrovanie:
sl: Anizotropno filtriranje:
sv: Anisotropisk filtrering:
uk: Анізотропна фільтрація:

source: Anti-aliasing:
et: Antialias:
hr: Zaglađivanje rubova:
hu: Élsimítás:
ja: アンチエイリアス:
lv: Anti-aliasingi:
mk: Анти-лаг:
pl: Wygładzanie krawędzi (AA):
ru: Сглаживание:
sk: Vyhladzovanie:
sl: Glajenje robov:
sv: Kantutjämning:
uk: Екранне згладжування:

source: Aspect Ratio:
de: Bildseitenverhältnis:
et: Kuvasuhe:
hr: Omjer prikaza:
hu: Képarány:
it: Rapporto dimensioni:
ja: アスペクト比:
lt: Vaizdo santykis:
lv: Izmēru Attiecība:
mk: Аспект Рејтио:
nl: Beeldverhouding:
pl: Proporcje ekranu:
pt_br: Proporção de tela:
ro: Raport de aspect:
ru: Соотношение сторон:
sk: Pomer strán:
sl: Razmerje slike:
sv: Bildförhållande:
uk: Співвідношення сторін:

source: Windowed
de: Fenstermodus
hr: U prozoru
hu: Ablakos mód
it: In finestra
ja: ウィンドウ
lt: Paleisti lange
lv: Loga režīms
mk: Без рамки
nl: Venstermodus
pl: Tryb okienkowy
pt_br: Modo janela
ro: În fereastră
ru: Оконный режим
sk: V okne
sl: V oknu
sv: Fönster
uk: Віконний режим

source: Fullscreen mode:
de: Vollbildmodus:
et: Täisekraanirežiim:
hr: Preko punog zaslona:
hu: Teljes képernyős mód:
it: Modalità tutto schermo:
ja: フルスクリーンモード:
lt: Pilno ekrano režimas:
lv: Pilnekrāna režīms:
mk: Режим на цел екран:
nl: Volledig scherm:
pl: Tryb pełnoekranowy:
pt_br: Modo em Tela Cheia:
ro: Mod ecran complet:
ru: Полноэкранный режим:
sk: Celá obrazovka:
sl: Celozaslonski način:
sv: Fullskärmsläge:
uk: Повноекранний режим:

source: Standard
hr: Standardno
hu: Alap
it: Normale
ja: 標準
lt: Standartinis
lv: Standarta
mk: Стандардно
nl: Standaard
pl: Standardowy
pt_br: Normal
ru: Стандарт
sk: Štandardné
sl: Navadno
uk: Стандарт

source: Borderless window
de: Randloses Fenster
et: Ilma raamita aken
hr: Prozor bez okvira
hu: Keret nélküli ablak
it: Finestra senza bordi
ja: 枠なしウインドウ
lt: Langas be kraštų
lv: Bez-rāmju logs
mk: Прозорец без рамки
nl: Randloos venster
pl: Okno bez ramki
pt_br: Janela sem bordas
ro: Fereastră fără margini
ru: Окно в рамке
sk: Okno bez okraja
sl: Okno brez okvirja
sv: Kantlöst fönster
uk: Вікно в рамці

source: Borderless keep res
de: Rahmenlos, behalte Auflösung
et: Hoia äärteta resolutsiooni
hr: Rezolucija bez rubova
hu: Ablak keret nélkül
it: Mantenere risoluzione senza bordi
ja: 枠なしウィンドウの解像度を保存する
lt: Be kraštų išlaikant rez.
lv: Bez-rāmju keep res
mk: Резолуција без рамка
nl: Hou de resolutie zonder randen
pl: Bez ramki, ta sama rozdzielczość
pt_br: Manter reso. sem borda
ro: Fără margini păstrează rezoluția
ru: Окно без рамки
sk: S okrajom - zachovať rozlíšenie
sl: Celozaslonski način brez robov
sv: Kantlöst behåll res
uk: Вікно без рамки

source: Mip Mapping
et: Mip kaardistamine
hr: Mip Mapiranje
ja: ミップマッピング
lv: Mip Mappings
mk: Мапирање
nl: Mip Mappen
ru: Детализация
sk: MIP mapovanie
sl: MIP kartiranje
uk: Деталізація

source: Low
de: Niedrig
et: Madal
hr: Nisko
hu: Alacsony
it: Bassa
ja: 低
lt: Žema
lv: Zema
mk: Слабо
nl: Laag
pl: Niska
pt_br: Baixa
ro: Scăzută
ru: Низкое
sk: Nízke
sl: Nizko
sv: Låg
uk: Низьке

source: Medium
de: Mittel
et: Keskmine
hr: Srednje
hu: Közepes
it: Media
ja: 中
lt: Vidutinė
lv: Vidēja
mk: Средно
nl: Gemiddeld
pl: Średnia
pt_br: Média
ro: Medie
ru: Среднее
sk: Stredné
sl: Srednje
uk: Середнє

source: High
de: Hoch
et: Kõrge
hr: Visoko
hu: Magas
it: Alta
ja: 高
lt: Aukšta
lv: Augsta
mk: Високо
nl: Hoog
pl: Wysoka
pt_br: Alta
ro: Ridicată
ru: Высокое
sk: Vysoké
sl: Visoko
sv: Hög
uk: Високе

source: Very high
de: Sehr Hoch
et: Väga kõrge
hr: Vrlo visoko
hu: Nagyon magas
it: Molto alta
ja: 最高
lt: Labai aukšta
lv: Ļoti augsta
mk: Многу високо
nl: Zeer hoog
pl: Bardzo wysoka
pt_br: Muito alta
ro: Foarte ridicată
ru: Очень высокое
sk: Veľmi vysoké
sl: Zelo visoko
sv: Väldigt hög
uk: Дуже високе

source: Off
de: Aus
et: Väljas
hr: Isključeno
hu: Nincs
it: Nessuno
ja: 消す
lt: Išjungta
lv: Izslēgts
mk: Исклучување
nl: Uit
pl: Wyłączone
pt_br: Desligado
ro: Dezactivat
ru: Отключена
sk: Vypnuté
sl: Izklopljeno
sv: Av
uk: Відключена

source: Auto
et: Automaatne
hr: Automatski
hu: Automatikus
it: Automatica
ja: 自動
lv: Automātiski
mk: Автоматски
nl: Automatisch
pl: Automatyczne
pt_br: Automático
ro: Automat
ru: Авто
sl: Samodejno
sv: Automatisk
uk: Авто

source: HUD Match Aspect Ratio
de: HUD dem Bildschirmverhältnis anpassen
hr: HUD rejting prilagodbe
hu: HUD Match arány
ja: HUDアスペクト比
lt: HUD santykis su ekranu
lv: HUD Savietošana ar malu attiecību
mk: HUD-от се вклопува
nl: HUD beeldverhouding koppelen
pl: Dopasuj HUD do proporcji ekranu
pt_br: Ajustar HUD
ro: Potrivește HUD-ul cu raportul de aspect
ru: Размер HUD под соотношение
uk: Розмір HUD під співвідношення

source: Volumetric Shadows
de: Volumetrische Schatten
et: Volumeetrilised varjud
hr: Volumetrične sjene
hu: Volumetrikus Árnyékok
it: Ombre volumetriche
ja: 体積影
lt: Volumetriniai Šešėliai
lv: Volumetriskas Ēnas
mk: Волуметриски Сенки
nl: Volumetrische Schaduwen
pl: Cienie objętościowe
pt_br: Sombras volumétricas
ro: Umbre volumetrice
ru: Динамические тени
sk: Odmerné tiene
sl: Prostorninsko senčenje
sv: Volymetriska skuggor
uk: Динамічні тіні

source: Grass effect
de: Graseffekte
et: Muru efekt
hr: Efekt trave
hu: Fű effekt
it: Effetto erba
ja: グラスFX
lt: Žolės efektas
lv: Zāles efekts
mk: Ефект на трева
nl: Gras effecten
pl: Efekty traw
pt_br: Detalhes na grama
ro: Efect iarbă
ru: Улучшенная трава
sk: Efekt trávy
sl: Učinek trave
sv: Gräseffekt
uk: Покращена трава

source: Heat haze
de: Hitzeschleier
et: Soojus laine
hr: Toplinska magla
hu: Hőség effekt
it: Foschia calore
ja: 陽炎
lt: Karščio bangelės
lv: Siltuma tveice
mk: Магловита топлина
nl: Hittewaas
pl: Mgła cieplna
pt_br: Ondas de calor
ro: Efect căldură
ru: Эффект жары
sk: Oparený vzduch
sl: Toplotna megla
sv: Soldis
uk: Ефект спеки

source: Tyre Smoke etc
de: Rauchende Reifen etc
hr: Dim guma itd
hu: Gumi füstölés stb.
ja: タイヤの煙など
lt: Padangų dūmai ir t.t.
lv: Riepu dūmi utml
mk: Гумо Чад итн
nl: Rokende banden enz.
pl: Dymiące opony itd.
pt_br: Fumaça dos pneus, etc.
ro: Fum roți
ru: Дым шин и т.д.
uk: Дим шин, тощо

source: Render vehicles always in high detail
hu: Jármű renderelés magas felbontáson
lt: Visada vaizduoti transporto priemones aukščiausia raiška
mk: Рендирање на возилата секогаш детални
pt_br: Renderizar veículos sempre em alto detalhe

source: Full Screen Minimize
de: Minimieren bei Vollbild erlauben
et: Täisekraanirežiimi allapanek
hr: Minimiziraj Puni Zaslon
hu: Gumi füstölés stb.
it: Minimizza schermo intero
ja: フルスクリーン最小化
lt: Pilnas Lango Nuleidimas
lv: Pilnekrāna Minimizēšana
mk: Целосно Минимизирање
nl: Volledig Scherm Minimaliseren
pl: Minimalizowanie pełnoekranowe
pt_br: Minimizar modo de Tela Cheia
ro: Minimizare ecran întreg
ru: Во весь экран (свернуть)
sk: Minimalizovať režim celej obrazovky
sl: Minimiraj v celozaslonskem načinu
sv: Fullskärmsminimera
uk: Повноекранний режим (згорнути)

source: Enable Device Selection Dialog
de: Monitorauswahldialog aktivieren
et: Võimalda seadme valiku dialoog
hr: Omogući prozor za odabir uređaja
hu: Párbeszédablak engedélyezése
it: Abilità la finestra di selezione del dispositivo
ja: デバイス選択ダイアログを有効にする
lt: Įjungti Prietaisų Pasirinkimo Dialogą
lv: Iespējot Ierīces Izvēles Dialogu
mk: Дозволи уред за селекција на диалог
nl: Zet Het Apparaten Dialoogvenster Aan
pl: Włącz okno wyboru urządzenia
pt_br: Este ativa a janela para escolher a placa-de-vídeo
ro: Activează dialogul de selectare a dispozitivelor
ru: Включить диалог выбора устройства
sk: Povoliť dialóg Zvolenia zariadenia
sl: Omogoči pogovorno okno za izbor naprave
sv: Aktivera enhetsväljardialogen
uk: Увімкнути діалог вибору пристрою

source: Show unsafe resolutions
de: Zeige unsichere Auflösungen
hr: Pokaži nesigurne rezolucije
hu: Nem biztonságos felbontások mutatása
ja: 不安全な解像度を表示
lt: Rodyti netinkamas ekrano raiškas
lv: Parādīt nedrošas izšķirtspējas
mk: Прикажи ги небезбедните резолуции
nl: Toon onveilige resoluties
pl: Pokaż niezgodne rozdzielczości
pt_br: Mostrar resoluções não seguras
ro: Afişează rezoluţii nesigure
ru: Показывать неподдерживаемые разрешения
uk: Показати не підтримну роздільність

source: Enable remote websites
de: Externe Webseiten aktivieren
hr: Omogući udaljene web stranice
hu: Távoli weboldalak engedélyezése
ja: リモートウェブサイトを有効する
lt: Naudoti nutolusius tinklalapius
lv: Atļaut attālas mājaslapas
mk: Вклучете вебсајти
pl: Zezwalaj na strony zewnętrzne
pt_br: Habilitar websites remotos
ru: Разрешить сторонние сайты
uk: Дозволити сторонні веб-сайти

source: Enable Javascript on remote websites
de: Javascript auf externen Webseiten
hr: Omogući Javascript na udaljenim web stranicama
hu: Javascript engedélyezése távoli weboldalakon
ja: リモートサイトにJavascriptを有効する
lt: Naudoti Javascript nutolusiuose tinklalapiuose
mk: Вклучете јава скрипти на далечински вебсајти
pl: Zezwalaj na Javascript na stronach zewnętznych
pt_br: Permitir o uso de Javascript em websites remotos
ru: Разрешить Javascript на сторонних сайтах
uk: Дозволити Javascript на сторонніх веб-сайтах

source: Custom blacklist
de: Eigene Blackliste
hr: Blokirano po izboru
hu: Egyéni feketelista
ja: カスタムブラックリスト
lt: Juodasis sąrašas
mk: Црна листа
pl: Blokuj te strony (blacklist)
pt_br: Lista negra
ru: Чёрный список
uk: Чорний список

source: Enter a domain e.g. google.com
de: Bitte eine Domain eingeben
hr: Unesi domenu npr. google.com
hu: Üss be egy domaint, pl. : google.com
ja: ドメインを入力してください（例：google.com）
lt: Įveskite puslapį pvz. google.com
lv: Ievadīt jebkādu domēmu, piem. google.com
mk: Внесете домејн како на пример google.com
pl: Wpisz domenę, np. google.com
pt_br: Digite um domínio ex. google.com
ru: Введите домен, например google.com
uk: Введіть домен, наприклад google.com

source: Block
de: Blockieren
hr: Blokiraj
hu: Tiltás
ja: ブロック
lt: Blokuoti
lv: Bloķēt
mk: Блок
pl: Blokuj
pt_br: Bloquear
ru: Блокировать
uk: Блокувати

source: Domain
hr: Domena
ja: ドメイン
lt: Puslapis
lv: Domēns
mk: Домен
pl: Domena
pt_br: Domínio
ru: Адрес
uk: Адреса

source: Remove domain
de: Domain entfernen
hr: Ukloni domenu
hu: Domain törlése
ja: ドメインを消す
lt: Panaikinti puslapį
mk: Отстрани домен
pl: Usuń domenę
pt_br: Remover domínio
ru: Удалить адрес
uk: Видалити адресу

source: Custom whitelist
de: Eigene Whiteliste
hr: Dopušteno po izboru
hu: Egyéni fehérlista
ja: カスタムホワイトリスト
lt: Baltasis sąrašas
lv: Slēgtais saraksts
mk: Бела листа
pl: Zezwalaj na te strony (whitelist)
pt_br: Lista branca
ru: Разрешённый список
uk: Дозволений список

source: Misc
de: Sonstiges
et: Muu
hr: Razno
hu: Egyéb
it: Varie
ja: その他
lt: Kita
lv: Dažādi
mk: Разно
nl: Overig
pl: Różne
pt_br: Configurações avançadas
ro: Diverse
ru: Разное
sk: Rôzne
sl: Razno
sv: Blandat
uk: Різне

source: Fast CJ clothes loading:
de: Schnelles Laden von CJ Kleidung:
et: Kiire CJ riiete laadimine:
hr: Brzo učitavanje CJ-eve odjeće:
hu: Gyors CJ ruházat töltés:
it: Caricamento rapido dei vestiti di CJ:
ja: CJの服を高速読み込み:
lt: Greitas CJ rūbų krovimas:
lv: Ātrā CJ apģērbu ielādēšana:
mk: Брзи СЈ облеки се вчитува:
nl: CJ's kledij snel laden:
pl: Szybkie ładowanie ubrań CJ:
pt_br: Carregamento rápido das roupas do CJ:
ro: Încărcare rapidă haine CJ:
ru: Быстрая загрузка одежды CJ:
sk: Rýchle načítavanie oblečenia CJ-a:
sl: Hitro nalaganje CJ-jevih oblek:
sv: Snabb laddning av CJ kläder:
uk: Швидке завантаження одягу CJ:

source: Browser speed:
de: Geschwindigkeit des Serverbrowsers:
et: Brauseri kiirus:
hr: Brzina pretraživača:
hu: Keresési sebesség:
it: Velocità del browser:
ja: ブラウザの速さ:
lt: Naršyklės greitis:
lv: Pārlūkošanas ātrums:
mk: Брзина на прелистувачот:
nl: Browser snelheid:
pl: Szybkość skanowania serwerów:
pt_br: Velocidade do Navegador:
ro: Viteză navigator:
ru: Скорость обновления списка серверов:
sk: Rýchlosť prehliadača:
sl: Hitrost brskalnika:
sv: Serverlista uppdateringshastighet:
uk: Швидкість оновлення списку серверів:

source: Single connection:
de: Nur eine Verbindung nutzen:
et: Üksik ühendus:
hr: Jednostavna veza:
hu: Egyetlen kapcsolat:
it: Connesione Singola:
ja: 単一接続:
lt: Pavienis prisijungimas:
lv: Viens savienojums:
mk: Единечна конекција:
nl: Enkelvoudige verbinding:
pl: Pojedyncze połączenie:
pt_br: Conexão unitária:
ro: Conexiune solitară:
ru: Однопоточное подключение:
sk: Jednotné pripojenie:
sl: Ena povezava:
sv: Singel anslutning:
uk: Одиночне під'єднання:

source: Packet tag:
de: Paket Kennzeichnung:
hr: Oznaka paketa:
hu: Csomag megjelölés:
ja: パケットタッグ：
lt: Paketo etiketė:
lv: Pakešu marķēšana:
mk: Таг на пакет:
pl: Znakowanie pakietów:
pt_br: Tag do pacote:
ru: Тег пакета:
uk: Теґ пакета:

source: Progress animation:
de: Fortschrittsanimation
hr: Napredak animacije:
hu: Folyamatjelző animáció:
ja: アニメーション進歩：
lt: Progreso animacija:
lv: Pakešu marķēšana:
mk: Анимација на прогрес:
pl: Animowany postęp:
pt_br: Animação do progresso:
ru: Анимация индикатора загрузки:
uk: Анімація індикатора завантаження:

source: Process priority:
de: Prozesspriorität:
et: Protsessi prioteet:
hr: Prioritet procesa:
hu: Folyamat prioritása:
it: Priorità di processo:
ja: プロセス優先度:
lt: Veiksmų pirmenybė:
lv: Procesu prioritāte:
mk: Процес на приоритет:
nl: Proces prioriteit:
pl: Priorytet procesu gry:
pt_br: Prioridade do processo:
ro: Prioritate proces:
ru: Приоритет процесса
sk: Priorita procesu:
sl: Prednost procesa:
sv: Processprioritet:
uk: Пріоритет процесу

source: Debug setting:
de: Debugeinstellung:
et: Debug seaded:
hr: Debug postavka:
hu: Hibakeresési beállítás:
it: Impostazioni di debug:
ja: デバッグ設定:
lt: Derinimo nustatymas:
lv: Atkļūdošanas uzstādījumi:
mk: Дебаг опции:
nl: Debug instellingen:
pl: Ustawienia debugowania:
pt_br: Tipo de Depuração:
ro: Setări depanare:
ru: Настройка отладчика:
sk: Nastavenie ladenia:
sl: Nastavitve odpravljalca napak:
sv: Felsökningsinställning:
uk: Настроювання налагоджувача:

source: Streaming memory:
de: Speicher zum Streamen:
et: Striiming mälu:
hr: Memorija strujanja:
hu: Streaming memória:
it: Trasmissione memoria:
ja: ストリーミングメモリ量
lt: Laikinoji atmintis:
lv: Straumēšanas atmiņa:
mk: Стриминг меморија:
nl: Streaming geheugen:
pl: Pamięć strumieniowania:
pt_br: Memória para Streaming:
ro: Memorie streaming:
ru: Видеопамять:
sk: Streamovacia pamäť:
sl: Spomin za pretakanje:
sv: Streaming minne:
uk: Відеопам'ять:

source: Update build type:
de: Buildtyp für Aktualisierungen:
et: Uuenduse tüüp:
hr: Tip ažuriranja:
hu: Frissítés típusa:
it: Metodo di aggiornamento:
ja: ビルドタイプをアップデートする:
lt: Versijos atnaujinimo tipas:
lv: Atjauninājumu veids:
mk: Надградете го типот:
nl: Update versie type:
pl: Rodzaj wydania:
pt_br: Tipo de atualização:
ro: Tip de actualizare aplicație:
ru: Тип обновления:
sk: Typ aktualizácií:
sl: Vrsta posodobitve:
sv: Uppdatera byggtyp:
uk: Тип оновлення:

source: Install important updates:
de: Wichtige Updates installieren:
hr: Instaliraj važna ažuriranja:
hu: Fontos frissítések telepítése:
ja: 重要なアップデートをインストール：
lt: Įrašyti svarbius atnaujinimus:
lv: Instalēt svarīgus atjauninājumus:
mk: Инсталирај важни надградби:
pl: Instaluj ważne aktualizacje:
pt_br: Instalar atualizações importantes:
ru: Установить важные обновления:
uk: Інсталювати важливі оновлення:

source: On
de: An
et: Peal
hr: Uključeno
hu: Bekapcsol
ja: つける
lt: Įjungta
lv: Ieslēgts
mk: Вклучување
nl: Aan
pl: Włączone
pt_br: Ligado
ro: Activat
ru: Включить
sk: Zapnuté
sl: Vključeno
sv: På
uk: Увімкнути

source: Very slow
de: Sehr langsam
et: Väga aeglane
hr: Vrlo sporo
hu: Nagyon lassú
it: Molto Lenta
ja: さらに遅く
lt: Labai lėtas
lv: Ļoti lēni
mk: Многу бавно
nl: Erg langzaam
pl: Bardzo wolna
pt_br: Bem lento
ro: Foarte înceată
ru: Очень медленно
sk: Veľmi pomaly
sl: Zelo počasi
sv: Väldigt långsam
uk: Дуже повільно

source: Default
de: Standard
et: Tavaline
hr: Uobičajeno
hu: Alapértelmezett
it: Predefinita
ja: デフォルト
lt: Numatytas
lv: Noklusējuma
mk: Стандарно
nl: Standaard
pl: Domyślne
pt_br: Padrão
ro: Implicit
ru: По умолчанию
sk: Predvolené
sl: Privzeto
sv: Standard
uk: За промовчанням

source: Fast
de: Schnell
et: Ilma ääreta aken
hr: Brzo
hu: Gyors
it: Veloce
ja: 速い
lt: Greitas
lv: Ātri
mk: Брзи
nl: Snel
pl: Szybka
pt_br: Rápido
ro: Rapidă
ru: Быстро
sk: Rýchle
sl: Hitro
sv: Snabb
uk: Швидко

source: Normal
hu: Normál
lt: Normalus
mk: Нормално
uk: Середнє

source: Above normal
hu: Normálnál nagyobb
lt: Virš normalaus
mk: Нормално
pt_br: Acima do normal
uk: Вище норми

source: Min
et: Miinimum
hr: Minimalno
hu: Minimum
it: Minimo
ja: 最小
lv: Minimālais
mk: Минимум
pl: Minimum
pt_br: Mín
ro: Minimă
ru: Мин
sl: Najmanj
uk: Мін.

source: Max
et: Maksimum
hr: Maksimalno
hu: Maximum
it: Massimo
ja: 最大
lt: Maks
lv: Maks.
mk: Махимим
pl: Maksimum
pt_br: Máx
ro: Maximă
ru: Макс
sl: Največ
uk: Макс.

source: Windows 8 compatibility:
de: Windows 8 Kompatibilität:
hr: Windows 8 kompatibilnost:
hu: Windows 8 kompatibilitás:
ja: Windows 8 サポート
lt: Windows 8 suderinamumas:
lv: Windows 8 saderība:
mk: Виндоус 8 компатибилност:
nl: Windows 8 compatibiliteit:
pl: Zgodność z Windows 8:
pt_br: Compatibilidade com Windows 8:
ro: Compatibilitate Windows 8:
ru: Совместимость с Windows 8:
uk: Сумісний з Windows 8:

source: 16-bit color
de: 16-Bit Farbe
hr: 16-bitna boja
hu: 16 bites színmélység
ja: 16-ビットカラー(&B)
lt: 16-bitų spalvos
lv: 16-bitu krāsas
mk: 16-битна боја
nl: 16-bit kleuren
pl: Kolor 16-bit
pt_br: Cor 16-bit
ro: culoare pe 16 biţi
ru: 16-битные цвета
uk: 16-бітові кольори

source: Mouse fix
de: Maus Fix
hr: Miš fix
hu: Egér fixálás
ja: マウスフィックス
lt: Pelės pataisymas
lv: Fiksēta pele
mk: Поправка на маус
nl: Aanwijzer fixen
pl: Poprawka dla ruchu myszy
pt_br: Correção do mouse
ro: Fixare mouse
ru: Исправление мыши
uk: Виправлення миші

source: Client resource files:
hr: Klijentske datoteke resursa:
hu: Kliens oldali resource-ok:
ja: クライアント資源ファイル：
lt: Kliento resursų failai:
lv: Klienta resursi:
mk: Фајлови и ресурси на клиентот:
pl: Pliki zasobów po stronie klienta:
pt_br: Arquivos de recursos do cliente:
ru: Путь загрузки ресурсов:
uk: Шлях завантаження ресурсів:

source: Show in Explorer
hr: Pokaži u pretraživaču
hu: Megjelenítés az Intézőben
ja: エクスプローラで表示する
lv: Parādīt iekš Windows:
mk: Прикажи во Explorer
pl: Pokaż w Eksploratorze
pt_br: Mostrar no Explorer
ru: Открыть папку
uk: Відкрити теку

source: Auto updater
et: Automaatne uuendaja
hr: Automatsko ažuriranje
hu: Automatikus frissítő
it: Aggiornamento automatico
ja: 自動アップデータ
lt: Automatinis naujinimas
lv: Automātiskais atjaunotājs
mk: Автоматско ажурирање
nl: Automatisch bijwerken
pl: Automatyczna aktualizacja
pt_br: Atualização automática
ro: Actualizator automat
ru: Автоматическое обновление
sl: Samodejni posodobljevalnik
sv: Autouppdaterare
uk: Автоматичне оновлення

source: Check for update now
de: Jetzt nach Update suchen
et: Kontrolli uuendusi
hr: Provjeri za nadogradnju
hu: Frissítés keresése most
it: Controllo aggiornamenti
ja: 今すぐアップデートをチェックする
lt: Tikrinti, ar yra atnaujinimų
lv: Pārbaudīt atjauninājumus
mk: Провери ги ажурирањата сега
nl: Check nu voor updates
pl: Sprawdź aktualizacje
pt_br: Procurar por atualizações
ro: Verifică pentru actualizări acum
ru: Проверить обновления
sk: Skontrolovať aktualizácie
sl: Preveri za posodobitve
sv: Sök efter uppdatering nu
uk: Перевірити наявність оновлень

source: Some settings will be changed when you next start MTA
de: Manche Einstellungen werden nach einem Neustart von MTA angewendet
hr: Neke postavke će se promijeniti kada ponovno upalite MTA
hu: Néhány beállítás megváltozik, amikor legközelebb elindítod a MTA-t
ja: 次のMTAの起動時に設定が反映されます。
lt: Kai kurie nustatymai pasikeis tik paleidus MTA iš naujo
lv: Daži uzstādījumi tiks mainīti, kad jūs nākošajā reizē startēsiet MTA
mk: Некои опции ќе бидат промените следниот пат кога ќе ја вклучите MTA
nl: Sommige instellingen zullen worden gewijzigd wanneer u de volgende keer MTA start
pl: Niektóre ustawienia zostaną zmienione dopiero po zrestartowaniu MTA
pt_br: Algumas alterações serão aplicadas na próxima vez que o MTA for iniciado
ro: Unele setări vor fi schimbate când porneşti MTA data viitoare
ru: Настройки изменятся при следующем запуске MTA
uk: Налаштування зміняться при наступному старті MTA

source: Do you want to restart now?
de: Möchtest du jetzt neu starten?
et: Kas soovite taaskäivitada kohe?
hr: Želite li ponovno pokrenuti sada?
hu: Újraindítod most?
it: Vuoi riavviare ora?
ja: 今すぐ再起動しますか。
lt: Ar norite perkrauti dabar?
lv: Vai vēlaties restartēt šobrīd?
mk: Дали сакате сега да рестартирате?
nl: Wil je nu herstarten?
pl: Czy chcesz teraz zrestartować MTA?
pt_br: Você deseja reiniciá-lo agora?
ro: Vrei să repornești acum?
ru: Вы хотите перезапустить?
sk: Reštartovať teraz?
sl: Ali želite znova zagnati zdaj?
sv: Vill du starta om nu?
uk: Ви хочете перезапустити?

source: RESTART REQUIRED
de: NEUSTART ERFORDERLICH
et: TAASKÄIVITUS NÕUTUD
hr: PONOVNO POKRETANJE POTREBNO
hu: ÚJRAINDÍTÁS SZÜKSÉGES
it: RIAVVIO RICHIESTO
ja: 再起動が必要です
lt: REIKALINGAS PERKROVIMAS
lv: NEPIECIEŠAMS RESTARTS
mk: РЕСТАРТИРАЊЕ Е ЗАДОЛЖИТЕЛНО
nl: HERSTART NODIG
pl: WYMAGANY RESTART
pt_br: É NECESSÁRIO REINICIAR O MTA
ro: REPORNIRE NECESARĂ
ru: НЕОБХОДИМ ПЕРЕЗАПУСК
sk: VYŽADOVANÝ REŠTART
sl: POTREBEN PONOVEN ZAGON
sv: OMSTART KRÄVS
uk: НЕОБХІДНИЙ ПЕРЕЗАПУСК
