Repository: multitheftauto/mtasa-blue
Catalog: Shared/data/MTA San Andreas/MTA/locale/*/client.po
Languages: de, et, hr, hu, it, ja, lt, lv, mk, nl, pl, pt_br, ro, ru, sk, sl, sv, uk

source: Could not start the local server. See console for details.
de: Konnte lokalen Server nicht starten. Für Details siehe Konsole.
et: Ei suuda kohalikku serverit käivitada. Rohkem informatsiooni konsoolis.
hr: Lokalni poslužitelj se nije mogao pokrenuti. Pogledajte konzolu za detalje.
hu: Nem sikerült elindítani a helyi szervert. Információkért nyisd meg a konzolt.
it: Impossibile avviare il server locale. Consultare la console per i dettagli.
ja: ローカルサーバがスタートできませんでした。コンソールに事件の情報があります。
lt: Nepavyko paleisti vietinio serverio. Žvilgtelkite į konsolę, norėdami sužinoti detaliau.
lv: Nespēj palaist lokālo serveri. Skatiet konsoli, lai redzēti detaļas.
mk: Стартување на локален сервер е невозможно. Види ја конзолата за повеќе детали.
nl: Kon lokale server niet starten. Bekijk de console voor details.
pl: Nie udało się uruchomić serwera lokalnego. Sprawdź konsolę aby uzyskać więcej informacji.
pt_br: Não foi possível iniciar o servidor local. Verifique o console para mais informações.
ro: Nu s-a putut lansa serverul local. Vezi consola pentru detalii.
ru: Невозможно запустить локальный сервер. Проверьте окно консоли на наличие информации.
sk: Nemožno spustiť lokálny server. Pozri konzolu pre viac informácií.
sl: Ni mogoče začeti lokalnega strežnika. Glej konzolo za podrobnosti.
sv: Kunde inte starta lokal server. Se konsol för detaljer.
uk: Неможливо запустити локальний сервер. Перевірте вікно консолі на наявність інформації.

source: Error: Could not start local server. [%s]
de: Fehler: Konnte lokalen Server nicht starten. [%s]
et: Viga: Ei suuda käivitada kohalikku serverit. [%s]
hr: Greška: Lokalni poslužitelj se nije mogao pokrenuti. [%s]
hu: Hiba: Nem sikerült a helyi szerver indítása. [%s]
it: Errore: Impossibile avviare il server locale. [%s]
ja: エラー： ローカルサーバがスタートできませんでした。[%s]
lt: Klaida: Nepavyko paleisti vietinio serverio. [%s]
lv: Kļīda: Nevar palaist lokālo serveri. [%s]
mk: Грешка: Не е возможно да се стартува локален сервер. [%s]
nl: Fout: Kon lokale server niet starten. [%s]
pl: Błąd: Nie udało się uruchomić serwera lokalnego. [%s]
pt_br: Erro: Não foi possível iniciar o servidor local. [%s]
ro: Eroare: Nu s-a putut lansa serverul local. [%s]
ru: Ошибка: Невозможно запустить локальный сервер. [%s]
sk: Chyba: Nemožno spustiť lokálny server. [%s]
sl: Napaka: Ni mogoče začeti lokalnega strežnika. [%s]
sv: Fel: Kunde inte starta lokal server. [%s]
uk: Помилка: Неможливо запустити локальний сервер. [%s]

source: Download Progress:
de: Download Fortschritt:
et: Allalaadimise protsess:
hr: Napredak Skidanja:
hu: Letöltési folyamat:
it: Avanzamento Download:
ja: ダウンロード進捗:
lt: Atsisiuntimo progresas:
lv: Lejupielādes Progress:
mk: Прогрес на симување:
nl: Download Vooruitgang:
pl: Postęp pobierania:
pt_br: Progresso do download:
ro: Progresul descărcării:
ru: Прогресс загрузки:
sk: Priebeh sťahovania:
sl: Napredek nalaganja:
sv: Nedladdningsförlopp:
uk: Прогрес завантаження:

source: Map download progress:
de: Karten-Download-Fortschritt:
et: Kaardi allalaadimise protsess:
hr: Napredak skidanja mape:
hu: Pálya letöltési folyamat:
it: Avanzamento Download Mappa:
ja: マップダウンロード進捗:
lt: Žemėlapio atsisiuntimo progresas:
lv: Mapes lejupielādes progress:
mk: Прогрес на симнување на мапата:
nl: Kaart download vooruitgang:
pl: Postęp pobierania mapy:
pt_br: Progresso do download do mapa:
ro: Progresul descărcării hărții:
ru: Прогресс загрузки карты:
sk: Priebeh sťahovania mapy:
sl: Napredek nalaganja map:
sv: Kart nedladdningsförlopp:
uk: Прогрес завантаження карти:

source: %s of %s
de: %s von %s
et: %s / %s
hr: %s od %s
hu: %s a(z) %s-ból
it: %s su %s
ja: %s の %s
lt: %s iš %s
lv: %s no %s
mk: %s од %s
nl: %s van %s
pl: %s z %s
pt_br: %s de %s
ro: %s din %s
ru: %s из %s
sk: %s z %s
sl: %s od %s
sv: %s av %s
uk: %s з %s

source: Disconnect to cancel download
de: Trenne die Verbindung, um den Download abzubrechen.
et: Katkesta ühendus, et loobuda allalaadimisest
hr: Odspojite se da prekinete skidanje
hu: Csatlakozz le, ha megakarod szakítani a letöltést.
it: Disconnettiti per annullare il download
ja: ダウンロードをキャンセルするには、切断してください
lt: Atsijunkite norėdami atšaukti siuntimą
lv: Atslēdzieties, lai atceltu lejupielādi
mk: Дисконектирај се за да го прекинеш симнувањето
nl: Verbreek de verbinding om het downloaden te stoppen
pl: Rozłącz się aby zatrzymać pobieranie
pt_br: Desconecte para cancelar o download
ro: Deconectează-te pentru a anula descărcarea
ru: Отключитесь, чтобы остановить загрузку
sk: Odpoj sa pre zrušenie sťahovania
sl: Prekinite povezavo, da prenehate z nalaganjem
sv: Avbryt anslutning för att avbryta nedladdning
uk: Від'єднайтеся, щоб зупинити завантаження

source: Fatal error (%u). If this problem persists, please check out mtasa.com for support.
de: Fataler Fehler (%u). Wenn dieses Problem weiterhin besteht, wende dich an mtasa.com für Support.
et: Tõsine viga (%u). Kui probleem jätkub siis palun külastage mtasa.com abi saamiseks.
hr: Ozbiljna greška (%u). Ako problem ustraje, molimo posjetite mtasa.com za podršku.
hu: Végzetes hiba (%u). Ha ez továbbra is fent áll, kérem nézze meg az mtasa.com-ot segítségért.
it: Errore Fatale (%u). Se il problema persiste controllare mtasa.com per supporto.
ja: 致命的なエラー (%u)。この問題が続いたら「サポート」に行ってください。
lt: Kritinė klaida (%u). Jei problema kartosis, patikrinkite mtasa.com pagalbai.
lv: Fatāla kļūda (%u). Ja šī problēma atkārtojās, lūdzu skatiet pēc palīdzības iekš mtasa.com.
mk: Фатална грешка (%u). Доколку проблемот продолжи, проверете за помош на mtasa.com.
nl: Fatale fout (%u). Als dit probleem aanhoudt, gelieve mtasa.com te raadplegen voor hulp.
pl: Błąd krytyczny (%u). Jeśli problem się powtarza, skontaktuj się z www.mtasa.com w celu znalezienia pomocy.
pt_br: Houve um erro fatal (%u). Se este problema persistir, visite o mtasa.com para obter ajuda.
ro: Eroare fatală (%u). Dacă această problemă persistă, te rugăm verifică www.mtasa.com pentru ajutor.
ru: Критическая ошибка (%u). Если проблема не исправлена, то обратитесь на mtasa.com, за решением.
sk: Fatálna chyba (%u). Ak tento problém pretrváva, skontroluj mtasa.com pre podporu.
sl: Usodna napaka (%u). Če se ta problem ponavlja, prosimo, da obiščete http://www.mtasa.com/ za podporo.
sv: Allvarligt fel (%u). Om problemet kvarstår, vänligen kolla in mtasa.com för hjälp.
uk: Критична помилка (%u). Якщо проблема не виправлена, то зверніться на mtasa.com, за рішенням.

source: Protocol error (%u). If this problem persists, please check out mtasa.com for support.
de: Protokollfehler (%u). Wenn dieses Problem weiterhin besteht, wende dich an mtasa.com für Support.
et: Protokolli viga (%u). Kui probleem jätkub siis palun külastage mtasa.com abi saamiseks.
hr: Protokolna greška (%u). Ako problem ustraje, molimo posjetite mtasa.com ili podršku.
hu: Protokoll hiba (%u). Ha ez továbbra is fent áll, kérem nézze meg az mtasa.com-ot segítségért.
it: Errore di protocollo (%u). Se il problema persiste controllare mtasa.com per supporto.
ja: プロトコルエラー (%u)。この問題が続いたら「サポート」に行ってください。
lt: Protokolo klaida (%u). Jei problema kartosis, patikrinkite mtasa.com pagalbai gauti.
lv: Protokola kļūda (%u). Ja šī problēma atkārtojās, meklējiet pēc palīdzības iekš mtasa.com.
mk: Грешка во протоколот (%u). Доколку проблемот продолжи, побарајте помош на mtasa.com
nl: Protocol fout (%u). Als dit probleem aanhoudt, gelieve mtasa.com te raadplegen voor ondersteuning.
pl: Błąd protokołu (%u). Jeśli problem się powtarza, skontaktuj się z www.mtasa.com w celu znalezienia pomocy.
pt_br: Houve um erro de protocolo (%u). Se este problema persistir, visite o mtasa.com para obter ajuda.
ro: Eroare de protocol (%u). Dacă această problemă persista, te rugăm verifică www.mtasa.com pentru ajutor.
ru: Ошибка протокола (%u). Если проблема не исправлена, то обратитесь на сайт mtasa.com, чтобы получить поддержку.
sk: Chyba protokolu (%u). Ak tento problém pretrváva, choď na mtasa.com pre podporu.
sl: Napaka protokola (%u). Če se ta problem ponavlja, prosimo, da obiščete http://www.mtasa.com/ za podporo.
sv: Protokollfel (%u). Om problemet kvarstår, vänligen kolla in mtasa.com för hjälp.
uk: Помилка протоколу (%u). Якщо проблема не виправлена, то зверніться на сайт mtasa.com, щоб отримати підтримку.

source: Connection error
de: Verbindungsfehler
et: Ühenduse viga
hr: Greška pri spajanju
hu: Csatlakozási hiba
it: Errore di connessione
ja: 接続エラー
lt: Prisijungimo klaida
lv: Savienojuma kļūda
mk: Погрешна конекција
nl: Verbindingsfout
pl: Błąd połączenia
pt_br: Houve um erro de conexão
ro: Eroare de conexiune
ru: Ошибка соединения
sk: Chyba pripojenia
sl: Napaka povezave
sv: Anslutnings fel
uk: Помилка з'єднання

source: Problem with graphics driver
hr: Problem s grafičkim driverima
hu: Probléma a grafikus illesztőprogrammal
ja: グラフィックカードドライバと問題あり
lt: Problema su grafikos tvarkykle
mk: Проблеми со графичките драјвери
pl: Problem ze sterownikiem karty graficznej
pt_br: Problema com o driver de gráficos
ru: Проблема с графическим драйвером
uk: Проблема з графічним драйвером

source: Multi Theft Auto has not been installed properly, please reinstall.
de: Multi Theft Auto wurde nicht korrekt installiert. Bitte installiere es erneut.
et: Multi Theft Auto pole paigaldatud korrektselt, palun paigaldage uuesti.
hr: Multi Theft Auto nije instaliran prikladno, molimo instalirajte ponovno.
hu: Multi Theft Auto nincs megfelelően feltelepítve, kérlek telepítsd újra.
it: Multi Theft Auto non è stato installato correttamente, per favore ripeti l'installazione.
ja: Multi Theft Auto は正しくインストールできませんでした、再インストールしてください。
lt: Multi Theft Auto nebuvo įdiegtas teisingai, prašome įdiegti iš naujo.
lv: Multi Theft Auto nav ticis pareizi uzinstalēts, lūdzu pārinstalējiet.
mk: Multi Theft Auto не е инсталирана правилно, ве молиме ре-инсталирајте ја.
nl: Multi Theft Auto werd niet correct geïnstalleerd, gelieve te herinstalleren.
pl: Mod Multi Theft Auto nie został prawidłowo zainstalowany - zainstaluj go ponownie.
pt_br: O Multi Theft Auto não foi instalado corretamente, por favor reinstale-o novamente.
ro: Multi Theft Auto nu a fost instalat corect, te rugăm reinstalează-l.
ru: Multi Theft Auto установлена неправильно, пожалуйста, переустановите.
sk: Multi Theft Auto nebolo správne nainštalované, prosím preinštaluj.
sl: Multi Theft Auto ni bil pravilno nameščen, prosimo, da ga ponovno namestite.
sv: Multi Theft Auto har inte installerats korrekt, var god installera om.
uk: Multi Theft Auto інстальовано ​​неправильно, будь ласка, переінсталюйте.

source: Your browser will now display a web page with some help infomation. (If the page fails to load, paste (CTRL-V) the URL into your web browser)
de: Dein Browser wird jetzt eine Webseite mit Informationen anzeigen, die dir helfen könnten. (Wenn die Seite nicht korrekt geladen wird, füge die URL (STRG+V) in deinen Webbrowser ein)
et: Sinu brauser näitab veebilehte koos abistava tekstiga. (Kui lehekülg ei lae ära siis kleebi (CTRL-V) aadress oma veebilehitseja aknasse)
hr: Vaš pretraživač će sada prikazati stranicu sa nekim pomoćnim informacijama. (Ako se stranica ne uspije učitati, zalijepite (CTRL-V) URL u vaš web pretraživač)
hu: A böngésző most megjeleníti a weboldalt néhány információval. (Ha az oldal nem töltődik be, beillesztés (CTRL-V), az URL-t a böngészőbe)
it: Il tuo browser ora visualizzerà una pagina web con alcune informazioni utili. (Se questa pagina non carica copia (CTRL + V) l'URL nel tuo browser)
ja: あなたのブラウザが今情報にあるウェッブページを表す。 （ページのロード失敗したら、URLをブラウザにペーストしてください（CTRL-V））
lt: Jūsų naršklė dabar atidarys tinklapį su šiek tiek informacijos. (Jei puslapio nepavyks užkrauti, įklijuokite (CTRL-V) adresą į savo naršklę)
lv: Jūsu pārlūks uzrādīs tīmekļa vietni ar palīdzības informāciju. (Ja tīmekļa vietne neielādējās, ielīmējiet (CTRL-V) vietni interneta pārlūkā)
mk: Вашиот пребарувач ќе покаже веб страна со корисни информации. (Доколку страната не успее да ја прикаже, пишете го URL-то во вашиот пребарувач)
nl: Uw browser zal nu een webpagina tonen met hulpinformatie. (Als die pagina niet laad, plak (CTRL-V) de URL in uw web browser)
pl: Zobaczysz teraz stronę internetową z pomocą dla tego problemu. (Jeśli strona się nie załadowała, skopiuj adres URL i wklej go do przeglądarki internetowej)
pt_br: O seu navegador vai abrir uma página da web com algumas informações. (Se a página falhar ao carregar, cole (CTRL-V) a URL no seu navegador de internet)
ro: Navigatorul tău va afișa acum o pagină web cu informații ajutătoare. (Dacă pagina eșuează să se încarce, lipește (CTRL+V) URL-ul în navigatorul tău)
ru: Посетите веб-страницу, чтобы получить больше информации. (если страница не грузится, нажмите ctrl+v для вставки ссылки в браузер)
sk: Tvoj prehliadač teraz zobrazí web stránku s nejakými užitočnými informáciami. (Ak zlyhá jej načítanie, vlož (CTRL - V) adresu URL do prehliadača)
sl: Vaš brskalnik bo sedaj prikazal spletno stran za pomoč in informacije. (Če se prikaz strani izjalovi, kopirajte (CTRL + V) spletni naslov v vaš internetni brskalnik)
sv: Din webbläsare kommer nu att visa en webbsida med hjälpinformation. (Om sidan ej laddas, klistra in (CTRL-V) länken i din webbläsare)
uk: Відвідайте веб-сторінку, щоб отримати більше відомостей. (якщо сторінка не вантажиться, натисніть ctrl+v для вставлення посилання в браузер)

source: MTA will not receive updates on XP/Vista after July 2019. Upgrade Windows to play on the latest servers.
lt: MTA negaus daugiau atnaujinimų Vista ir XP operacinėse sistemose po 2019 metų liepos mėnesio. Atnaujinkite Windows, kad galėtumėte žaisti naujausiuose serveriuose.

source: Master volume:
lt: Pagrindinis garsas:
pt_br: Volume principal:

source: Radio options
lt: Radijos pasirinkimai
pt_br: Opções da rádio:

source: Mute options
lt: Nutildymo pasirinkimai
pt_br: Opções de volume mudo

source: Mute All sounds when minimized
lt: Nutildyti visus garsus kol žaidimas nuleistas
pt_br: Desativar sons do ambiente ao minimizar

source: Ok
et: Sobib
hr: U redu
lt: Gerai
lv: Labi
ru: Ок
sl: V redu
uk: Ок

source: You were kicked from the game
lt: Jūs buvote išmestas iš žaidimo

source: FOV:
hr: Udaljenost slike:
hu: Látótér:
pl: Pole widzenia:
pt_br: Campo de visão:
ru: Угол обзора:
uk: Кут огляду:

source: 1x
lv: x1
sl: 1-krat

source: 2x
lv: x2
sl: 2-krat

source: 3x
lv: x3
sl: 3-krat

source: connect: Syntax is 'connect <host> <port> [<nick> <pass>]'
de: connect: Syntax ist 'connect <host> <port> [<nick> <passwort>]'
it: connessione: Sintassi 'connect <host> <port> [<nick> <pass>]'
nl: connect: Syntax is 'connect <host> <poort> [<nick> <pasw>]'

source: Services currently unavailable
de: Dienste zurzeit nicht verfügbar
it: Servizi attualmente non disponbili
nl: Diensten momenteel niet beschikbaar

source: Login Error
de: Loginfehler
it: Errore di Login
nl: Fout bij het aanmelden

source: Invalid username/password
de: Benutzername oder Passwort falsch
it: Username/password non validi
nl: Ongeldige gebruikersnaam/wachtwoord

source: Success
de: Erfolg
it: Successo
nl: Succes

source: Successfully registered!
de: Registrierung erfolgreich!
it: Registrato con successo!
nl: Succesvol geregistreerd!

source: Username missing
de: Benutzername fehlt
it: Username mancante
nl: Gebruikersnaam ontbreekt

source: Email missing
de: Email fehlt
it: E-mail mancante
nl: E-mail adres ontbreekt

source: Password missing
de: Passwort fehlt
it: Password mancante
nl: Wachtwoord ontbreekt

source: Passwords do not match
de: Passwörter stimmen nicht überein
it: La password non corrisponde
nl: Wachtwoorden komen niet overeen

source: Validation code missing
de: Validierungscode fehlt
it: Codice di validazione mancante
nl: Validatiecode ontbreekt

source: Register
de: Registrieren
it: Registrati
nl: Registreren

source: Chat BG
de: Chat Hintergrund
it: BG chat
nl: Chat achtergrond

source: Input BG
de: Eingabehintergrund
it: BG input
nl: Invoer achtergrond

source: Font:
de: Schriftart:
it: Carattere:
nl: Lettertype:

source: Enable plugins (like Flash, Silverlight; Java is disabled by default)
de: Plugins zulassen (wie Flash, Silverlight; Java ist standardmäßig deaktiviert)

source: Logging in...
de: Loginvorgang läuft...
it: Accesso in corso...
nl: Inloggen...

source: Community
it: Comunità
nl: Gemeenschap

source: Username:
it: Nome utente:
nl: Gebruikersnaam:

source: Login
it: Accedi
nl: Aanmelden

source: Logout
it: Uscita
nl: Uitloggen
