Repository: multitheftauto/mtasa-blue
Catalog: Shared/data/MTA San Andreas/MTA/locale/*/client.po
Languages: de, et, hr, hu, it, ja, lt, lv, mk, nl, pl, pt_br, ro, ru, sk, sl, sv, uk

source: Tick the check box to send this crash info to MTA devs using the 'internet'
de: Aktiviere die Checkbox, um die Absturzinformationen den MTA Entwicklern über das Internet zu senden
hr: Označite kućicu da biste poslali informacije o padu MTA programerima koristeći 'internet'
hu: Jelölje be a jelölőnégyzetet, ha szeretne küldeni crash információkat a fejlesztőknek az internet segítségével
ja: MTAデベロッパーにこの情報を送るために、このチェックボックスにチェックしてください
lt: Pažymėkite varnelę, kad ši lūžio informacija būtų išsiųsta MTA kūrėjams internetu
lv: Atķeksējiet lai aizsūtītu šo avārijas informāciju MTA ražotājiem
mk: Штиклирајте за да пратите репорт до MTA девелоперите употребувајќи интернет
nl: Vink dit vakje aan om deze crash info te verzenden naar de MTA ontwikkelaars via het 'internet'
pl: Zaznacz to pole aby wysłać informacje w trybie online o zawieszeniu się programu do deweloperów MTA
pt_br: Marque a caixa para enviar as informações deste erro aos desenvolvedores do MTA usando a internet
ro: Bifează această casetă pentru a trimite aceste informații legate de crash către dezvoltatorii MTA folosind 'internetul'
ru: Поставьте галочку для отправки разработчикам информации через интернет о падении MTA.
uk: Установіть прапорець, щоб надсилати інформацію розробникам через Інтернет про падіння MTA.

source: Doing so will increase the chance of this crash being fixed.
de: Wenn du dies machst, kann der Fehler leichter behoben werden.
hr: Ovom akcijom povećava se šansa da se pad popravi.
hu: Ha így tesz, növeli az esélyét a crash kijavításának.
ja: すると、このクラッシュを直す可能性が高くなります。
lt: Taip padarius padidinsite šansus, jog šis lūžis nebepasikartotų ateityje.
lv: Tādējādi jūs paaugstināsiet izredzes šai avārijai tikt novērstai.
mk: Правејќи го ова ќе се зголеми шансата од проблемot да биде решен.
nl: Dit vergroot de kans dat deze crash wordt opgelost.
pl: Wykonanie tej czynności zwiększy szanse na naprawienie tego błędu.
pt_br: Fazendo isso vai aumentar as chances do erro ser consertado.
ro: Acest lucru va spori șansele ca acest crash să fie reparat.
ru: Это повысит шансы на устранение данной ошибки
uk: Це підвищить шанси на усунення даної помилки

source: Do you want to restart MTA: San Andreas ?
de: Möchten du MTA: San Andreas neustarten?
hr: Želite li ponovno pokrenuti MTA: San Andreas ?
hu: Szeretné újraindítani az MTA: San Andreas-t ?
ja: MTA: San Andreasを再起動しますか。
lt: Ar norite paleisti MTA: San Andreas iš naujo ?
lv: Vai jūs vēlaties restartēt MTA: San Andreas ?
mk: Дали сакате да ја рестартирате MTA: San Andreas ?
nl: Wilt u MTA: San Andreas herstarten?
pl: Czy chcesz uruchomić ponownie MTA: San Andreas?
pt_br: Você quer reiniciar o MTA: San Andreas?
ro: Ești sigur că vrei să repornești MTA: San Andreas?
ru: Вы хотите перезапустить MTA: San Andreas ?
uk: Ви хочете перезапустити MTA: San Andreas ?

source: MTA: San Andreas - Warning
de: MTA: San Andreas - Warnung
hr: MTA: San Andreas - Upozorenje
hu: MTA: San Andreas - Figyelmeztetés
ja: MTA: San Andreas - 警告
lt: MTA: San Andreas - Perspėjimas
lv: MTA: San Andreas - Brīdinājums
mk: MTA: San Andreas - Предупредување
nl: MTA: San Andreas - Waarschuwing
pl: MTA: San Andreas - Ostrzeżenie
pt_br: MTA: San Andreas - Aviso
ro: MTA: San Andreas - Avertisment
ru: MTA: San Andreas - Предупреждение
uk: MTA: San Andreas - Попередження

source: Your Grand Theft Auto: San Andreas install directory contains a d3d9.dll file:
de: Dein Grand Theft Auto: San Andreas Installationsverzeichnis enthält eine d3d9.dll:
hr: Vaša Grand Theft Auto: San Andreas instalacija sadrži d3d9.dll datoteku:
hu: A Grand Theft Auto: San Andreas telepítési könyvtár tartalmaz egy D3D9.dll fájlt:
ja: あなたのGTA: San Andreasインストールがd3d9.dllファイルを含んでいます:
lt: Jūsų Grand Theft Auto: San Andreas įrašymo vietoje aptiktas d3d9.dll failas:
lv: Jūsu Grand Theft Auto: San Andreas instalācijas mape satur d3d9.dll failu:
mk: Вашата Grand Theft Auto: San Andreas инсталира дирекција што содржи d3d9.dll фајл:
nl: Uw Grand Theft Auto: San Andreas installatiemap bevat een d3d9.dll bestand:
pl: Twój katalog instalacji Grand Theft Auto: San Andreas zawiera plik d3d9.dll:
pt_br: O diretório de seu Grand Theft Auto: San Andreas contém um arquivo d3d9.dll:
ro: Directorul tău Grand Theft Auto: San Andreas conține un fișier d3d9.dll:
ru: Директория с Grand Theft Auto: San Andreas содержит файл d3d9.dll:
uk: Директорія з Grand Theft Auto: San Andreas містить файл d3d9.dll:

source: The file is not required and may interfere with the graphical features in this version of MTA:SA. It is recommended that you remove or rename d3d9.dll
de: Diese Datei ist nicht nötig und könnte die Grafik von MTA:SA beeinträchtigen. Es ist empfehlenswert diese Datei zu entfernen oder umzubenennen
hr: Ova datoteka nije potrebna te se može umiješati sa grafičkim svojstvima u ovoj verziji MTA:SA. Preporučeno je da izbrišete ili preimenujete d3d9.dll
hu: A fájl nem szükséges, és zavarhatja a grafikai funkciókat a jelenlegi MTA: SA verzióban. Javasoljuk, hogy távolítsa el vagy nevezze át: D3D9.dll
ja: このファイルは必要ありません。そして、このバーションのグラフィカル機能に干渉するかもしれません。 d3d9.dllファイルの名前を変更してください。または、ファイルを消しておいてください
lt: Šis failas yra nebūtinas ir gali sukelti nesklandumų su naujomis grafikos galimybėmis šioje MTA:SA versijoje. Rekomenduojama pašalinti arba pervadinti failą d3d9.dll
lv: Šis fails nav nepieciešams un var traucēt grafiskajām funkcijām šajā MTA:SA versijā. Ir vēlams, lai jūs izdzēstu vai nomainītu nosaukumu failam d3d9.dll
mk: Фајлот не е потребен и може да да има проблем со графичките карактеристики на оваа верзија од MTA:SA. Препорачливо е да се преименува или избрише d3d9.dll
nl: Dit bestand is niet nodig en kan mogelijks de grafische functies van MTA:SA storen. Het wordt aanbevolen dat u d3d9.dll verwijdert of hernoemt.
pl: Ten plik nie jest wymagany i może powodować problemy z grafiką w tej wersji MTA:SA. Zalecamy usunięcie lub zmianę nazwy pliku d3d9.dll
pt_br: O arquivo não é necessário e pode interferir com os recursos gráficos dessa versão do MTA:SA. É recomendado que você remova ou renomeie o arquivo d3d9.dll
ro: Acest fișier nu este necesar și poate interfera cu caracteristicile grafice ale MTA:SA. Este recomandat să ștergi sau să redenumești d3d9.dll
ru: Этот файл не требуется и может помешать работе с графикой в этой версии MTA:SA. Рекомендуется удалить или переименовать файл d3d9.dll
uk: Цей файл не є обов'язковим, що може перешкодити роботі з графікою у цій версії MTA:SA. Рекомендовано видалити або перейменувати файл d3d9.dll

source: Do not tell me about this d3d9.dll again
de: Ich möchte nicht mehr über die d3d9.dll informiert werden
hr: Nemoj me više upozoravati o ovom d3d9.dll ponovno
hu: Ne figyelmeztess újra a d3d9.dll-el kapcsolatban
ja: このd3d9.dllファイルのことを知らせないでください
lt: Daugiau man nepranešti apie šį d3d9.dll failą
lv: Neatgādināt man par d3d9.dll vēlreiz
mk: Не го прикажувајте овој проблем за d3d9.dll повторно
nl: Gelieve mij niet meer te waarschuwen over deze d3d9.dll
pl: Nie powiadamiaj mnie więcej o tym pliku d3d9.dll
pt_br: Não me lembre sobre esse arquivo d3d9.dll novamente
ro: Nu îmi mai reaminti despre acest d3d9.dll
ru: Не сообщать мне больше о d3d9.dll
uk: Не кажіть мені більше про d3d9.dll

source: Show me the file
de: Datei öffnen
hr: Pokaži mi datoteku
hu: Mutasd meg a fájlt
ja: ファイルを表示してください
lt: Parodyti man failą
lv: Atvērt failu
mk: Покажи го фајлот
nl: Toon mij het bestand
pl: Pokaż mi ten plik
pt_br: Me mostre o arquivo
ro: Arată-mi fișierul
ru: Показать мне файл
uk: Покажіть мені файл

source: Play MTA:SA
de: MTA:SA spielen
hr: Igraj MTA:SA
hu: MTA:SA elindítása
ja: MTA:SAをプレイする
lt: Žaisti MTA:SA
lv: Spēlēt MTA:SA
mk: Играј MTA:SA
nl: Speel MTA:SA
pl: Uruchom MTA:SA
pt_br: Jogar MTA:SA
ro: Lansează MTA:SA
ru: Играть в MTA:SA
uk: Грати в MTA:SA

source: MTA: San Andreas - Confusing options
de: MTA: San Andreas - Verwirrende Optionen
hr: MTA: San Andreas - Zbunjujuće opcije
hu: MTA: San Andreas - Zavaros beállítások
ja: MTA: San Andreas - 紛らわしいオプション
lt: MTA: San Andreas - Painūs nustatymai
lv: MTA: San Andreas - Nepareizas opcijas
mk: MTA: San Andreas - Збунувачки опции
nl: MTA: San Andreas - verwarrende opties
pl: MTA: San Andreas - Mylące opcje
pt_br: MTA: San Andreas - Opções confusas
ro: MTA: San Andreas - Opțiuni derutante
ru: MTA: San Andreas - Сбитые настройки
uk: MTA: San Andreas - Збиті налаштування

source: NVidia Optimus detected!
de: NVidia Optimus erkannt!
hr: NVidia Optimus otkriven!
hu: NVidia Optimus észlelve!
ja: NVidia Optimus が検出されました！
lt: NVidia Optimus aptikta!
lv: Tika konstatēts NVidia Optimus!
mk: NVidia Optimus детектиран!
nl: NVidia Optimus gedecteerd!
pl: Wykryto platformę NVidia Optimus!
pt_br: NVidia Optimus detectado!
ro: nVidia Optimus detectat!
ru: Обнаружен NVidia Optimus!
uk: Виявлено NVidia Optimus!

source: Try each option and see what works:
de: Versuche jede Option und schaue, was funktioniert:
hr: Pokušajte svaku opciju i vidite što radi:
hu: Próbálj meg minden lehetőséget, és lássuk mi működik:
ja: オプションを試してみてください:
lt: Išbandykite kiekvieną nustatymą ir patrikrinkite, kuris veiks:
lv: Pamēģiniet katru no šīm opcijām, un izvēlieties to, kura strādā:
mk: Пробајте ја секоја опција и проверете која работи:
nl: Probeer iedere mogelijkheid en kijk wat er werkt:
pl: Wypróbuj każdą opcję i zobacz, która z nich działa najlepiej na Twoim komputerze:
pt_br: Tente cada opção e veja qual funciona:
ro: Încearcă fiecare opținue și vezi care funcționează:
ru: Попробуйте каждую опцию и посмотрите, что работает:
uk: Спробуйте кожну опцію і подивіться, що працює:

source: A - Standard NVidia
hr: A - Standardna NVidia
ja: A - NVIDIAスタンダード
lt: A - Standartinis NVidia
lv: A - Standarta NVidia
mk: A - Стандарна NVidia
nl: A - Standaard NVidia
pl: A - Standardowa NVidia
pt_br: A - NVidia Padrão
ro: A - nVidia Standard

source: B - Alternate NVidia
de: B - Alternatives NVidia
hr: B - Alternativna NVidia
hu: B - Alternatív NVidia
ja: B - 別のNVIDIA
lt: B - Alternatyvus NVidia
lv: B - Alternatīvā NVidia
mk: B - Алтернативна NVidia
nl: B - Alternatief NVidia
pl: B - Alternatywna NVidia
pt_br: B - NVidia Alternativo
ro: B - nVidia Alternativ

source: C - Standard NVidia with exe rename
de: C - Standard NVidia und Umbenennung der exe
hr: C - Standardna NVidia sa preimenovanim exe
hu: C - Standard NVidia exe átnevezéssel
ja: C - NVIDIAスタンダードとEXE名前の変更
lt: C - Standartinis NVidia su exe pervadinimu
lv: C - Standarta NVidia ar EXE pārsaukšanu
mk: C- Стандарна NVidia со преименување на exe
nl: C- Standaard NVidia en exe hernoemen
pl: C - Standardowa NVidia ze zmianą nazwy pliku exe
pt_br: C - Padrão NVidia com renomeação do .exe
ro: C - nVidia Standard cu redenumire executabil

source: D - Alternate NVidia with exe rename
de: D - Alternatives NVidia und Umbenennung der exe
hr: D - Alternativna NVidia sa preimenovanim exe
hu: C - Alternatív NVidia exe átnevezéssel
ja: D - 別のNVIDIAとEXE名前の変更
lt: D - Alternatyvus NVidia su exe pervadinimu
lv: D - Alternatīvā NVidia ar EXE pārsaukšanu
mk: D - Алтернативна NVidia со преименување на exe
nl: D - Alternatief NVidia en exe hernoemen
pl: C - Alternatywna NVidia ze zmianą nazwy pliku exe
pt_br: D - NVidia alternativo com renomeação do .exe
ro: D - nVidia Alternativ cu redenumire executabil

source: E - Standard Intel
hr: E - Standardni Intel
ja: E - スタンダードインテル
lt: E - Standartinis Intel
lv: E - Standarta Intel
mk: E - Стандарен Intel
nl: E - Standaard Intel
pl: E - Standardowy Intel
pt_br: E - Padrão Intel
ro: E - Intel Standard

source: F - Alternate Intel
de: F - Alternatives Intel
hr: F - Alternativni Intel
hu: F - Alternatív Intel
ja: F - 別のインテル
lt: F - Alternatyvus Intel
lv: F- Alternatīvā Intel
mk: F - Алтернативен Intel
nl: F - Alternatief Intel
pl: F - Alternatywny Intel
pt_br: F - Intel alternativo
ro: F - Intel Alternativ

source: G - Standard Intel with exe rename
de: G - Standard Intel und Umbenennung der exe
hr: G - Standarni Intel sa preimenovanim exe
hu: G - Standard Intel exe átnevezéssel
ja: G - スタンダードインテルとEXE名前の変更
lt: G - Standartinis Intel su exe pervadinimu
lv: G - Standarta Intel ar EXE pārsaukšanu
mk: G - Стандарен Intel со преименуван еxe
nl: G - Standaard Intel en exe hernoemen
pl: G - Standardowy Intel ze zmianą nazwy pliku exe
pt_br: G - Padrão Intel com renomeação do .exe
ro: G - Intel Standard cu redenumire executabil

source: H - Alternate Intel with exe rename
de: H - Alternatives Intel und Umbenennung der exe
hr: H - Alternativni Intel sa preimenovanim exe
hu: H - Alternatív Intel exe átnevezéssel
ja: H - 別のインテルとEXE名前の変更
lt: H - Alternatyvus Intel su exe pervadinimu
lv: H - Alternatīvā Intel ar exe pārsaukšanu
mk: H - Алтернативен Intel со преименување на exe
nl: H - Alternatief Intel en exe hernoemen
pl: H - Alternatywny Intel ze zmianą nazwy pliku exe
pt_br: H - Intel alternativo com renomeação do .exe
ro: H - Intel Alternativ cu redenumire executabil

source: If you get desperate, this might help:
de: Wenn du verzweifelst, könnte folgendes helfen:
hr: Ako postanete bespomoćni, ovo može pomoći:
hu: Ha kétségbeesett, ez segíthet:
ja: 絶望的な時に、これが助けてくれる:
lt: Jei pulsite į neviltį, tai gali jums padėti:
lv: Ja jūs nevarat atrisināt problēmu, šis var palīdzēt:
mk: Доколку сте очајни, ова може да ви помогне:
nl: Als u wanhopig wordt, dit helpt mogelijks:
pl: W razie problemów, poniższa opcja może Ci pomóc:
pt_br: Se você ficar desesperado, isto pode ajudar:
ro: Dacă devi disperat, asta te-ar putea ajuta:
ru: Если вы отчаялись, то это может помочь:
uk: Якщо ви зневірилися, то це може допомогти:

source: Force windowed mode
de: Fenstermodus erzwingen
hr: Prisili prozorni način
hu: Kényszer ablakos mód
ja: ウィンドウモードを強制
lt: Priverstinai paleisti lange
lv: Piespiedu loga režīms
mk: Присилен "Windowed" мод
nl: Venstermodus forceren
pl: Wymuś tryb okienkowy
pt_br: Forçar modo janela
ro: Forțează modul fereastră
ru: Принудительный оконный режим
uk: Примусовий віконний режим

source: Warning: Could not detect anti-virus product
de: Warnung: Konnte keine Antivirensoftware erkennen
hr: Upozorenje: Nemoguće pronaći anti-virusni softver
hu: Figyelem: Nem található anti-vírus termék
ja: 警告:アンチウイルスソフトが見つかりませんでした
lt: Perspėjimas: Nepavyko aptikti anti-virusinės sistemos
lv: Brīdinājums: Nevarēja atrast antivīrusa programmu
mk: Предупредување: Не е во можност да се детектира анти вирус
nl: Waarschuwing: Kon geen anti-virus software detecteren
pl: Ostrzeżenie: Nie wykryto oprogramowania antywirusowego
pt_br: Aviso: Não foi possível encontrar um antivírus
ro: Avertisment: Nu a putut fi detectat niciun produs anti-virus
ru: Внимание: Не удалось обнаружить антивирус
uk: Увага: Я не можу знайти антивірус

source: MTA could not detect an anti-virus on your PC. Viruses interfere with MTA and degrade your gameplay experience. Press 'Help' for more information.
de: MTA konnte keine Antivirensoftware auf deinem PC finden. Viren beinträchtigen MTA und verschlechtern dein Spielerlebnis. Drücke 'Hilfe' für weitere Informationen.
hr: MTA nije uspio pronaći anti-virusni program na Vašem računalu. Virusi se mogu umiješati u MTA i smanjiti vaše iskustvo u igri. Pritisnite 'Pomoć' za više informacija.
hu: Az MTA nem talált anti-vírus terméket a számítógépen. A vírusok zavarják az MTA-t és rontják a játékélményt. Nyomja meg a 'Segítség' gombot a további információkért.
ja: MTAはパソコンにアンチウイルスが見つかりませんでした。 ウイルスはMTAと妨害、そしてゲーム経験をデグレードするもしれません。 情報について、「ヘルプ」をクリックしてください。
lt: MTA nepavyko aptikti anti-virusinės sistemos jūsų kompiuteryje. Virusai gali trigdyti MTA darbą ir sumažinti jūsų žaidimo malonumą. Spauskite 'Pagalba' detalesnei informacijai.
lv: MTA nevarēja noteikt anti-vīrusa aplikāciju jūsu PC. Vīrusi sabojā MTA darbību un var samazināt veiktspēju. Nospiediet 'Help' vairāk informācijas iegūšanai.
mk: MTA не може да детектира анти вирус во вашиот компјутер. Вирусите може да направат проблем со вашата MTA. Притиснете на "Помош" за повеќе информации.
nl: MTA kon geen anti-virus software detecteren op uw PC. Virussen storen MTA en degraderen uw gebruikservaring. Druk 'Help' voor meer informatie.
pl: MTA nie wykryło oprogramowania antywirusowego na Twoim komputerze. Wirusy wpływają na działanie MTA i zmniejszają komfort grania. Kliknij 'Pomoc' aby dowiedzieć się więcej.
pt_br: O MTA não conseguiu encontrar um antivírus em seu PC. Vírus interferem no MTA e estragam sua jogabilidade Clique em 'Ajuda' para mais informações.
ro: MTA nu a putut detecta niciun anti-virus pe calculatorul dumneavoastră. Virușii interferează cu MTA și îți degradează experiența de joc. Apasă pe 'Ajutor' pentru mai multe informații.
ru: MTA не может обнаружить антивирус на вашем ПК. Вирусы могут вмешиваться в работу MTA и портить вам игру. Нажмите 'Помощь' для подробной информации.
uk: MTA не може виявити антивірус на вашому ПК. Віруси можуть втручатися в роботу MTA і псувати вам гру. Натисніть 'Допомога' для отримання докладнішої інформації.

source: I have already installed an anti-virus
de: I habe bereits eine Antivirensoftware installiert
hr: Već sam instalirao anti-virusni program
hu: Van telepítve anti-vírus termék
ja: 私はもうアンチウイルスをインストールしています
lt: Aš jau turiu įsirašęs anti-virusinę sistemą
lv: Esmu jau instalējis antivīrusu
mk: Јас веќе имам инсталирано анти вирус
nl: Ik heb al een anti-virus software
pl: Już mam odpowiedni program antywirusowy
pt_br: Eu já instalei um antivírus
ro: Am deja un anti-virus instalat
ru: Я уже установил антивирус
uk: Я вже інсталював антивірус

source: I will not install an anti-virus. I want my PC to lag and be part of a botnet.
de: Ich werde keine Antivirensoftware installieren. Ich möchte, dass mein PC laggt und Teil eines Botnetz ist.
hr: Ne želim instalirati anti virusni program. Želim da moje računalo bude usporeno.
hu: Nem fogok telepíteni anti-vírus terméket. Azt akarom, hogy a PC laggoljon, és része legyen egy botnet hálózatnak.
ja: アンチウイルスをインストールしません。 私のパソコンがクラックされて、ボットネットの一部になってほしい。
lt: Aš neįsirašinėsiu anti-virsinės sistemos. Noriu, kad mano kompiuteris striginėtų ir būtų valdomas hakerių.
lv: Es neinstalēšu antivīrusu. Es vēlos, lai mans PC lagotu un būtu iekš botneta.
mk: Јас нема да инсталирам анти вирус. Јас сакам мојот РС да лагира и да бидам дел од бот мрежата.
nl: I zal geen anti-virus software installeren. I wil dat mijn PC sloom is en deel uitmaakt van een botnet.
pl: Nie zainstaluję programu antywirusowego. Jestem doświadczonym użytkownikiem komputerów i nie straszne mi wirusy!
pt_br: Eu não instalarei um antivírus. Portanto, quero meu PC travando e ser alvo de botnet.
ro: Nu voi instala un anti-virus.
ru: Я не буду устанавливать антивирус. Я готов к риску стать частью бот-сети и лагов.
uk: Я не буду інсталювати антивірус. Я готовий до ризику стати частиною ботнету та лагів.

source: Searching for Grand Theft Auto San Andreas
de: Suche nach Grand Theft Auto San Andreas
et: Otsin Grand Theft Auto San Andreast
hr: U potrazi za Grand Theft Auto San Andreasom
hu: Keresése: Grand Theft Auto San Andreas
it: In ricerca di Grand Theft Auto: San Andreas
ja: GTA：San Andreasを探しています
lt: Ieškoma Grand Theft Auto San Andreas
lv: Meklē pēc Grand Theft Auto San Andreas
mk: Пребарување на Grand Theft Auto San Andreas
nl: Grand Theft Auto San Andreas zoeken...
pl: Wyszukiwanie Grand Theft Auto San Andreas
pt_br: Procurando o local de instalação do Grand Theft Auto: San Andreas...
ro: Se caută Grand Theft Auto: San Andreas
ru: Поиск Grand Theft Auto San Andreas
sk: Hľadám Grand Theft Auto: San Andreas
sl: Iščem Grand Theft Auto San Andreas
sv: Söker efter Grand Theft Auto San Andreas
uk: Пошук Grand Theft Auto San Andreas

source: Please start Grand Theft Auto San Andreas
de: Bitte starte Grand Theft Auto San Andreas
et: Palun käivitage Grand Theft Auto San Andreas
hr: Molimo pokrenite Grand Theft Auto San Andreas
hu: Kérem indítsd el a Grand Theft Auto San Andreas-t
it: Per favore avvia Grand Theft Auto: San Andreas
ja: GTA：San Andreasをスタートしてください
lt: Prašome paleisti Grand Theft Auto San Andreas
lv: Lūdzu palaidiet Grand Theft Auto San Andreas
mk: Ве молиме стартувајте ја Grand Theft Auto San Andreas
nl: Gelieve Grand Theft Auto San Andreas te starten
pl: Proszę włączyć Grand Theft Auto San Andreas
pt_br: Por favor, inicie o Grand Theft Auto: San Andreas
ro: Te rugăm lansează Grand Theft Auto: San Andreas
ru: Запустите Grand Theft Auto San Andreas
sk: Prosím spusti Grand Theft Auto: San Andreas
sl: Prosimo zaženite Grand Theft Auto San Andreas
sv: Var god starta Grand Theft Auto San Andreas
uk: Запустіть Grand Theft Auto San Andreas

source: Installing update...
de: Installiere Update...
hr: Instalacija dogradnji...
hu: Frissítés telepítése...
ja: アップデートインストール中。。。
lt: Įrašomas atnaujinimas...
lv: Instalē atjauninājumus...
mk: Инсталирање на ажурирање
nl: Update installeren...
pl: Instalowanie aktualizacji...
pt_br: Instalando atualização...
ro: Se instalează actualizarea...
ru: Установка обновления...
uk: Інсталяція оновлення...

source: Extracting files...
de: Extrahiere Dateien...
hr: Otpakiravam datoteke...
hu: Fájlok kicsomagolása...
ja: ファイルを抽出中。。。
lt: Išskleidžiami failai...
lv: Atspiež failus...
mk: Извлекување на фајлови...
nl: Bestanden uitpakken...
pl: Wypakowywanie plików...
pt_br: Extraindo arquivos...
ro: Se extrag fișierele...
ru: Извлечение файлов...
uk: Вилучення файлів...

source: Copying files...
de: Kopiere Dateien...
et: Kopeerin faile...
hr: Kopiranje fajlova...
hu: Fájl másolás...
it: Copiando i files...
ja: ファイルコピー中。。。
lt: Kopijuojamos bylos...
lv: Kopē failus...
mk: Копирање на фајлови...
nl: Bestanden kopiëren...
pl: Kopiuję pliki...
pt_br: Copiando arquivos...
ro: Se copiază fișierele...
ru: Копирование файлов...
sk: Kopírujem súbory...
sl: Kopiram datoteke...
sv: Kopierar filer...
uk: Копіювання файлів...

source: Copy finished early. Everything OK.
de: Kopiervorgang beendet. Alles ist in Ordnung.
et: Kopeerimine lõpetatud varakult. Kõik on korras.
hr: Kopija završena ranije. Sve OK.
hu: Másolás befejezve. Minden OK.
it: Copia finita presto. Tutto OK.
ja: ファイルコピーが完成しました。全てがOKです。
lt: Kopijavimas baigtas anksti. Viskas pavyko.
lv: Kopēšana pabeigta. Viss kārtībā.
mk: Копирањето заврши порано. Се е во ред.
nl: Kopie is vroeger klaar. Alles OK.
pl: Kopiowanie zakończone przed czasem. Wszystko w porządku.
pt_br: Copia terminada anteriormente. Tudo OK.
ro: Copierea s-a terminat rapid. Totul este OK.
ru: Копирование завершено. Все в порядке.
sk: Kopírovanie skončilo skoro. Všetko OK.
sl: Kopija je končala zgodaj. Vse je v redu.
sv: Kopieringen avslutades tidigt. Allt OK.
uk: Копіювання завершено. Все в порядку.

source: Finishing...
de: Fertigstellen...
et: Lõpetamine...
hr: Završavam...
hu: Befejezés...
it: Completamento in corso...
ja: 終了。。。
lt: Baigiama...
lv: Pabeidz...
mk: Завршува...
nl: Voltooien...
pl: Kończenie...
pt_br: Concluindo...
ro: Se finalizează...
ru: Завершение...
sk: Dokončujem...
sl: Zaključevanje...
sv: Slutför...
uk: Завершення...

source: Done!
de: Fertig!
et: Valmis!
hr: Završeno!
hu: Kész!
it: Fatto!
ja: 完了です!
lt: Baigta!
lv: Gatavs!
mk: Готово!
nl: Klaar!
pl: Gotowe!
pt_br: Pronto!
ro: Finalizat!
ru: Готово!
sk: Hotovo!
sl: Končano!
sv: Klart!
uk: Готово!

source: Do you want to terminate the MTA Server and continue updating?
de: Möchtest du den MTA Server stoppen und weiter updaten?
hr: Želite li prekinuti MTA Server i nastaviti s ažuriranjem?
hu: Leszeretnéd állítani az MTA szervert és folytatni a frissítést?
ja: MTAサーバーを停止して、アップデートしますか？
lt: Ar jūs norite išjungti MTA serverį ir tęsti atnaujinimus?
mk: Дали сакате да го прекинете MTA серверот и да продолжите со ажурирање?
pl: Czy chcesz wyłączyć aplikację MTA Server i kontynuować aktualizację?
pt_br: Deseja encerrar o servidor do MTA e prosseguir com a atualização?
ru: Вы хотите выключить сервер MTA для продолжения обновления?
uk: Ви хочете вимкнути сервер MTA для продовження оновлення?
