Repository: multitheftauto/mtasa-blue
Catalog: Shared/data/MTA San Andreas/MTA/locale/*/client.po
Languages: de, et, hr, hu, it, ja, lt, lv, mk, nl, pl, pt_br, ro, ru, sk, sl, sv, uk

source: Can't check for updates right now
de: Kann derzeit nicht auf Updates prüfen
et: Hetkel pole võimalik uuendusi kontrollida
hr: Ne možete provjeriti za nove nadogradnje trenutno
hu: Nem lehet frissítést keresni jelenleg.
it: Impossibile controllare gli aggiornamenti in questo momento
ja: 現在アップデートのチェックは出来ません。
lt: Šiuo metu neįmanoma patikrinti atnaujinimų
lv: Šobrīd nespēj pārbaudīt atjauninājumus
mk: Не е возможно да се прегледат ажурирањата во моментот
nl: Kan momenteel niet op updates controleren
pl: Nie można w tej chwili sprawdzić uaktualnień
pt_br: Não foi possível verificar se há atualizações. Tente mais tarde.
ro: Nu se poate verifica pentru actualizări acum
ru: Невозможно проверить обновления в данный момент
sk: Momentálne nemôžem skontrolovať aktualizácie
sl: Trenutno ni mogoče preveriti za posodobitve
sv: Kan inte kolla efter uppdateringar just nu
uk: Неможливо перевірити оновлення в даний момент

source: MTA:SA %s required
de: MTA:SA %s erforderlich
et: MTA:SA %s on nõutud
hr: MTA:SA %s potreban
hu: MTA:SA %s szükséges
it: MTA:SA %s richiesto
ja: MTA:SA %s が必要
lt: Reikalaujamas MTA:SA %s
lv: MTA:SA %s pieprasa
mk: MTA:SA %s е потребна
nl: MTA:SA %s nodig
pl: Wymagane MTA:SA %s
pt_br: O MTA:SA %s é necessário para efetuar esta operação
ro: MTA:SA %s necesar
ru: Требуется MTA:SA %s
sk: vyžadované MTA:SA %s
sl: MTA:SA %s potreben
sv: MTA:SA %s krävs
uk: Потрібно MTA:SA %s

source: An updated version of MTA:SA %s is required to join the selected server. Do you want to download and install MTA:SA %s ?
de: Eine neuere Version von MTA:SA %s ist notwendig, um diesen Server zu betreten. Möchtest du MTA:SA %s herunterladen und installieren?
et: Uuem versioon MTA:SA-st (%s) on vajalik, et serveriga ühenduda. Kas te tahate MTA:SA %s alla laadida ja installida?
hr: Nadograđena verzija MTA:SA %s je potrebna da se možete pridružiti odabranom serveru. Želite li skinuti i instalirati MTA:SA %s ?
hu: Egy frissebb MTA:SA verzió %s szükséges hogy játszhass a kiválasztott szerveren. Akarod hogy az MTA:SA letöltse és telepítse a frissítést %s ?
it: Una versione aggiornata di MTA:SA %s è richiesta per entrare nel server selezionato. Vuoi scaricare ed installare MTA:SA %s?
ja: このサーバーに参加するために、MTA:SA %s 最新アップデートが必要です。 MTA:SA %s をダウンロードして、インストールしますか？
lt: Patobulintos MTA:SA %s versijos atnaujinimas yra būtinas norint prisijungti į šį serverį. Ar norite atsisiųsti ir įdiegti MTA:SA %s ?
lv: MTA:SA %s atjauninājums ir nepieciešams, lai pievienotos izvēlētajam serverim. Vai vēlaties lejupielādēt un instalēt MTA:SA %s ?
mk: Понова верзија од MTA:SA %s е потребна за да влезеш во селектираниот сервер. Дали сакате да ја симнете и инсталирате MTA:SA %s?
nl: Een nieuwere versie van MTA:SA %s is nodig om de geselecteerde server binnen te komen. Wilt u de nieuwere versie van MTA:SA %s downloaden en installeren?
pl: Do połączenia z tym serwerem wymagana jest nowsza wersja MTA:SA - %s. Czy chcesz ściągnąć i zainstalować MTA:SA %s ?
pt_br: Uma versão mais atual do MTA:SA %s é necessária para entrar no servidor selecionado. Você quer baixar e instalar o MTA:SA %s ?
ro: O versiune mai actuală de MTA:SA %s este necesară pentru a juca pe serverul selectat. Ești sigur că vrei să descarci și să instalezi MTA:SA %s?
ru: Требуется обновление до MTA:SA %s, чтобы присоединиться к выбранному серверу. Вы хотите загрузить и установить MTA:SA %s?
sk: Pre pripojenie na vybraný server je potrebné aktualizovať MTA:SA %s . Chceš stiahnuť a nainštalovať MTA:SA %s ?
sl: Posodobljena verzija MTA:SA %s je potrebna, da se povežete s tem strežnikom. Ali želite naložiti in namestiti MTA:SA %s ?
sv: En uppdaterad version av MTA:SA %s behövs om du vill gå med i vald server. Vill du ladda ned och installera MTA:SA %s ?
uk: Потрібно оновлення до MTA:SA %s, щоб під'єднатися до вибраного сервера. Ви хочете завантажити та інсталювати MTA:SA %s?

source: Do you want to launch MTA:SA %s and connect to this server ?
de: Möchtest du MTA:SA %s starten und dich mit diesem Server verbinden?
et: Kas soovid käivitada MTA:SA %s ja liituda selle serveriga ?
hr: Želite li pokrenuti MTA:SA %s i povezati se na ovaj server ?
hu: El akarod indítani az MTA:SA %s és csatlakozni erre a szerverre?
it: Vuoi avviare MTA:SA %s e connetterti a questo server?
ja: %s MTA:SAを実行して、このサーバーに参加しますか？
lt: Ar norite paleisti MTA:SA %s ir prisijungti į šį serverį ?
lv: Vai Jūs vēlaties palaist MTA:SA %s un pievienoties šim serverim ?
mk: Дали сакате да ја започнете MTA:SA %s и конектирате на овој сервер ?
nl: Wilt u MTA:SA %s starten en verbinden met deze server?
pl: Czy chcesz uruchomić MTA:SA %s aby połączyć się z tym serwerem ?
pt_br: Você quer iniciar o MTA:SA %s e conectar a esse servidor ?
ro: Vrei să pornești MTA:SA %s și să te conectezi la acest server?
ru: Вы уверены, что хотите запустить MTA:SA %s и присоединиться к этому серверу?
sk: Chceš spustiť MTA:SA %s a pripojiť sa na tento server?
sl: Ali želite zagnati MTA:SA %s in se povezati s tem strežnikom?
sv: Vill du starta MTA:SA %s och ansluta till denna server ?
uk: Ви впевнені, що хочете запустити MTA:SA %s і під'єднатися до цього сервера?

source: It is not possible to connect at this time. Please try later.
de: Es ist zu diesem Zeitpunkt nicht möglich, eine Verbindung aufzubauen. Bitte versuche es später erneut.
et: Pole võimalik ühendust luua sellel korral. Palun proovige hiljem uuesti.
hr: Nije se moguće povezati u ovo vrijeme. Molimo pokušajte kasnije.
hu: Nem lehetséges, hogy csatlakozz erre a szerverre jelen pillanatban. Kérlek próbálkozz később.
it: Non è possibile connettersi in questo momento. Per favore prova più tardi.
ja: 現在、サーバーに接続することができません。 あとで、もう一度試してみてください。
lt: Šiuo metu prisijungti neįmanoma. Prašome bandyti vėliau.
lv: Šobrīd, nav iespējams savienoties. Mēģiniet vēlāk.
mk: Не е возможно да се конектирате во моментот. Ве молиме пробајте подоцна.
nl: Op dit moment is het niet mogelijk te verbinden. Probeer het later nog een keer.
pl: Nie można się połączyć w tej chwili. Spróbuj ponownie później.
pt_br: Não foi possível conectar agora. Por favor tente mais tarde.
ro: Nu este posibil să te conectezi în acest moment. Încearcă mai târziu.
ru: Подключение сейчас невозможно. Повторите попытку позже.
sk: Nie je možné sa teraz pripojiť. Skúste to neskôr.
sl: Trenutno se ni mogoče povezati. Prosimo poskusite kasneje.
sv: Det går inte att ansluta just nu. Vänligen prova senare.
uk: Не вдається зараз під'єднатися. Повторіть спробу пізніше.

source: Connecting
de: Verbindungsaufbau
et: Ühendamine
hr: Povezivanje
hu: Kapcsolódás
it: Connessione in corso
ja: 接続中
lt: Jungiamasi
lv: Savienojās
mk: Се конектира
nl: Aan het verbinden
pl: Łączenie
pt_br: Conectando
ro: Se conectează
ru: Подключение
sk: Pripája sa
sl: Vzpostavljanje povezave
sv: Ansluter
uk: Під'єднання

source: Please wait...
de: Bitte warten...
et: Palun oodake...
hr: Molimo pričekajte...
hu: Kérem várjon...
it: Attendere prego...
ja: しばらくお待ちください。。。
lt: Prašome palaukti...
lv: Lūdzu uzgaidiet...
mk: Ве молиме почекајте...
nl: Gelieve te wachten...
pl: Proszę czekać...
pt_br: Por favor aguarde...
ro: Așteaptă...
ru: Пожалуйста, подождите...
sk: Prosím počkajte...
sl: Prosimo, počakajte...
sv: Var god vänta...
uk: Будь ласка, зачекайте...

source: CHECKING
de: ÜBERPRÜFE
et: UURIN
hr: PROVJERAVANJE
hu: ELLENŐRZÉS
it: CONTROLLO
ja: チェック中
lt: TIKRINAMA
lv: PĀRBAUDA
mk: Се проверува
nl: CONTROLEREN
pl: SPRAWDZANIE
pt_br: CHECANDO
ro: SE VERIFICĂ
ru: ПРОВЕРКА
sk: KONTROLUJEM
sl: PREVERJANJE
sv: KOLLAR
uk: ПЕРЕВІРКА

source: UPDATE CHECK
de: AKTUALISIERUNGSÜBERPRÜFUNG
et: UUENDUSTE KONTROLLIMINE
hr: PROVJERA AŽURIRANJA
hu: FRISSÍTÉS ELLENŐRZÉS
it: CONTROLLO AGGIORNAMENTI
ja: アップデートチェック中
lt: ATNAUJINIMO PATIKRINIMAS
lv: ATJAUNINĀJUMA PĀRBAUDE
mk: Ажурирањето се проверува
nl: ZOEKEN NAAR UPDATES
pl: AKTUALIZACJA
pt_br: VERIFICANDO ATUALIZAÇÃO
ro: VERIFICARE ACTUALIZARE
ru: ПРОВЕРКА ОБНОВЛЕНИЙ
sk: KONTROLA AKTUALIZÁCIÍ
sl: PREVERJANJE POSODOBITVE
sv: UPPDATERINGSKONTROLL
uk: ПЕРЕВІРКА ОНОВЛЕНЬ

source: No update needed
de: Keine Aktualisierung notwendig
et: Uuendada pole vaja
hr: Nije potrebno ažuriranje
hu: Nincs szükséges frissítés
it: Nessun aggiornamento necessario
ja: アップデートする必要はありません
lt: Atnaujinimo nereikia
lv: Nav nepieciešams atjauninājums
mk: Не се потребни ажурирања
nl: Geen update nodig
pl: Brak nowszych aktualizacji
pt_br: Nenhuma atualização disponível
ro: Nicio actualizare nu este necesară
ru: В обновлении нет необходимости
sk: Nie je potreba aktualizácie
sl: Posodobitve niso potrebne
sv: Ingen uppdatering krävs
uk: В оновленні немає необхідності

source: DOWNLOADING
de: LÄDT HERUNTER
et: LAEN ALLA
hr: SKIDANJE
hu: LETÖLTÉS
it: IN DOWNLOAD
ja: ダウンロード中
lt: ATSISIUNČIAMA
lv: LEJUPIELĀDĒ
mk: СИМНУВАЊЕ
nl: AAN HET DOWNLOADEN
pl: POBIERANIE
pt_br: BAIXANDO
ro: SE DESCARCĂ
ru: ЗАГРУЗКА
sk: SŤAHOVANIE
sl: NALAGANJE
sv: LADDAR NED
uk: ЗАВАНТАЖЕННЯ

source: waiting...
de: warten...
et: ootan...
hr: čekanje...
hu: várakozás…
it: in attesa....
ja: 待機中...
lt: laukiama...
lv: gaida...
mk: почекајте...
nl: wachten...
pl: oczekiwanie...
pt_br: aguardando...
ro: se așteaptă...
ru: ожидание...
sk: Čakám...
sl: čakanje...
sv: väntar...
uk: очікування...

source: MANDATORY UPDATE
de: VERPFLICHTENDES UPDATE
et: KOHUSTUSLIK UUENDUS
hr: OBAVEZNO AŽURIRANJE
hu: KÖTELEZŐ FRISSÍTÉS
it: AGGIORNAMENTO OBBLIGATORIO
ja: 義務的なアップデート
lt: PRIVALOMAS ATNAUJINIMAS
lv: OBLIGĀTS ATJAUNINĀJUMS
mk: ЗАДОЛЖИТЕЛНА НАДГРАДБА
nl: VERPLICHTE UPDATE
pl: AKTUALIZACJA KRYTYCZNA
pt_br: ATUALIZAÇÃO OBRIGATÓRIA
ro: ACTUALIZARE OBLIGATORIE
ru: ОБЯЗАТЕЛЬНОЕ ОБНОВЛЕНИЕ
sk: NUTNÝ UPDATE
sl: OBVEZNA POSODOBITEV
sv: OBLIGATORISK UPPDATERING
uk: ОБОВ'ЯЗКОВЕ ОНОВЛЕННЯ

source: To join this server, you must update MTA. Do you want to update now ?
de: Um dich mit diesem Server zu verbinden, musst du MTA aktualisieren. Möchtest du diese Aktualisierung jetzt durchführen?
et: Et liituda selle serveriga pead uuendama oma MTA. Kas soovid uuendada kohe ?
hr: Da bi se mogli pridružiti ovom serveru, morate nadograditi MTA. Želite li nadograditi sada ?
hu: Hogy csatlakozhass erre a szerverre, frissítened kell az MTA-t. Szeretnéd frissíteni most?
it: Per entrare in questo server devi aggiornare MTA. Vuoi aggiornare ora?
ja: このサーバーに参加するために、MTAをアップデートすることが必要です。 今、アップデートしますか。
lt: Jei norite prisijungti, privalote atnaujinti MTA. Ar norite atnaujinti dabar ?
lv: Lai pievienotos šim serverim, Jums ir jāatjauno MTA. Vai Jūs vēlaties atjaunot tagad ?
mk: За да влезете во серверот, треба да ја ажурирате MTA. ~ Сакате ли да ја ажурирате сега?
nl: Om deze server te joinen moet u MTA updaten. Wilt u nu updaten?
pl: Aby połączyć się z tym serwerem, musisz zaktualizować MTA. Czy chcesz je teraz zaktualizować ?
pt_br: Para entrar nesse servidor você precisa atualizar o MTA. Você quer atualizar agora ?
ro: Pentru a juca pe acest server trebuie să actualizezi MTA. Dorești să actualizezi acum?
ru: Чтобы войти на сервер, вы должны обновить MTA. Обновить сейчас?
sk: Pre pripojenie na tento server musíš aktualizovať MTA. Aktualizovať teraz?
sl: Da se povežete s tem strežnikom, morate posodobiti MTA. Želite posodobiti zdaj?
sv: För att gå med i den här servern måste du uppdatera MTA. Vill du uppdatera nu?
uk: Щоб увійти на сервер, ви повинні оновити MTA. Оновити зараз?

source: OPTIONAL UPDATE
de: OPTIONALES UPDATE
et: VALIKULINE UUENDUS
hr: IZBORNO AŽURIRANJE
hu: OPCIONÁLIS FRISSÍTÉS
it: AGGIORNAMENTO OPZIONALE
ja: オプショナルアップデート
lt: NEPRIVALOMAS ATNAUJINIMAS
lv: IETEICAMS ATJAUNINĀJUMS
mk: ОПТИОНАЛНО АЖУРИРАЊЕ
nl: OPTIONELE UPDATE
pl: AKTUALIZACJA OPCJONALNA
pt_br: ATUALIZAÇÃO OPCIONAL
ro: ACTUALIZARE OPȚIONALĂ
ru: ДОПОЛНИТЕЛЬНОЕ ОБНОВЛЕНИЕ
sk: VOLITEĽNÝ UPDATE
sl: NEOBVEZNA POSODOBITEV
sv: VALFRI UPPDATERING
uk: ДОДАТКОВІ ОНОВЛЕННЯ

source: Server says an update is recommended, but not essential. Do you want to update now ?
de: Der Server empfiehlt eine Aktualisierung durchzuführen, die aber nicht notwendig ist, um dich mit dem Server zu verbinden. Möchtest du diese Aktualisierung jetzt durchführen?
et: Server ütleb, et uuendus on soovituslik, aga mitte vajalik. Kas soovid uuendada kohe ?
hr: Poslužitelj preporuča nadogradnju, ali ne osnovnu. Želite li nadograditi sada ?
hu: A szerver ajánlott egy frissítést, de nem kötelező. Szeretnéd frissíteni most?
it: Il server raccomanda un aggiornamento anche se non essenziale. Vuoi aggiornare ora?
ja: サーバーはアップデートが推奨されていますが、アップデートの必要はありません。 アップデートしますか？
lt: Serveris rekomenduoja atsinaujinti, bet tai nėra privaloma. Ar norite atsinaujinti dabar ?
lv: Serveris saka, ka ir atjauninājums ir ieteicams, bet ne obligāti. Vai Jūs vēlaties atjaunot tagad ?
mk: Серверот препорачува надградба, но не е опходна. ~ Дали сакате да надградите сега ?
nl: De server raad een update aan, dit is echter niet noodzakelijk. Wilt u nu updaten?
pl: Serwer zaleca zaktualizowanie MTA, ale nie jest to niezbędne. Czy chcesz je teraz zaktualizować ?
pt_br: O servidor diz que uma atualização é recomendada, mas não essencial. Você quer atualizar agora ?
ro: Serverul spune că o actualizare este recomandată, dar nu necesară. Dorești să actualizezi acum?
ru: Сервер предлагает обновить клиент, но это не обязательно. Вы хотите обновить?
sk: Server hovorí že je doporučené aktualizovať MTA, ale nie je to potrebné. Aktualizovať teraz?
sl: Strežnik pravi da je priporočena posodobitev, ampak ne nujno. Ali želite posodobiti zdaj?
sv: Servern rekommenderar en uppdatering, men är ej nödvändig. Vill du uppdatera nu ?
uk: Сервер пропонує оновити клієнт, але це не обов'язково. Ви хочете оновити?

source: Update not currently avalable. Please check www.mtasa.com
de: Zurzeit ist kein Update verfügbar. Prüfe bitte auf www.mtasa.com
et: Uuendust pole hetkel saadaval. Palun külastage www.mtasa.com
hr: Ažuriranje nije trenutno dostupno. Molimo posjetite www.mtasa.com
hu: Jelenleg nincs elérhető frissítés. Kérlek látogass el ide: www.mtasa.com
it: Aggiornamento attualmente non disponibile. Per favore controlla www.mtasa.com
ja: 現在、アップデートが不可能です。 「www.mtasa.com 」へ行ってください。
lt: Šiuo metu atnaujinimas nepasiekiamas. Patikrinkite www.mtasa.com
lv: Atjauninājums šobrīd nav pieejams. Lūdzu pārbaudiet www.mtasa.com
mk: Надградба во моментов не е достапно. Ве молиме посетете ја www.mtasa.com
nl: Update momenteel niet beschikbaar. Gelieve www.mtasa.com te raadplegen
pl: Usługa aktualizowania jest obecnie niedostępna. Sprawdź aktualizacje ręcznie na www.mtasa.com
pt_br: Atualização atualmente indisponível. Por favor cheque www.mtasa.com
ro: Actualizarea nu este disponibilă momentan. Vă rugăm verificați www.mtasa.com
ru: Обновления недоступны в данный момент. Пожалуйста посетите www.mtasa.com
sk: Aktualizácia nie je momentálne k dispozícií. Skontroluj prosím www.mtasa.com
sl: Posodobitev trenutno ni na voljo. Prosimo obiščite http://www.mtasa.com/
sv: Uppdatering är för tillfället otillgänglig. Var god kolla www.mtasa.com
uk: Оновлення недоступні в даний момент. Будь ласка відвідайте www.mtasa.com

source: ERROR SAVING
de: FEHLER BEIM SPEICHERN
et: VIGADE SALVESTAMINE
hr: POGREŠKA PRI SPREMANJU
hu: MENTÉS HIBA
it: ERRORE DI SALVATAGGIO
ja: 保存エラー
lt: KLAIDŲ IŠSAUGOJIMAS
lv: KĻŪDAS SAGLABĀŠANA
mk: Грешка Зачувување
nl: ERROR BIJ HET OPSLAAN
pl: BŁĄD PRZY ZAPISIE
pt_br: ERRO AO SALVAR
ro: EROARE SALVARE
ru: ОШИБКА СОХРАНЕНИЯ
sk: CHYBA UKLADANIA
sl: NAPAKA PRI SHRANJEVANJU
sv: FEL VID SPARNING
uk: ПОМИЛКА ЗБЕРЕЖЕННЯ

source: Unable to create the file.
de: Erstellen der Datei nicht möglich.
et: Ei suutnud luua uut faili.
hr: Nije moguće izraditi datoteku.
hu: Nem sikerült létrehozni a fájlt.
it: Impossibile creare il file.
ja: ファイルを作成できません。
lt: Neįmanoma sukurti bylos.
lv: Nespēj izveidot failu.
mk: Фајлот не беше во можност да се креира.
nl: Kon het bestand niet maken.
pl: Nie udało się utworzyć pliku.
pt_br: Não foi possível criar o arquivo.
ro: Nu s-a putut crea fișierul.
ru: Не удаётся создать файл.
sk: Nepodarilo sa vytvoriť súbor.
sl: Ni mogoče ustvariti datoteke.
sv: Kunde inte skapa filen.
uk: Не вдається створити файл.

source: ERROR DOWNLOADING
de: DOWNLOADFEHLER
et: VIGA ALLA LAADIMISEL
hr: POGREŠKA PRI SKIDANJU
hu: HIBÁS LETÖLTÉS
it: ERRORE DI DOWNLOAD
ja: ダウンロードエラー
lt: ATSISIUNTIMO KLAIDA
lv: KĻŪDA LEJUPIELĀDĒJOT
mk: Грешка Симнување
nl: FOUT BIJ HET DOWNLOADEN
pl: BŁĄD PRZY POBIERANIU
pt_br: ERRO AO BAIXAR
ro: EROARE DESCĂRCARE
ru: ОШИБКА ЗАГРУЗКИ
sk: CHYBA SŤAHOVANIA
sl: NAPAKA PRI NALAGANJU
sv: FEL VID HÄMTNING
uk: ПОМИЛКА ЗАВАНТАЖЕННЯ

source: The downloaded file appears to be incorrect.
de: Die heruntergeladene Datei scheint nicht in Ordnung zu sein.
et: Alla laetud failid tunduvad olevat ebasobivad.
hr: Skinuta datoteka je neispravna.
hu: A letöltött fájl úgy tűnik, hogy helytelen.
it: I file di download sembrano incorretti.
ja: ダウンロードしたファイルは不正ようです。
lt: Atsisiųstas failas yra neteisingas.
lv: Lejupielādētais fails izskatās nederīgs.
mk: Симнатиот фајл изгледа е неточен.
nl: Het gedownloade bestand lijkt verkeerd.
pl: Pobrany plik zdaje się być nieprawidłowy.
pt_br: O arquivo baixado parece estar incorreto.
ro: Fișierul descărcat pare să fie incorect.
ru: Загруженный файл некорректен.
sk: Stiahnutý súbor sa zdá byť nekorektný.
sl: Naložena datoteka je napačna.
sv: Den nedladdade filen verkar vara felaktig.
uk: Завантажений файл є хибним.

source: For some reason.
de: Aus irgendeinem Grund.
et: Mingil põhjusel
hr: Za neki razlog.
hu: Valamilyen oknál fogva.
it: Per qualche motivo.
ja: なんとか。
lt: Dėl neaiškios priežasties.
lv: Kāda iemesla dēļ.
mk: Поради некои причини.
nl: Om de een of andere reden.
pl: Z jakiegoś powodu.
pt_br: Por alguma razão.
ro: Dintr-un anumit motiv.
ru: По некоторым причинам.
sk: Z nejakého dôvodu.
sl: Iz neznanega razloga.
sv: Av någon anledning.
uk: З деяких причин.

source: DOWNLOAD COMPLETE
de: DOWNLOAD ABGESCHLOSSEN
et: ALLA LAADIMINE LÕPETATUD
hr: SKIDANJE ZAVRŠENO
hu: LETÖLTÉS BEFEJEZVE
it: DOWNLOAD COMPLETO
ja: ダウンロード成功です
lt: ATSISIUNTIMAS BAIGTAS
lv: LEJUPIELĀDE PABEIGTA
mk: Симнувањето е Успешно
nl: DOWNLOAD VOLTOOID
pl: POBIERANIE UKOŃCZONE
pt_br: DOWNLOAD COMPLETO
ro: DESCĂRCARE COMPLETĂ
ru: ЗАГРУЗКА ЗАВЕРШЕНА
sk: SŤAHOVANIE KOMPLETNÉ
sl: NALAGANJE ZAKLJUČENO
sv: NEDLADDNING KLAR
uk: ЗАВАНТАЖЕННЯ ЗАВЕРШЕНО

source: - Unknown problem in _DialogUpdateResult
de: - Unbekanntes Problem in _DialogUpdateResult
et: - Teadmata probleem _DialogUpdateResult -ga
hr: - Nepoznati problem u _DialogUpdateResult
hu: Ismeretlen hiba ebben: _DialogUpdateResult
it: -Problema sconosciuto in _DialogUpdateResult
ja: - 不明なエラー _DialogUpdateResult
lt: - Nežinoma problema ties _DialogUpdateResult
lv: - Nezināma problēma iekš _DialogUpdateResult
mk: ~ - Непознат проблем во _DialogUpdateResult
nl: - Onbekend probleem in _DialogUpdateResult
pl: - Nieznany problem w _DialogUpdateResult
pt_br: - Problema desconhecido em _DialogUpdateResult
ro: - Problemă necunoscută în _DialogUpdateResult
ru: - Неизвестная проблема в _DialogUpdateResult
sk: - Neznámy problém v _DialogUpdateResult
sl: - Neznan problem v _DialogUpdateResult
sv: - Okänt problem i _DialogUpdateResult
uk: - Невідома проблема в _DialogUpdateResult

source: ERROR
de: FEHLER
et: VIGA
hr: GREŠKA
hu: HIBA
it: ERRORE
ja: エラー
lt: KLAIDA
lv: KĻŪDA
mk: ГРЕШКА
nl: FOUT
pl: BŁĄD
pt_br: ERRO
ro: EROARE
ru: ОШИБКА
sk: CHYBA
sl: NAPAKA
sv: FEL
uk: ПОМИЛКА

source: Some MTA:SA data files are missing. Please reinstall MTA:SA
de: Einige MTA:SA Dateien konnten nicht gefunden werden. Bitte installiere MTA:SA neu.
et: Mõned tähtsad MTA:SA failid on puudu. Palun paigaldage MTA:SA uuesti
hr: Neke MTA:SA datoteke nedostaju. Molimo ponovno instalirajte MTA:SA.
hu: Néhány MTA:SA data fájl elveszett. Kérlek telepítsd újra az MTA:SA-t
it: Alcuni file dati di MTA:SA sono mancanti. Per favore reinstalla MTA:SA
ja: MTA:SAファイルの一部が不足しています。 MTA:SAを再インストールしてください
lt: Kai kurių MTA:SA data bylū trūksta. Prašome įdiegti MTA:SA iš naujo
lv: Daži MTA:SA datu faili ir pazuduši. Lūdzu pārinstalējiet MTA:SA
mk: Некои MTA:SA дата фајлови недостасуваат. /n/nВе молиме ре-инсталирајте ја MTA:SA
nl: Sommige MTA:SA data bestanden ontbreken. Gelieve MTA:SA te herinstalleren
pl: Brakuje niektórych plików moda MTA:SA. Proszę zainstalować ponownie MTA:SA
pt_br: Alguns arquivos do MTA:SA estão faltando. Por favor reinstale o MTA:SA
ro: Unele fișiere MTA:SA lipsesc. Te rugăm să reinstalezi MTA:SA
ru: Некоторые MTA:SA файлы отсутствуют. Переустановите MTA:SA.
sk: Niektoré MTA:SA súbory chýbajú. Preinštaluj prosím MTA:SA
sl: Nekatere MTA:SA datoteke manjkajo. Prosimo, da ponovno namestite MTA:SA
sv: Vissa MTA:SA datafiler fattas. Var god ominstallera MTA:SA
uk: Деякі MTA:SA файли відсутні. Переінсталюйте MTA:SA.

source: %3d %% completed
de: %3d %% abgeschlossen
et: %3d %% valmis
hr: %3d %% gotovo
hu: %3d %% kész
it: %3d %% completato
ja: %3d %% 完了
lt: %3d %% baigta
lv: %3d %% pabeigti
mk: %3d %% комплетирарно
nl: %3d %% voltooid
pl: %3d %% ukończone
pt_br: %3d %% completado
ro: %3d%% complet
ru: Загружено %3d %%
sk: %3d %% dokončené
sl: %3d %% končano
sv: %3d %% klar
uk: Завантажено %3d %%

source: Waiting for response - %-3d
de: Warte auf eine Antwort - %-3d
et: Ootan vastust - %-3d
hr: Čekanje odgovora - %-3d
hu: Várakozás a válaszra - %-3d
it: In attesa di risposta - %-3d
ja: 返事を待っています - %-3d
lt: Laukiama atsakymo - %-3d
lv: Gaida atbildi - %-3d
mk: Се чека одговор ~ ~ - ~ ~ %-3d
nl: Wachten op antwoord - %-3d
pl: Oczekiwanie na odpowiedź - %-3d
pt_br: Aguardando resposta - %-3d
ro: Se așteaptă un răspuns - %-3d
ru: Ожидание ответа - %-3d
sk: Čakám na odpoveď - %-3d
sl: Čakam na odziv - %-3d
sv: Väntar på svar - %-3d
uk: Очікування відповіді - %-3d

source: Screenshot got %d bytes, but expected %d
de: Das Bildschirmfoto hat %d bytes, benötigt aber %d bytes.
et: Pilt tuli %d baiti, aga eeldati %d
hr: Uslikavanje dobilo %d bajta, ali očekivano je %d
hu: Screenshot készítve %d bájt, de körülbelül %d
it: Lo screenshot ha ottenuto %d bytes, ma ne aspettava %d
ja: スクリーンショットは%dバイト、%dが期待されました
lt: Nuotraukos dydis %d baitų, bet tikėtasi %d
lv: Ekrānšāviņš aizņēma %d baitus, bet paredzēts %d
mk: Сликата има %d бајти, но очекувано е %d
nl: Screenshot heeft %d bytes, maar verwachtte %d
pl: Zrzut ekranu ma %d bajtów, a oczekiwano %d
pt_br: A captura de tela gerou %d bytes de dados, mas o esperado era %d
ro: Captura de ecran a înregistrat %d baiți, dar erau de așteptat %d
ru: Размер скриншота %d байт, но ожидалось %d
sk: Screenshot má %d bytov, ale má byť %d
sl: Posnetek zaslona je prejel %d bitov od pričakovanih %d
sv: Skärmdump fick %d bytes, men väntade %d
uk: Розмір знімка %d байт, але очікувалося %d

source: Screenshot failed
de: Bildschirmfoto fehlgeschlagen
et: Pildi tegemine ebaõnnestus
hr: Uslikavanje neuspjelo
hu: Screenshot készítése sikertelen
it: Screenshot fallito
ja: スクリーンショット失敗
lt: Ekranvaizdis nepavyko
lv: Ekrānšāviņš neizdevās
mk: Сликата се изгуби
nl: Screenshot mislukt
pl: Nie udało się wykonać zrzutu ekranu
pt_br: Não foi possível gerar a captura de tela
ro: Capturarea ecranului a eșuat
ru: Не удалось сделать скриншот
sk: Screenshot zlyhal
sl: Posnetek zaslona ni uspel
sv: Skärmdump misslyckades
uk: Не вдалося зробити знімок екрана
