Repository: multitheftauto/mtasa-blue
Catalog: Shared/data/MTA San Andreas/MTA/locale/*/client.po
Languages: de, et, hr, hu, it, ja, lt, lv, mk, nl, pl, pt_br, ro, ru, sk, sl, sv, uk

source: Could not initialize Direct3D9. Please ensure the DirectX End-User Runtime and latest Windows Service Packs are installed correctly.
de: Konnte Direct3D9 nicht initialisieren. Bitte stelle sicher, dass die DirectX End-User Runtime und das aktuelle Windows Service Pack korrekt installiert wurden.
et: Ei suudetud käivitada Direct3D9. Palun tehtke kindlaks, et DirectX End-User Runtime ja viimane Windows Service Pack on paigaldatud korrektselt.
hr: Nije moguće učitati Direct3D9. Molimo provjerite imate li instalirane DirectX End-User Runtime i posljednje Windows servisne zakrpe.
hu: Nem lehet inicializálni Direct3D9. Kérlek ellenőrizd le, hogy a legújabb DirectX és Windows Service Pack fel van-e telepítve.
it: Impossibile inizializzare Direct3D9. Per favore assicurati che le DirectX End-User Runtime e il più recente Service Pack di Windows siano installati correttamente.
ja: Direct3D9は初期化できませんでした。 DirectX End-User Runtimeと 最新のWindowsサービスパックがインストール されているか確認してください。
lt: Nepavyko paleisti Direct3D9. Prašome įsitikinti, kad DirectX End-User Runtime ir naujausi Windows Service Packs yra teisingai įrašyti.
lv: Nespēj inicializēt Direct3D9. Lūdzu pārliecinieties, ka DirectX End-User Runtime un pēdējās Windows Servisu Pakotnes ir uzstādītas pareizi.
mk: Не беше во можност да иницијализира Direct3D9. Ве молиме осигурете се дека DirectX End-User Runtime и најновиот сервисен пакет на Windows е инсталиран правилно.
nl: Was niet in staat om Direct3D9 te initialiseren. Gelieve ervoor te zorgen dat de DirectX End-User Runtime en laatste Windows Service Packs correct geïnstalleerd zijn.
pl: Nie można zainicjować Direct3D9. Proszę się upewnić, że biblioteki DirectX oraz najnowszy Dodatek Service Pack dla systemu Windows zostały zainstalowane poprawnie.
pt_br: Não foi possível iniciar o Direct3D9. Certifique-se que o "DirectX End-User Runtime" e os últimos "Service Packs" da sua versão do Windows estejam corretamente instalados.
ro: Nu s-a putut inițializa Direct3D9. Verificați dacă DirectX End-User Runtime și ultimele pachete de servicii ale Windows sunt instalate corect.
ru: Невозможно инициализировать Direct3D9. Установите DirectX End-User Runtime и самую свежую версию Windows Service Packs.
sk: Nemožno inicializovať Direct3D3. Prosím uisti sa že DirectX End-User beží a že je Windows Service Pack správne nainštalovaný.
sl: Ni bilo mogoče inicializirati Direct3D9. Prosimo preverite, če sta na vaši napravi naložena DirectX End-User Runtime in najnovejši Windows servisni paket..
sv: Kunde inte initiera Direct3D9. Vänligen se till att DirectX End-User Runtime och senaste Windows Service Packs är korrekt installerade.
uk: Не вдалося ініціалізувати Direct3D9. Інсталюйте DirectX End-User Runtime і найсвіжішу версію Windows Service Packs.

source: SERVER BROWSER
et: SERVERI LIST
hr: PREGLEDNIK POSLUŽITELJA
hu: SZERVER KERESŐ
it: Sfoglia i server
ja: サーバーブラウザ
lt: SERVERIŲ NARŠYKLĖ
lv: SERVERA PĀRLŪKS
mk: ПРЕБАРУВАЧ НА СЕРВЕРОТ
pl: PRZEGLĄDARKA SERWERÓW
pt_br: SERVIDORES
ro: CĂUTARE SERVERE
ru: СПИСОК СЕРВЕРОВ
sk: SERVERY
sl: Poišči strežnik
sv: SERVERLISTA
uk: СПИСОК СЕРВЕРІВ

source: Internet
ja: インターネット
lt: Internetas
lv: Interneta
mk: Интернет
ru: Интернет
uk: Інтернет

source: Local
de: Lokal
et: Kohalik
hr: Lokalni
hu: Helyi
it: Locali
ja: ローカル
lt: Vietinis
lv: Lokālie
mk: Локал
nl: Lokaal
pl: Lokalne
ru: Локальная сеть
sk: Lokálny
sl: Lokalno
sv: Lokal
uk: Локальна мережа

source: Favourites
de: Favoriten
et: Lemmikud
hr: Omiljeni
hu: Kedvencek
it: Preferiti
ja: お気に入り
lt: Mėgstamiausi
lv: Favorīti
mk: Омилени
nl: Favorieten
pl: Ulubione
pt_br: Favoritos
ro: Favorite
ru: Избранное
sk: Obľúbené
sl: Priljubljene
sv: Favoriter
uk: Вподобане

source: Recent
de: Verlauf
et: Hiljutine
hr: Nedavni
hu: Legutóbbi
it: Recenti
ja: 最近
lt: Paskutiniai
lv: Nesenie
mk: Неодамна
pl: Ostatnie
pt_br: Recentes
ro: Recente
ru: Последние
sk: Naposledy použité
sl: Nedavno
sv: Senaste
uk: Нещодавні

source: FOR QUICK CONNECT: Type the address and port into the address bar. Or select a server from the history list and press 'Connect'
de: Für schnelles Verbinden: Gib die Adresse und den Port in die Adresszeile ein. Wähle alternativ einen Server aus dem Verlauf und drücke 'Verbinden'
et: KIIRE ÜHENDUSE LOOMISEKS: Kirjuta serveri IP ja port aadressi ribale. Või vali server ajaloo listist ja vajuta 'Ühenda'
hr: ZA BRZO POVEZIVANJE: Unesi adresu i port u adresnu traku. Ili odaberi poslužitelja iz popisa povijesti i pritisni 'Poveži'
hu: GYORS CSATLAKOZÁS: Írd be a címsávba a szerver elérését. Vagy a legutóbbi szerverek közül válassz egyet és nyomd meg a 'Csatlakozás' gombot.
it: PER CONNETTERSI RAPIDAMENTE : Scrivi indirizzo e porta direttamente nella barra degli indirizzi. Oppure seleziona un server dalla cronologia e premi 'Connettiti'
ja: 早くに接続するために アドレスバーにアドレスとポートを書いてください。 または、最近のサーバーリストでサーバーを選んで 「接続する」をクリックしてください。
lt: GREITAM PRISIJUNGIMUI: Įrašykite adresą ir portą į adresam skirtą lauką. Arba pasirinkite serverį iš naršytųjų ir spauskite 'Jungtis'
lv: ĀTRAIS SAVIENOJUMS: Ievadiet servera adresi un portu adrešu joslā. Vai izvēlieties serveri no vēstures un spiediet 'Vienoties'
mk: ЗА БРЗО КОНЕКТИРАЊЕ: Пишете ја адресата и портата во празното место за адреса. Или селектирајте сервер од листата на неодмна посетени сервери и притиснете 'Kонектирај'
nl: VOOR SNELLE VERBINDING: Typ het adres en port in de adresbalk. Of selecteer een server uit de geschiedenis lijst en druk op 'Verbinden'
pl: SZYBKIE POŁĄCZENIE: Wpisz adres serwera i port w pasku adresu lub wybierz serwer z historii serwerów i kliknij 'Połącz'
pt_br: PARA SE CONECTAR RAPIDAMENTE: Digite o endereço e a porta na barra de endereço. Ou selecione um servidor na aba Recentes e clique em 'Conectar'
ro: PENTRU CONECTARE RAPIDĂ: Tastează adresa și portul în bara de adrese. Sau selectează un server din istoric și apasă 'Conectare'
ru: ДЛЯ БЫСТРОГО ПОДКЛЮЧЕНИЯ: Введите адрес и порт сервера в адресную строку. Или выберите сервер из истории последних и нажмите 'Подключиться'
sk: PRE RÝCHLE PRIPOJENIE: Napíš adresu a port do adresného riadku. Alebo vyber server z histórie a klikni na 'Pripojiť'
sl: ZA HITER DOSTOP: Vpišite naslov in vrata v naslovno vrstico. Ali izberite strežnik iz seznama zgodovine in pritisnite 'Vzpostavi povezavo'
sv: FÖR SNABB ANSLUT: Skriv adressen och porten i adressfältet. Eller välj en server från historiken ock klicka på 'Anslut'
uk: ДЛЯ ШВИДКОГО ПІД'ЄДНАННЯ: Введіть адресу і порт сервера в адресному рядку. Або виберіть сервер з історії останніх та натисніть кнопку 'Під'єднатися'

source: HELP
de: HILFE
et: ABI
hr: POMOĆ
hu: SEGÍTSÉG
it: AIUTO
ja: ヘルプ
lt: PAGALBA
lv: PALĪDZĪBA
mk: ПОМОШ
nl: HULP
pl: POMOC
pt_br: AJUDA
ro: AJUTOR
ru: ПОМОЩЬ
sk: POMOC
sl: POMOČ
sv: HJÄLP
uk: ДОПОМОГА

source: Refresh
de: Aktualisieren
et: Värskenda
hr: Osvježi
hu: Frissítés
it: Aggiorna
ja: リフレッシュ
lt: Atnaujinti
lv: Atjaunot
mk: Освежи
nl: Vernieuwen
pl: Odśwież
pt_br: Atualizar
ro: Reîmprospătează
ru: Обновить
sk: Obnoviť
sl: Osveži
sv: Uppdatera
uk: Оновити

source: Add Favorite
de: Favorit hinzufügen
et: Lisa lemmik
hr: Dodaj Favorite
hu: Hozzáadás a kedvencekhez
it: Aggiungi ai preferiti
ja: お気に入りに追加
lt: Pridėti prie mėgstamiausiųjų
lv: Pievienot Favorītiem
mk: Додај во Омилени
nl: Voeg Favoriet toe
pl: Dodaj do ulubionych
pt_br: Adicionar aos favoritos
ro: Adaugă la favorite
ru: Добавить в избранное
sk: Pridať Obľúbené
sl: Dodaj med priljubljene
sv: Lägg till favorit
uk: Вподобати

source: Connect
de: Verbinden
et: Ühenda
hr: Poveži
hu: Csatlakozás
it: Connettiti
ja: 接続する
lt: Prisijungti
lv: Vienoties
mk: Конектирај
nl: Verbinden
pl: Połącz
pt_br: Conectar
ro: Conectare
ru: Подключиться
sk: Pripojiť
sl: Poveži
sv: Anslut
uk: Під'єднатися

source: Server information
de: Serverinformationen
et: Serveri informatsioon
hr: Informacije servera
hu: Szerver információ
it: Informazioni Server
ja: サーバー情報
lt: Serverio informacija
lv: Servera informācija
mk: Информации за Серверот
nl: Server informatie
pl: Informacje o serwerze
pt_br: Informações do servidor
ro: Informații despre server
ru: Информация о сервере
sk: Informácie o serveri
sl: Informacije o strežniku
uk: Відомості про сервер

source: Search servers
de: Nach Servern suchen
et: Otsi servereid
hr: Pretraži servere
hu: Szerver keresés
it: Cerca server
ja: サーバを検索
lt: Ieškoti serverių
lv: Meklēt serverus
mk: Пребарување на сервери
nl: Zoek naar servers
pl: Wyszukaj serwery
pt_br: Procurar servidores
ro: Caută servere
ru: Поиск по серверам
sk: Vyhľadať servery
sl: Išči strežnike
sv: Sök server
uk: Пошук по серверам

source: Search players
de: Nach Spielern suchen
et: Otsi mängijaid
hr: Pretraži igrače
hu: Játékos keresés
it: Cerca giocatori
ja: プレイヤーを検索する
lt: Ieškoti žaidėjų
lv: Meklēt spēlētājus
mk: Пребарај играчи
nl: Zoek naar spelers
pl: Wyszukaj graczy
pt_br: Procurar jogadores
ro: Caută jucători
ru: Поиск по игрокам
sk: Vyhľadať hráčov
sl: Išči igralce
sv: Sök spelare
uk: Пошук по гравцям

source: Start search
de: Suche starten
et: Alusta otsingut
hr: Započni pretragu
hu: Keresés megkezdése
it: Inizia ricerca
ja: 検索開始
lt: Pradėti paiešką
lv: Sākt meklēt
mk: Почни со пребарување
nl: Start met zoeken
pl: Rozpocznij wyszukiwanie
pt_br: Iniciar procura
ro: Porneşte căutarea
ru: Начать поиск
sk: Začať hľadanie
sl: Začni z iskanjem
sv: Starta sökning
uk: Здійснити пошук

source: Search players...
de: Suche nach Spielernamen...
et: Otsi mängijaid...
hr: Pretraži igrače...
hu: Játékos keresése...
it: Ricerca giocatori...
ja: プレイヤー検索。。。
lt: Ieškoti žaidėjų...
lv: Meklēt spēlētājus...
mk: Пребарување на играчи...
nl: spelers zoeken...
pl: Wyszukaj graczy...
pt_br: Procurar jogadores...
ro: Caută jucători...
ru: Поиск по игрокам...
sk: Hľadať hráčov...
sl: Išči igralce...
sv: Sök spelare...
uk: Пошук по гравцям...

source: Search servers...
de: Suche nach Servernamen...
et: Otsi servereid...
hr: Pretraži poslužitelje...
hu: Szerver keresése...
it: Ricerca server...
ja: サーバーを検索する…
lt: Ieškoti serverių...
lv: Meklēt serverus...
mk: Пребарување на сервери...
nl: servers zoeken...
pl: Wyszukaj serwery...
pt_br: Procurar servidores...
ro: Caută servere...
ru: Поиск по серверам...
sk: Hľadať servery...
sl: Išči strežnike...
sv: Sök server...
uk: Пошук по серверам...

source: Name
et: Nimi
hr: Ime
hu: Név
it: Nome
ja: 名前
lt: Vardas
lv: Vārds
mk: Име
nl: Naam
pl: Nazwa
pt_br: Nome
ro: Nume
ru: Название
sk: Meno
sl: Ime
sv: Namn
uk: Назва

source: Players
de: Spieler
et: Mängijad
hr: Igrači
hu: Játékosok
it: Giocatori
ja: プレイヤー
lt: Žaidėjai
lv: Spēlētāji
mk: Играчи
nl: Spelers
pl: Gracze
pt_br: Jogadores
ro: Jucători
ru: Игроки
sk: Hráči
sl: Igralci
sv: Spelare
uk: Гравці

source: Ping
it: Latenza
lt: Delsa
lv: Pings
mk: Пинг
ru: Пинг
sv: Latens
uk: Пінг

source: Gamemode
et: Mängutüüp
hr: Gamemod
hu: Játékmód
it: Modalità
ja: ゲームモード
lt: Žaidimo tipas
lv: Gamemods
mk: Мод на Игра
nl: Spelmode
pl: Tryb gry
pt_br: Modo de jogo
ro: Mod de joc
ru: Игровой режим
sk: Herný mód
sl: Način igre
sv: Spelläge
uk: Ігровий режим

source: Player list
de: Spielerliste
et: Mängijate list
hr: Popis igrača
hu: Játékos lista
it: Elenco dei giocatori
ja: プレイヤーリスト
lt: Žaidėjų sąrašas
lv: Spēlētāju saraksts
mk: Листа на Играчи
nl: Speler lijst
pl: Lista graczy
pt_br: Lista de jogadores
ro: Listă cu jucători
ru: Список игроков
sk: Zoznam hráčov
sl: Seznam igralcev
sv: Spelarlista
uk: Список гравців

source: Include:
de: Filter:
et: Kaasa:
hr: Uključi:
hu: Tartalmazza:
it: Includi
ja: 含む:
lt: Įtraukti:
lv: Iekļaut:
mk: Вклучи:
nl: Toevoegen:
pl: Uwzględnij serwery:
pt_br: Incluir:
ru: Показать:
sk: Zahrnúť:
sl: Vključi:
sv: Inkludera:
uk: Показати:

source: Empty
de: Leer
et: Tühi
hr: Prazno
hu: Üres
it: Vuoti
ja: 空
lt: Tuščias
lv: Tukšs
mk: Празно
nl: Leeg
pl: Puste
pt_br: Vazio
ro: Goale
ru: Пустые
sk: Prázdny
sl: Prazno
sv: Tom
uk: Порожні

source: Full
de: Voll
et: Täis
hr: Pun
hu: Tele
it: Pieni
ja: 満杯
lt: Pilnas
lv: Pilns
mk: Полн
nl: Vol
pl: Pełne
pt_br: Cheio
ro: Pline
ru: Заполненные
sk: Plný
sl: Polno
uk: Переповнені

source: Locked
de: Passwortgeschützt
et: Lukus
hr: Zaključano
hu: Zárolt
it: Bloccati
ja: ロック中
lt: Užrakintas
lv: Slēgts
mk: Заклучен
nl: Vergrendeld
pl: Z hasłem
pt_br: Com senha
ro: Parolate
ru: Под паролем
sk: Na heslo
sl: Zaklenjeno
sv: Låst
uk: Запаролені

source: Offline
et: Offlain
hr: Neumreženo
it: Non in linea
ja: オフライン
lt: Išjungtas
lv: Nepieejams
mk: Офлајн
pl: Niedostępny
ru: Отключенные
sl: Brez povezave
uk: Відключені

source: Other Versions
de: Andere Version
et: Muud versioonid
hr: Ostale Verzije
hu: Egyéb verziók
it: Altre Versioni
ja: 他のバージョン
lt: Kitos Versijos
lv: Citas Versijas
mk: Други Верзии
nl: Andere Versies
pl: W innej wersji
pt_br: Outras versões
ro: Alte versiuni
ru: Другие версии
sk: Iné verzie
sl: Druge različice
sv: Andra Versioner
uk: Інші версії

source: Back
de: Zurück
et: Tagasi
hr: Prethodna
hu: Vissza
it: Indietro
ja: 戻る
lt: Atgal
lv: Atpakaļ
mk: Назад
nl: Terug
pl: Zamknij
pt_br: Voltar
ro: Înapoi
ru: Назад
sk: Späť
sl: Nazaj
sv: Tillbaka
uk: Назад

source: Help
de: Hilfe
et: Abi
hr: Pomoć
hu: Segítség
it: Aiuto
ja: ヘルプ
lt: Pagalba
lv: Palīdzība
mk: Помош
pl: Pomoc
pt_br: Ajuda
ro: Ajutor
ru: Помощь
sk: Pomoc
sl: Pomoč
sv: Hjälp
uk: Допомога

source: Loading...
de: Lade...
et: Laadimine...
hr: Učitavanje...
hu: Betöltés...
it: Caricamento...
ja: 読み込み中...
lt: Įkeliama...
lv: Ielādē...
mk: Се вчитува...
nl: Laden...
pl: Wczytywanie...
pt_br: Carregando...
ro: Se încarcă...
ru: Загрузка...
sk: Načítavanie...
sl: Nalaganje...
sv: Laddar...
uk: Завантаження...

source: ..loading..
de: ..Lade..
et: ..laadimine..
hr: ..učitavanje..
hu: ...betöltés...
it: ..caricamento..
ja: ..読み込み中..
lt: ..kraunama..
lv: ..ielādē..
mk: ~ ~ ..се вчитува...
nl: ..laden..
pl: ..wczytywanie..
pt_br: ..carregando..
ro: ..se încarcă..
ru: ..загрузка..
sk: ..načítavanie..
sl: ..nalaganje..
sv: ..laddar..
uk: ..завантаження..

source: No address specified!
de: Keine Adresse angegeben!
et: Aadressi pole määratud!
hr: Nije određena adresa!
hu: Nincs elérés megadva!
it: Nessun indirizzo specificato!
ja: アドレスが指定されていません！
lt: Nepateiktas adresas!
lv: Nav norādīta adrese!
mk: Ниедна адреса не беше спицифицирана!
nl: Geen adres geselecteerd!
pl: Nie podano adresu!
pt_br: O endereço não foi preenchido!
ro: Nicio adresă specificată!
ru: Адрес сервера не указан!
sk: Nebola zadaná adresa!
sl: Naslov ni naveden!
sv: Ingen adress angiven!
uk: Не вказано адресу сервера!

source: Unknown protocol
de: Unbekanntes Protokoll
et: Tundmatu protokoll
hr: Nepoznati protokol
hu: Ismeretlen protokoll
it: Protocollo sconosciuto!
ja: 不明なプロトコル
lt: Nežinomas protokolas!
lv: Nezināms protokols
mk: Непознат протокол
nl: Onbekend protocol
pl: Nieznany protokół
pt_br: Protocolo desconhecido
ro: Protocol necunoscut!
ru: Неизвестный протокол
sk: Neznámy protokol
sl: Neznan protokol
sv: Okänt protokoll
uk: Невідомий протокол

source: Please use the mtasa:// protocol!
de: Bitte nutze das mtasa:// Protokoll!
et: Palun kasuta mtasa:// protokolli!
hr: Molimo Vas da koristite mtasa:// protokol!
hu: Kérlek használd az mtasa:// protokoll-t!
it: Per favore usa il protocollo mtasa://
ja: 「mtasa://」プロトコルを使ってください！
lt: Prašome naudoti mtasa:// protokolą!
lv: Lūdzu izmantojiet mtasa:// protokolu!
mk: Ве молиме употребете го mtasa:// протоколот!
nl: Gebruik a.u.b. het mtasa:// protocol!
pl: Proszę użyć protokołu mtasa:// !
pt_br: Você esqueceu de usar o prefixo mtasa:// antes do IP!
ro: Te rugăm să folosești protocolul mtasa://
ru: Пожалуйста, используйте протокол mtasa://
sk: Prosím použi mtasa:// protokol!
sl: Prosimo uporabite mtasa:// protokol!
sv: Vänligen använd mtasa:// protokollet!
uk: Будь ласка, використовуйте протокол mtasa://

source: Information
et: Informatsioon
hr: Informacije
hu: Információ
it: Informazioni
ja: 情報
lt: Informacija
lv: Informācija
mk: Информации
nl: Informatie
pl: Informacja
pt_br: Informação
ro: Informaţii
ru: Информация
sk: Informácia
sl: Informacije
uk: Інформація

source: You have to select a server to connect to.
de: Du musst einen Server zum Verbinden auswählen.
et: Sa pead valima serveri millega ühenduda.
hr: Morate izabrati poslužitelj na koji ćete se povezati.
hu: Választanod kell egy szervert, ahová szeretnél csatlakozni.
it: Hai selezionato un server alla quale connetterti.
ja: サーバーを選んでください。
lt: Kad prisijungtumėte į serverį, jums reikia jį pasirinkti.
lv: Jums ir jāizvēlas serveris, pie kura pievienoties.
mk: Вие мора да селектирате сервер за да се конектирате на него.
nl: Je moet een server selecteren om mee te verbinden.
pl: Musisz wybrać serwer, z którym chcesz się połączyć.
pt_br: Você deve selecionar um servidor para se conectar.
ro: Trebuie să selectezi un server la care să te conectezi.
ru: Выберите сервер для подключения.
sk: Musíš zvoliť server na pripojenie.
sl: Izbrati morate strežnik.
sv: Du måste välja en server att ansluta till.
uk: Виберіть сервер для під'єднання.

source: SERVER IS FULL
de: SERVER IST VOLL
et: SERVER ON TÄIS
hr: POSLUŽITELJ JE POPUNJEN
hu: A SZERVER TELE VAN
it: IL SERVER È PIENO
ja: サーバーが満ちている
lt: SERVERIS PILNAS
lv: SERVERIS IR PILNS
mk: СЕРВЕРОТ Е ПОЛН
nl: SERVER IS VOL
pl: SERWER JEST PEŁEN
pt_br: SERVIDOR ESTÁ CHEIO
ro: SERVER PLIN
ru: СЕРВЕР ЗАПОЛНЕН
sk: SERVER JE PLNÝ
sl: STREŽNIK JE POLN
sv: SERVERN ÄR FULL
uk: СЕРВЕР ЗАПОВНЕНИЙ

source: Name:
et: Nimi:
hr: Naziv:
hu: Név:
it: Nome:
ja: 名前:
lt: Pavadinimas:
lv: Nosaukums:
mk: Име:
nl: Naam:
pl: Nazwa:
pt_br: Nome:
ro: Nume:
ru: Название:
sk: Názov:
sl: Ime:
sv: Namn:
uk: Назва:

source: Server Address:
de: Serveradresse:
et: Serveri aadress:
hr: Adresa Poslužitelja:
hu: Szerver elérése:
it: Indirizzo del server:
ja: サーバーアドレス:
lt: Serverio Adresas:
lv: Servera Adrese:
mk: Адреса на Серверот:
nl: Server Adres:
pl: Adres serwera:
pt_br: IP do servidor:
ro: Adresă server:
ru: Адрес сервера:
sk: Adresa servera:
sl: Naslov strežnika:
sv: Serveradress:
uk: Адреса сервера:

source: Gamemode:
et: Mängutüüp:
hr: Gamemod:
hu: Játékmód:
it: Modalità:
ja: ゲームモード
lt: Žaidimo Tipas:
lv: Gamemods:
mk: Мод на играта:
nl: Spelmode:
pl: Tryb gry:
pt_br: Modo de jogo:
ro: Mod de joc:
ru: Игровой режим:
sk: Herný mód:
sl: Način igre:
sv: Spelläge:
uk: Ігровий режим:

source: Map:
de: Karte:
et: Kaart:
hr: Mapa:
hu: Pálya:
it: Mappa:
ja: マップ:
lt: Žemėlapis:
lv: Mape:
mk: Мапа:
nl: Kaart:
pl: Mapa:
pt_br: Mapa:
ro: Hartă:
ru: Карта:
sk: Mapa:
sl: Mapa:
sv: Karta:
uk: Карта:

source: Players:
de: Spieler:
et: Mängijaid:
hr: Igrači:
hu: Játékosok:
it: Giocatori:
ja: プレイヤー:
lt: Žaidėjai:
lv: Spēlētāji:
mk: Играчи:
nl: Spelers:
pl: Gracze:
pt_br: Jogadores:
ro: Jucători:
ru: Игроки:
sk: Hráči:
sl: Igralci:
sv: Spelare:
uk: Гравці:

source: Passworded:
de: Passwortgeschützt:
et: Lukustatud:
hr: Zaključan:
hu: Jelszóval védve:
it: Password:
ja: パスワード:
lt: Yra Slaptažodis:
lv: Parole:
mk: Заштитено со пасворд:
nl: Wachtwoord:
pl: Hasło:
pt_br: Com senha:
ro: Parolat:
ru: Пароль:
sk: Zaheslované:
sl: Zaščiteno:
sv: Lösenord:
uk: Пароль:

source: Latency:
de: Latenz:
et: Latents:
hr: Latencija:
hu: Ping:
it: Latenza:
ja: レイテンシ
lt: Vėlavimas:
lv: Latensija:
mk: Пинг:
nl: Latentie:
pl: Ping:
pt_br: Latência:
ro: Latență:
ru: Задержка:
sk: Oneskorenie:
sl: Zakasnitev:
sv: Latenstid:
uk: Затримка:

source: Close
de: Schließen
et: Sulge
hr: Zatvori
hu: Bezárás
it: Chiudi
ja: 閉じる
lt: Uždaryti
lv: Aizvērt
mk: Затвори
nl: Sluiten
pl: Zamknij
pt_br: Fechar
ro: Închide
ru: Закрыть
sk: Zavrieť
sl: Zapri
sv: Stäng
uk: Закрити

source: Join Game
de: Spiel beitreten
et: Liitu mänguga
hr: Pristupi Igri
hu: Csatlakozás
it: Partecipa alla partita
ja: ゲームに参加する
lt: Prisijungti į žaidimą
lv: Pievienoties
mk: Приклучете се на играта
nl: Meedoen aan spel
pl: Dołącz do gry
pt_br: Entrar no jogo
ro: Intră în joc
ru: Подключиться
sk: Pripojiť do hry
sl: Pridruži se igri
sv: Gå med i spel
uk: Під'єднатися

source: Please enter the password to the server:
de: Bitte gib das Passwort für den Server ein:
et: Palun sisestage serveri salasõna:
hr: Unesite lozinku na poslužitelj:
hu: Adja meg a szerver jelszavát:
it: Per favore immetti la password per il server:
ja: サーバーのパスワードを入力してください:
lt: Pateikite serverio slaptažodį:
lv: Lūdzu ievadiet servera paroli:
mk: Ве молиме внесете го пасвордот на серверот:
nl: Geef het wachtwoord op naar de server:
pl: Proszę podać hasło do serwera:
pt_br: Digite a senha para se conectar ao servidor:
ro: Te rugăm introdu parola serverului:
ru: Введите пароль для входа на сервер:
sk: Prosím zadajte heslo pre tento server:
sl: Prosimo vnesite geslo za povezavo s strežnikom:
sv: Vänligen skriv serverlösenordet:
uk: Введіть пароль для входу на сервер:

source: Join the server as soon as a player slot is available.
de: Spiel beitreten, sobald ein Platz verfügbar ist.
et: Liitu serveriga esimesel võimalusel kui koht vabaneb.
hr: Pridruži se poslužitelju čim se oslobodi mjesto.
hu: Csatlakozás amint egy férőhely szabaddá válik.
it: Partecipa alla partita appena un posto diventa disponibile.
ja: スペースが空いたら、すぐに参加する。
lt: Prisijungti į serverį, kai tiktai atsiras vietos.
lv: Pievienoties serverim, kad tajā atbrīvojās brīva vieta.
mk: Приклучете се на серверот кога слободен слот ќе биде достапен.
nl: Verbind met de server zodra een speler slot beschikbaar is.
pl: Połącz z serwerem jak tylko będzie wolny slot.
pt_br: Entrar no servidor quando um jogador desconectar.
ro: Intră în joc imediat ce un slot este disponibil.
ru: Подключиться, как освободится место.
sk: Pripojiť na server hneď keď sa uvolní slot.
sl: Pridruži se strežniku takoj, ko bo na voljo prostor.
sv: Anslut till servern så fort det finns en ledig spelarplats.
uk: Під'єднатися, як звільниться місце.

source: PLEASE ENTER SERVER PASSWORD
de: BITTE GIB DAS SERVERPASSWORT EIN
et: PALUN SISESTA SERVERI SALASÕNA
hr: MOLIMO UNESITE LOZINKU POSLUŽITELJA
hu: ADJA MEG A SZERVER JELSZAVÁT
it: PER FAVORE IMMETTI LA PASSWORD DEL SERVER
ja: パスワードを入れてください
lt: PRAŠOME PATEIKTI SERVERIO SLAPTAŽODĮ
lv: LŪDZU IEVADIET SERVERA PAROLI
mk: ВЕ МОЛИМЕ ВНЕСЕТЕ ГО ПАСВОРДОТ НА СЕРВЕРОТ
nl: VOER SERVER WACHTWOORD IN
pl: PODAJ HASŁO SERWERA
pt_br: POR FAVOR DIGITE A SENHA DO SERVIDOR
ro: INTRODU PAROLA SERVERULUI
ru: ВВЕДИТЕ ПАРОЛЬ СЕРВЕРА:
sk: PROSÍM ZADAJ HESLO K SERVERU
sl: PROSIMO VNESITE GESLO STREŽNIKA
sv: VÄNLIGEN SKRIV SERVERLÖSENORDET
uk: ВВЕДІТЬ ПАРОЛЬ СЕРВЕРА:

source: Timed Out
de: Zeitüberschreitung
et: Ühendus aegus
hr: Isteklo Vrijeme Čekanja
hu: Időtúllépés
it: Scaduto
ja: タイムアウト
lt: Baigėsi laikas
lv: Noilgums
mk: Времето ви Истече
nl: Tijd Verlopen
pl: Upłynął limit czasu odpowiedzi
pt_br: O tempo de conexão expirou
ro: Sesiunea a expirat
ru: Время ожидания вышло
sk: Čas vypršal
sl: Povezava je potekla
sv: Tidsgräns överskriden
uk: Час очікування вийшов

source: Querying...
de: Abfrage läuft...
et: Päring...
hr: Pretraživanje...
hu: Lekérdezés…
it: Interrogazione in corso...
ja: 問い合わせています...
lt: Užklausiama...
lv: Pārbauda...
mk: Се бара...
nl: Opvragen…
pl: Odpytywanie...
pt_br: Consultando...
ro: Se procesează...
ru: Идет запрос...
sk: Zisťovanie...
sl: Poizvedovanje...
sv: Frågar...
uk: Йде запит...

source: Idle
de: Pausiert
et: Tegevuseta
hr: Mirovanje
hu: Tétlen
it: Inattivo
ja: 待機中です
lt: Neutralus
lv: Dīkstāve
mk: Неактивен
nl: Inactief
pl: Bezczynny
pt_br: Inativo
ro: Inactiv
ru: Неактивный
sk: Nečinný
sl: Nedejaven
sv: Inaktiv
uk: Неактивний

source: player
de: Spieler
et: mängija
hu: játékos
it: Giocatore
ja: プレイヤープレイヤー
lt: žaidėjas
lv: spēlētājs
mk: играч
nl: Speler
pl: gracz
pt_br: jogador
ro: jucător
ru: игрок
sk: hráčov
sl: igralcev
sv: spelare
uk: гравець

source: on
de: an
et: peal
hr: uključen
hu: és
ja: に
lt: įjungta
lv: uz
mk: на
nl: aan
pl: na
pt_br: em
ro: pornit
ru: на
sk: na
sl: na
sv: på
uk: на

source: server
hu: szerver
ja: サーバー
lt: serveris
lv: serveris
mk: сервер
pl: serwerze
pt_br: servidor
ru: сервере
sk: serverov
sl: na
uk: сервері
