Repository: multitheftauto/mtasa-blue
Catalog: Shared/data/MTA San Andreas/MTA/locale/*/client.po
Languages: de, et, hr, hu, it, ja, lt, lv, mk, nl, pl, pt_br, ro, ru, sk, sl, sv, uk

source: previous radio channel
de: Vorherigen Radiokanal
et: eelmine raadiojaam
hr: prethodni radio kanal
hu: előző rádió csatorna
it: stazione radio precedente
ja: 前のラジオチャンネル
lt: buvęs radijos kanalas
lv: iepriekšējā radio stacija
mk: минатиот радио канал
nl: vorige radio zender
pl: poprzedni kanał radiowy
pt_br: rádio anterior
ro: stația radio precedentă
ru: Пред. радиостанция
sk: predchádzajúce rádio stanica
sl: prejšnja radijska postaja
sv: Föregående radio kanal
uk: Поп. радіостанція

source: enables the radar view
de: Radar anzeigen
et: lubab kasutada radari vaadet
hr: omogučuje radarski prikaz
hu: radar nézet engedélyezés
it: abilità il radar
ja: ラダービューを有効
lt: įjungia radaro peržiūrą
lv: iespējo radara skatu
mk: вклучување на поглед на радар
nl: zet de radar zicht aan
pl: włącza widok radaru
pt_br: habilita o radar
ro: activează vederea radar
ru: Радар: Отобразить/Спрятать
sk: povolí radar
sl: omogoči radar
sv: Aktiverar radarläget
uk: Радар: Відобразити/Приховати

source: zooms the radar in
de: Im Radar reinzoomen
et: zoomib radarit sisse
hr: povećava prikaz radara
hu: nagyítás a radaron
it: aumenta lo zoom del radar
ja: ラダーをズームイン
lt: priartina radarą
lv: pietuvina radaru
mk: зумирајте го радарот
nl: zoomt de radar in
pl: przybliża radar
pt_br: amplia o radar
ro: măreşte radarul
ru: Радар: Приблизить
sk: priblíži radar
sl: približa radar
sv: zoomar in radarn
uk: Радар: Наблизити

source: zooms the radar out
de: Im Radar rauszoomen
et: zoomib radari välja
hr: smanjuje prikaz radara
hu: kicsinyítés a radaron
it: diminuisce lo zoom del radar
ja: ラダーをズームアウト
lt: patolina radarą
lv: attālina radaru
mk: одзумирајте го радарот
nl: zoomt de radar uit
pl: oddala radar
pt_br: diminui o radar
ro: micşorează radarul
ru: Уменьшить радар
sk: oddiali radar
sl: oddalji radar
sv: zoomar ut radarn
uk: Зменшити радар

source: moves the radar north
de: Das Radar nach Norden bewegen
et: liigutab radari põhja
hr: pomiče radar na sjever
hu: radar mozgatásra északi irányba
it: muove il radar a nord
ja: ラダーを北へ移動し
lt: pastumia radarą į šiaurę
lv: pārvieto radaru uz ziemeļiem
mk: преместете го радарот на север
nl: verplaatst de radar naar het noorden
pl: przesuwa radar na północ
pt_br: move o radar para o norte
ro: mișcă radarul către nord
ru: Радар: На север
sk: posunie radar severne
sl: premakne radar severno
sv: flyttar radarn norrut
uk: Радар: На північ

source: moves the radar south
de: Das Radar nach Süden bewegen
et: liigutab radarit lõunasse
hr: pomiče radar na jug
hu: radar mozgatása déli irányba
it: muove il radar a sud
ja: ラダーを南へ移動し
lt: pastumia radarą į pietus
lv: pārvieto radaru uz dienvidiem
mk: преместете го радарот на југ
nl: verplaatst de radar naar het zuiden
pl: przesuwa radar na południe
pt_br: move o radar para o sul
ro: mișcă radarul către sud
ru: Радар: На юг
sk: posunie radar južne
sl: premakne radar južno
sv: flyttar radarn söderut
uk: Радар: На південь

source: moves the radar east
de: Das Radar nach Osten bewegen
et: liigutab radarit itta
hr: pomiče radar na istok
hu: radar mozgatása keleti irányba
it: muove il radar ad est
ja: ラダーを東へ移動し
lt: pastumia radarą į rytus
lv: pārvieto radaru uz austrumiem
mk: преместете го радарот на исток
nl: verplaats de radar naar het oosten
pl: przesuwa radar na wschód
pt_br: move o radar para o leste
ro: mișcă radarul către est
ru: Радар: На восток
sk: posunie radar východne
sl: premakne radar vzhodno
sv: flyttar radarn öster
uk: Радар: На схід

source: moves the radar west
de: Das Radar nach Westen bewegen
et: liigutab radarit läände
hr: pomiče radar na zapad
hu: radar mozgatása nyugati irányba
it: muove il radar ad ovest
ja: ラダーを西へ移動し
lt: pastumia radarą į vakarus
lv: pārvieto radaru uz rietumiem
mk: преместете го радарот на запад
nl: verplaatst de radar naar het westen
pl: przesuwa radar na zachód
pt_br: move o radar para o oeste
ro: mișcă radarul către vest
ru: Радар: На запад
sk: posunie radar západne
sl: premakne radar zahodno
sv: flyttar radarn väster
uk: Радар: На захід

source: attaches the radar
de: Mit dem Radar dem Spieler folgen
et: kinnitab radari
hr: pridaje radar
hu: kövessen a radar
it: fissa il radar
ja: ラダーを添付する
lt: pritvirtina radarą
lv: piesaista radaru
mk: поставување на радар
nl: zet de radar vast
pl: zaczepia radar w danym punkcie
pt_br: vincula o radar
ro: ataşează radarul
ru: Радар: На себя
sk: pripojí radar
sl: pritrdi radar
sv: fäster radarn
uk: Радар: На себе

source: reduces radar opacity
de: Transparenz des Radars erhöhen
et: vähendab radari läbipaistvust
hr: smanjuje prozirnost radara
hu: radar homályosság csökkentése
it: riduce l'opacità del radar
ja: ラダー不透明を減る
lt: padidina radaro permatomumą
lv: samazina radara caurredzamību
mk: намалување на прозирноста на радарот
nl: Verlaagt de radar transparantie
pl: zmniejsza przezroczystość radaru
pt_br: reduz a opacidade do radar
ro: reduce opacitatea radarului
ru: Радар: Прозрачность —
sk: redukuje nepriehľadnosť radaru
sl: zmanjša motnost radarja
sv: minskar radar opacitet
uk: Радар: Прозорість —

source: increases radar opacity
de: Transparenz des Radars reduzieren
et: suurendab radari läbipaistvust
hr: povećava prozirnost radara
hu: radar homályosság növelése
it: aumenta l'opacità del radar
ja: ラダー不透明を増える
lt: sumažina radaro permatomumą
lv: palielina radara caurredzamību
mk: зголемување на прозирноста на радарот
nl: verlaagt de radar transparantie
pl: zwiększa przezroczystość radaru
pt_br: aumenta a opacidade do radar
ro: mărește opacitatea radarului
ru: Радар: Прозрачность +
sk: zvýši nepriehľadnosť radaru
sl: poveča motnost radarja
sv: ökar radar opacitet
uk: Радар: Прозорість +

source: toggles radar help text
de: Radarhilfe umschalten
et: lülitab radari abistava teksti
hr: uključuje/isključuje pomoćni tekst radara
hu: súgószöveg mutatása a radaron
it: mostra il testo d'aiuto del radar
ja: ラダーヘルプテキストを表示する
lt: įj/išj radaro pagalbos tekstą
lv: iespējo radara palīdzības tekstu
mk: менување на помошниот текст на радарот
nl: toont radar help tekst
pl: włącza/wyłącza opis opcji radaru
pt_br: ativa a janela de ajuda do radar
ro: comută textul de ajutor al radarului
ru: Радар: Вкл/откл помощь
sk: prepne zobrazenie pomocného textu
sl: vklopi pomoč za radar
sv: växlar radarhjälptext
uk: Радар: Вкл/викл допомогу

source: sends a message to the targetted player
de: Eine Nachricht an den Zielspieler schicken
et: saadab sõnumi märgistatud mängijale
hr: šalje poruku određenom igraču
hu: üzenet küldése a címzett játékosnak
it: invia un messaggio al giocatore sotto mira
ja: 選んだプレーヤーにメセージを送る
lt: išsiunčia žinutę pasirinktam žaidėjui
lv: nosūta ziņojumu mērķētajam spēlētājam
mk: праќање на порака до насочениот играч
nl: zend een bericht naar een bepaalde speler
pl: wysyła wiadomość do wybranego gracza
pt_br: envia uma mensagem a um jogador específico
ro: trimite un mesaj jucătorului specificat
ru: Сообщение выбранному игроку
sk: pošle správu označenému hráčovi
sl: pošlje sporočilo do izbranega igralca
sv: skickar ett meddelande till den angivna spelaren
uk: Повідомлення заданому гравцеві

source: changes to the next weapon whilst in a vehicle
de: In einem Fahrzeug die nächste Waffe auswählen
et: võtab järgmise relva autos olles
hr: mijenja na sljedeće oružje u vozilu
hu: következő fegyverre váltás járműben
it: cambia l'arma mentre si è alla guida
ja: 車に乗ってるとき、次の武器に変える。
lt: pakeičia į sekantį ginklą sėdint tr. priemonėje
lv: pārmaina uz nākošo ieroci atrodoties transportlīdzeklī
mk: промена на следното оружје додека сте во возило
nl: verander naar een volgend wapen wanneer je in een voertuig zit
pl: zmienia broń na następną w trakcie bycia w pojeździe
pt_br: próxima arma (veículo)
ro: schimbă la arma următoare în timp ce ești într-un vehicul
ru: Транспорт: След. оружие
sk: prepne na ďalšiu zbraň keď si vo vozidle
sl: premakne na naslednje orožje, ko ste v vozilu
sv: ändrar till nästa vapen när du är i ett fordon
uk: Транспорт: Наст. зброя

source: changes to the previous weapon whilst in a vehicle
de: In einem Fahrzeug die vorherige Waffe auswählen
et: võtab eelmise relva autos olles
hr: mijenja na prethodno oružje u vozilu
hu: előző fegyverre váltás járműben
it: Cambia arma mentre guidi con la precedente
ja: 車に乗ってるとき、前の武器に変える。
lt: pakeičia į buvusį ginklą sėdint tr. priemonėje
lv: pārmaina uz iepriekšējo ieroci atrodoties transportlīdzeklī
mk: промена на минатото оружје додека сте во возило
nl: verander naar een vorig wapen wanneer je in een voertuig zit
pl: zmienia broń na poprzednią w trakcie bycia w pojeździe
pt_br: arma anterior (veículo)
ro: schimbă la arma precedentă în timp ce ești într-un vehicul
ru: Транспорт: Пред. оружие
sk: prepne na predchádzajúcu zbraň keď si vo vozidle
sl: premakne na prejšnje orožje, ko ste v vozilu
sv: ändrar till det föregående vapnet inifrån fordonet
uk: Транспорт: Поп. зброя

source: outputs info about the current server
de: gibt Informationen über den aktuellen Server aus
hr: izbacuje informacije o trenutnom serveru
hu: kimenő információ az aktuális szerverről
ja: 現在にいるサーバーの情報をアウトプット
lt: parašo informaciją apie dabartinį serverį
mk: надворешна информација за моменталниот сервер
nl: toont informatie omtrent de huidige server
pl: wyświetla informacje o aktualnym serwerze
pt_br: mostra informações sobre o servidor
ro: afișează informații despre serverul curent
ru: Отобразить информацию о сервере
uk: Відобразити відомості про сервер

source: defines the scale multiplier of all text-displays
de: Definiert den Vergrößerungsmultiplikator aller Textanzeigen
et: defineerib suuruse korrutise tekstidele
hr: definira skalu multiplikatora svih tekst-prikaza
hu: beállítja a képernyőn megjelenő összes szöveg méretét
it: definisce la scala di tutti i testi sul display
ja: テキストのスケールマルチプライヤの設定
lt: nustato dydžio daugiklį visiems tekstiniams rodmenims
lv: definē mērogu reizinātāju visiem attēlotajiem tekstiem
mk: дефинициски мултипликатор на скала на сите текстуални прилози
nl: bepaald de schaal vermenigvuldiger van alle tekst-voorstellingen
pl: ustawia mnożnik skalowania dla wszystkich wyświetlanych treści tekstowych
pt_br: define a escala de todos os textos a serem mostrados na tela
ro: definește multiplicatorul de scară al tuturor afișajelor de text
ru: Определение масштаба отображения текста
sk: definuje násobič mierky všetkých textových zobrazení
sl: določi velikost vseh polj z besedilom
sv: definierar skalningsmultiplikatorn av all text
uk: Визначення масштабу відображення тексту

source: (Development mode) shows the colshapes
de: (Entwicklungsmodus) Zeigt Colshapes an
et: (Arendus mood) näitab jooniseid
hr: (Razvojni način) prikazuje colshapeove
hu: (Fejlesztői mód) colshapes-ek megjelenítése
it: (modalità sviluppo) mostra le colshapes
ja: （デベロップメントモード）コリジョンを表示
lt: (Derinimo režimas) rodo 'colshapes'
lv: (Izstrādātāja režīms) attēlo colshapes
mk: (Девелоперски мод) прикажување на фигури
nl: (Ontwikkelingsmodus) toont alle colvormen
pl: (Tryb dewelopera) pokazuje colshape'y
pt_br: (Modo de desenvolvimento) mostra os colshapes
ro: (Mod de dezvoltare) afișează toate poliedrele de coliziune
ru: (Режим разработки) показывать colshapes
sk: (Vývojársky mód) zobrazí col tvary
sl: (Razvojni način) pokaže colshapes
sv: (Utvecklingsläge) visar colshapes
uk: (Режим розробки) показувати colshapes

source: (Development mode) prints world sound ids into the debug window
de: (Entwicklungsmodus) gibt world sound ids im Debugfenster aus
et: (Arendus mood) näitab maailma helide id-si debug aknas
hr: (Razvitak) prikazuje colshapeove
hu: (Fejlesztői mód) kiírja az alap játék hangjainak azonosítóját a debug chatbe
it: (modalità sviluppo) immette i suoni del mondo nella finestra di debug
ja: （デベロップメントモード）世界の音IDをデバッグウインドウにアウトプットする
lt: (Derinimo režimas) parašo pasaulio garsų id į derinimo langą
lv: (Izstrādātāja režīms) attēlo pasaules skaņas id iekš atkļūdošanas loga
mk: (Девелоперски мод) светски отпечатоци за музика во дебугиран прозорец
nl: (Ontwikkelingsmodus) toont geluid-ids in een debug venster
pl: (Tryb dewelopera) wyświetla identyfikatory dźwięków gry w okienku debug
pt_br: (Modo de desenvolvimento) mostra o ID dos sons do ambiente no painel de depuração
ro: (Mod de dezvoltare) afișează numărul de identificare al sunetelor în fereastra de depanare
ru: (Режим разработки) писать идентификаторы игровых звуков в окно отладчика
sk: (Vývojársky mód) zobrazí id svetových zvukov v okne debugu
sl: (Razvojni način) kopira isd zvok sveta v okno odpravljalca napak
sv: (Utvecklingsläge) skriver ut världs ljud ids till felsökningsvyn
uk: (Режим розробки) писати ідентифікатори ігрових звуків в вікно налагоджувача

source: Entering the game ...
de: Spiel wird betreten...
et: Sisenen mängu ...
hr: Ulazak u igru ...
hu: Belépés a játékba ...
it: Entrando nel gioco...
ja: 参加中。。。
lt: Įeinama į žaidimą ...
lv: Ieiet spēlē ...
mk: Влегување во игра ...
nl: Spel aan het joinen ...
pl: Wchodzę do gry ...
pt_br: Entrando no jogo ...
ro: Se intră în joc ...
ru: Подключение к серверу ...
sk: Vstupujem do hry...
sl: Vstopam v igro...
sv: Går med i spelet...
uk: Під'єднання до сервера ...

source: Not connected; please use Quick Connect or the 'connect' command to connect to a server.
de: Nicht verbunden. Bitte verwende den Serverbrowser oder den 'connect' Befehl um zu einem Server zu verbinden.
et: Pole ühendatud: palun kasutage Loo Ühendus või "Ühenda" käsku, et liituda serveriga.
hr: Nije spojeno: molimo koristite Brzo Povezivanje ili 'poveži' naredbu za spajanje na poslužitelj.
hu: Nem csatlakozott; Használd a Gyors csatlakozás, illetve a 'csatlakozás' gombot.
it: Non connesso; per favore usa la connessione rapida o il comando 'connettiti' per connetterti ad un server.
ja: 接続していません；「クイックコネクト」や「connect」コマンドを利用して、サーバーに参加してください。
lt: Neprisijungta; prašome naudoti Jungtis arba komandą 'connect', kad prisijungtumėte į serverį.
lv: Nepieslēdzās; līdzu izmantojiet Ātro Savienojumu vai 'connect' komandu, lai pieslēgtos serverim.
mk: Не сте конектирани; ве молиме употребете ја Брзо Вклучување или 'вклучување' командата за да се вклучите во серверот.
nl: Niet verbonden; gelieve Quick Connect of het 'connect' commando te gebruiken om te verbinden met een server.
pl: Nie połączono; użyj Szybkiego Łączenia lub komendy 'connect' aby połączyć się z serwerem.
pt_br: Não foi possível conectar. Use a opção Conexão Rápida ou o comando 'connect' para se conectar a um servidor.
ro: Neconectat; te rugăm folosește conectarea rapidă sau comanda 'connect' pentru a te conecta la un server.
ru: Не подключен; пожалуйста, используйте ПОДКЛЮЧЕНИЕ или команду 'connect', чтобы зайти на сервер.
sk: Nepripojené; použi prosím Rýchle pripojenie alebo príkaz 'connect' pre pripojenie k serveru.
sl: Niste povezani; prosimo uporabite Hitra vzpostavitev povezave ali ukaz 'poveži' da se povežete na strežnik.
sv: Inte ansluten; var vänlig använd Snabb Anslutning eller 'connect' kommandot för att ansluta till en server.
uk: Немає під'єднання; будь ласка, використовуйте ПІД'ЄДНАННЯ або команду 'connect', щоб зайти на сервер.

source: The server is not installed
de: Der Server ist nicht installiert
et: Server ei ole installeeritud
hr: Poslužitelj nije instaliran
hu: A szerver nincs telepítve
it: Il server non è installato
ja: サーバーがインストールしていません
lt: Serveris neįdiegtas
lv: Serveris nav instalēts
mk: Серверот не е инсталиран
nl: De server is niet geïnstalleerd
pl: Nie zainstalowano aplikacji serwera
pt_br: Os componentes do servidor não foram instalados.
ro: Serverul nu este instalat
ru: Сервер не установлен
sk: Server nie je inštalovaný
sl: Strežnik ni nameščen
sv: Servern är inte installerad
uk: Сервер не встановлено

source: Local Server
de: Lokaler Server
et: Kohalik server
hr: Lokalni Poslužitelj
hu: Helyi szerver
it: Server Locale
ja: ローカルサーバ
lt: Vietinis Serveris
lv: Lokālais Serveris
mk: Локален Сервер
nl: Lokale Server
pl: Serwer lokalny
pt_br: Servidor Local
ro: Server local
ru: Локальный Сервер
sk: Lokálny server
sl: Lokalni strežnik
sv: Lokal Server
uk: Локальний Сервер

source: Starting local server ...
de: Lokaler Server wird gestartet...
et: Käivitan kohalikku serverit ...
hr: Pokretanje lokalnog poslužitelja ...
hu: Helyi szerver indítása ...
it: Avvio del server locale...
ja: ローカルサーバをスタートしています。。。
lt: Paleidžiamas vietinis serveris ...
lv: Startē lokālo serveri ...
mk: Започнување на локален сервер ...
nl: Lokale server aan het starten ...
pl: Uruchamiam serwer lokalny ...
pt_br: Iniciando servidor local ...
ro: Se pornește serverul local ...
ru: Запуск локального сервера ...
sk: Spúšťam lokálny server...
sl: Zaganjanje lokalnega strežnika ...
sv: Startar lokal server ...
uk: Запуск локального сервера ...

source: You were kicked from the game ( %s )
de: Du wurdest aus dem Spiel geworfen ( %s )
et: Teid visati mängust välja ( %s )
hr: Izbačeni ste iz igre ( %s )
hu: Ki lettél rúgva a játékból ( %s )
it: Sei stato espulso dalla partita (%s)
ja: ゲームからキックされました （理由： %s）
lt: Jūs buvote išmestas iš žaidimo ( %s )
lv: Jūs tikāt izmests no spēles ( %s )
mk: Вие сте кикнати од играта ( %s)
nl: U werd uit het spel gegooid ( %s )
pl: Zostałeś wyrzucony z gry ( %s )
pt_br: Você foi expulso do jogo ( %s )
ro: Ai fost dat afară din joc (%s)
ru: Вас кикнули с сервера ( %s )
sk: Bol si vyhodený z hry ( %s )
sl: Bil si brcnjen iz igre ( %s )
sv: Du blev utsparkad från spelet ( %s )
uk: Вас кікнулі з сервера ( %s )

source: Connecting to local server...
de: Verbinde zu lokalem Server...
et: Ühendan kohaliku serveriga...
hr: Povezivanje na lokalni poslužitelj...
hu: Csatlakozás a helyi szerverhez...
it: Connessione al server locale...
ja: ローカルサーバーに接続中...
lt: Jungiamasi prie vietinio serverio...
lv: Savienojās ar lokālo serveri...
mk: Конектирање на локален сервер...
nl: Verbinden met lokale server...
pl: Łączę się z serwerem lokalnym...
pt_br: Conectando ao servidor local...
ro: Se conectează la serverul local...
ru: Соединение с локальным сервером...
sk: Pripájam sa k lokálnemu serveru...
sl: Vzpostavljam povezavo z lokalnim strežnikom...
sv: Ansluter till lokal server...
uk: З'єднання з локальним сервером...

source: Error connecting to server.
de: Fehler beim Verbinden zum Server.
et: Viga serveriga ühendusmisel.
hr: Greška prilikom spajanja na poslužitelj.
hu: Hiba történt a szerverre csatlakozás közben.
it: Errore durante la connessione al server.
ja: サーバ接続中にエラー。
lt: Klaida jungiantis prie serverio.
lv: Kļūda savienojoties ar serveri.
mk: Погрешно конектирање на серверот.
nl: Fout bij het verbinden met de server.
pl: Błąd podczas łączenia z serwerem.
pt_br: Erro ao conectar ao servidor.
ro: Eroare la conectarea la server.
ru: Ошибка подключения к серверу.
sk: Chyba pri pripájaní na server.
sl: Napaka pri vzpostavljanju povezave s strežnikom.
sv: Fel vid anslutning till servern.
uk: Помилка під'єднання до сервера.

source: Connecting to local server timed out. See console for details.
de: Zeitüberschreitung beim Verbinden zum lokalen Server. Siehe Konsole für weitere Details.
et: Ühendamine lokaalse serveriga aegus. Vaata konsooli, et näha rohkem informatsiooni.
hr: Povezivanje sa lokalnim poslužiteljem isteklo. Pogledajte konzolu za detalje.
hu: Időtúllépés miatt a csatlakozás megszakadt. Adatokért nyisd meg a konzolt.
it: Connessione al server locale scaduta. Consultare la console per i dettagli.
ja: ローカルサーバの接続がタイムアウトしてしまいました。情報はコンソールにあります。
lt: Prisijungimui prie vietinio serverio baigėsi laikas. Pažvelkite į konsolę detalėms sužinoti.
lv: Savienošanās ar lokālo serveri iztecēja. Apskaties konsoli priekš detaļām.
mk: Конектирањето на локален сервер е прекинат.Проверете ја конзолата за детали.
nl: Verbinden met de lokale server duurde te lang. Zie console voor details.
pl: Upłynął limit czasu podczas łączenia się z lokalnym serwerem. Sprawdź konsolę aby dowiedzieć się więcej.
pt_br: Conexão ao servidor local expirou. Veja o console para mais detalhes.
ro: Conectarea la serverul local a expirat. Vezi consola pentru detalii.
ru: Время подключение к локальному серверу истекло. Откройте консоль, чтобы узнать подробности.
sk: Čas pripájania k lokálnemu serveru vypršal. Pre viac informácií sa pozri do konzoly.
sl: Vzpostavljanje povezave s strežnikom je poteklo. Glej konzolo za podrobnosti.
sv: Anslutning till lokal server avbröts. Kolla konsolen för mer detaljer.
uk: Час під'єднання до локального серверу минув. Відкрийте консоль, щоб дізнатися подробиці.

source: Connection with the server was lost
de: Verbindung zum Server verloren
et: Ühendus serveriga katkes
hr: Veza sa poslužiteljem se prekinula!
hu: A kapcsolat megszakadt a szerverrel
it: La connessione col server è stata persa
ja: サーバとの接続が失われました
lt: Prisijungimas su serveriu prarastas
lv: Savienojums ar serveri pazuda
mk: Конекцијата со серверот е прекината
nl: Verbinden met de server werd verloren
pl: Utracono połączenie z serwerem
pt_br: A conexão com o servidor foi perdida
ro: Conexiunea cu serverul s-a pierdut
ru: Соединение с сервером потеряно
sk: Spojenie zo serverom bolo stratené
sl: Povezava s strežnikom je bila izgubljena
sv: Anslutningen till servern gick förlorad
uk: З'єднання з сервером втрачено

source: Disconnected: the server is currently full
de: Verbindung getrennt: Der Server ist voll
et: Ühendus katkestati: server on täis
hr: Odspojeni: server je trenutno pun
hu: Lecsatlakozva: a szerver jelenleg tele van
it: Disconnesso: il server attualmente è pieno
ja: 切断：サーバは現在満ちています
lt: Atjungta: serveris šiuo metu yra pilnas
lv: Atslēgšanās: serveris šobrīd ir pilns
mk: Дисконектиран: серверот моментално е полн
nl: Verbinding verbroken: de server zit momenteel vol
pl: Rozłączono: serwer jest obecnie pełny
pt_br: Desconectado: o servidor está cheio
ro: Deconectat: serverul este momentan plin
ru: Отключение: сервер переполнен.
sk: Odpojené: server je momentálne plný
sl: Povezava prekinjena: strežnik je trenutno poln
sv: Frånkopplad: servern är för närvarande full
uk: Від'єднання: сервер переповнений.

source: Disconnected: invalid password specified
de: Verbindung getrennt: Ungültiges Passwort angegeben
et: Ühendus katkestatud: vale salasõna
hr: Odspojeni: nevažeća lozinka određena
hu: Lecsatlakozva: helytelen jelszó
it: Disconnesso: password specificata invalida
ja: 接続切断：パスワードは正しくありません。
lt: Atjungta: pateiktas neteisingas slaptažodis
lv: Atslēgšanās: norādīta nederīga parole
mk: Дисконектиран: пасвордот е погрешен
nl: Verbinding verbroken: verkeerd paswoord ingevoerd
pl: Rozłączono: podano nieprawidłowe hasło
pt_br: Desconectado: senha inválida
ro: Deconectat: parola specificată este invalidă
ru: Отключение: неверный пароль
sk: Odpojené: zadané nesprávne heslo
sl: Povezava prekinjena: določeno napačno geslo
sv: Frånkopplad: ogiltigt lösenord angivet
uk: Від'єднання: невірний пароль

source: MTA Client verification failed!
de: Verifikation des MTA Clients fehlgeschlagen!
et: MTA Kliendi auditeerimine ebaõnnestus!
hr: Potvrda MTA klijenta neuspjela!
hu: MTA kliens ellenőrzése nem sikerült!
it: Verifica del Client MTA fallita!
ja: MTAクライアント確認失敗！
lt: MTA kliento patvirtinimas nepavyko!
lv: MTA Klineta pārbaude neizdevās!
mk: MTA Клиент верификацијата е неуспешна!
nl: MTA Client verificatie mislukt!
pl: Błąd! Weryfikacja klienta MTA:SA się nie powiodła!
pt_br: Verificação ao cliente do MTA falhou!
ro: Verificarea clientului MTA a eșuat!
ru: Проверка клиента MTA не удалась!
sk: Overenie MTA Klienta zlyhalo!
sl: Preverjanje MTA klienta se je izjalovilo!
sv: MTA Klientverifikation misslyckades!
uk: Перевірка клієнта MTA не вдалася!

source: HOST GAME
de: SPIEL HOSTEN
et: LOO MÄNG
hr: POKRENI IGRU
hu: SZERVER INDÍTÁS
it: OSPITA PARTITA
ja: ゲームホストする
lt: SUKURTI SERVERĮ
lv: HOSTĒT SPĒLI
mk: ХОСТИРАЊЕ ИГРА
nl: HOST SPEL
pl: UTWÓRZ SERWER
pt_br: CRIAR UM SERVIDOR
ro: GĂZDUIRE JOC
ru: СОЗДАТЬ СЕРВЕР
sk: VYTVORIŤ HRU
sl: GOSTUJ IGRO
sv: SKAPA SPEL
uk: СТВОРИТИ СЕРВЕР
