Repository: multitheftauto/mtasa-blue
Catalog: Shared/data/MTA San Andreas/MTA/locale/*/client.po
Languages: de, et, hr, hu, it, ja, lt, lv, mk, nl, pl, pt_br, ro, ru, sk, sl, sv, uk

source: Screen upload is required by some servers for anti-cheat purposes. (The chat box and GUI is excluded from the upload)
de: Screenshotupload wird von einigen Servern zur Erkennung von Cheats benötigt. (Die Chatbox und andere GUIs werden nicht hochgeladen)
et: Pildi üleslaadimine on nõutud osade serverite poolt anti-cheat eesmärgil. (Chat ja lahtiolevad aknad ei kuulu üleslaadimisele)
hr: Upload zaslona je potreban za neke poslužitelje zbog anti-cheat razloga. (Chat i grafičko sučelje nisu uključeni u upload)
hu: Screenshot feltöltés szükséges egyes szerverek anti-cheat rendszere miatt. (A chat box és a GUI nem lesz rajta a képen)
it: L'upload dello schermo è richiesto da alcuni server per ragioni anti-cheat. (Chat Box e GUI sono eslcusi dall'upload)
ja: 時々、スクリーンのアップロードが必要です。これはアンチチートのためです。 （チャットボックスとGUIがアップロードに除外されています）
lt: Ekrano siuntimas yra reikalaujamas kai kuriuose serveriuose dėl sukčiavimo susekimo. (Kalbėjimo langas ir GUI yra neįtraukiamas į nuotrauką)
lv: Ekrāna augšupielāde ir dažos serveros nepieciešama kā anti-chear līdzeklis. (Sarakste un GUI logi netiek attēloti augšupielādēs)
mk: Аплоадирање на слика е задолжително од некои сервери поради анти-читерски потреби. (Чат прозорчето и GUI е исклучено од аплоадирањето)
nl: Het uploaden van je scherm is soms vereist in servers omdat ze anti-cheat programma's hebben. (De chat box en GUI worden niet geüpload)
pl: Wgrywanie zrzutów ekranów jest wymagane przez niektóre serwery na potrzeby funkcji Anti-Cheat. (Okna czata i GUI nie są umieszczane na zrzutach ekranu)
pt_br: Habilitar o envio de capturas de tela é requisitado por alguns servidores em razão de prevenir trapaças durante as partidas. (Lembrando que o chat e o GUI (janelas do MTA) não são incluídos na captura de tela)
ro: Trimiterea capturilor de ecran este necesară pentru anumite servere din motive anti-cheat. (Fereastra de chat și GUI-ul sunt excluse din captură)
ru: Загрузка скриншотов требуется многими серверами для анти-чит системы. (Область чата и элементы интерфейса будут скрыты)
sk: Upload obrazovky je vyžadovaný niektorými servermi pre anti-cheat ochranu. (Chat a GUI nie sú súčasťou uploadu)
sl: Nalaganje zaslona je potrebno na nekaterih strežnikih za protigoljufijske namene. (Klepet in GUI sta izključena iz nalaganja)
sv: Bilduppladdning krävs av en del servrar för anti-fusk ändamål. (Chattruta och GUI kommer inte att laddas upp)
uk: Завантаження знімків вимагається багатьма серверами для античит системи. (Область чату і елементи інтерфейсу будуть приховані)

source: SCREEN UPLOAD INFORMATION
de: SCREENSHOT UPLOAD INFORMATION
et: PILDI ÜLESLAADIMISE INFORMATSIOON
hr: INFORMACIJA UPLOAD-a ZASLONA
hu: KÉP FELTÖLTÉSÉNEK INFORMÁCIÓI
it: INFORMAZIONI UPLOAD SCHERMO
ja: スクリーンアップロード情報
lt: EKRANO ĮKĖLIMO INFORMACIJA
lv: EKRĀNA AUGŠUPIELĀDES INFORMĀCIJA
mk: Информации за аплоадирањето на слика
nl: SCHERM UPLOAD INFORMATIE
pl: INFORMACJA - ZRZUTY EKRANU
pt_br: INFORMAÇÃO SOBRE O ENVIO DE CAPTURAS DE TELA
ro: INFORMAŢII CAPTURĂ DE ECRAN
ru: ИНФОРМАЦИЯ О ЗАГРУЗКЕ СКРИНШОТОВ
sk: INFORMÁCIE O UPLOADE OBRAZOVKY
sl: INFORMACIJE O NALOŽENEM ZASLONU
sv: BILDUPPLADDNING INFORMATION
uk: ІНФОРМАЦІЯ ПРО ЗАВАНТАЖЕННЯ ЗНІМКІВ

source: Some files in your GTA:SA data directory are customized. MTA will only use these modified files if this check box is ticked. However, CUSTOMIZED GTA:SA FILES ARE BLOCKED BY MANY SERVERS Are you sure you want to use them?
de: Einige Dateien in deinem GTA:SA Datenverzeichnis wurden modifiziert. MTA wird diese veränderten Dateien nur nutzen, wenn diese Checkbox ausgewählt wurde. VERÄNDERTE GTA:SA DATEIEN WERDEN JEDOCH AUF VIELEN SERVERN BLOCKIERT Bist du sicher, dass du sie dennoch nutzen möchtest?
et: Mõned failid sinu GTA:SA kaustas on muudetud. MTA kasutab neid faile kui see kast on valitud. Kuid, MUUDETUD FAILID ON KEELATUD PALJUDES SERVERITES Old kindel, et soovid neid kasutada?
hr: Neki fajlovi u vašem GTA:SA direktoriju podataka su promijenjeni. MTA će samo koristiti te promijenjene fajlove ako je ovaj potvrdni okvir označen. Međutim, PROMIJENJENI GTA:SA FAJLOVI SU BLOKIRANI OD VEĆINE SERVERA Jeste li sigurni da ih želite koristiti?
hu: Néhány fájl a GTA:SA mappádban átlett alakítva. Az MTA csak akkor fogja ezeket használni, ha engedélyt adsz rá. Mindenesetre, az átalakított GTA:SA fájlok tiltva vannak rengeteg szerver által Biztos vagy benne hogy használatba veszed őket?
it: Alcuni file nella tua cartella di GTA:SA sono personalizzati. MTA utilizzerà questi file modificati solamente se questa casella sarà spuntata. Tuttavia, I FILE PERSONALIZZATI DI GTA:SA SONO BLOCCATI IN MOLTI SERVER Sei sicuro di volerli utilizzare?
ja: GTA:SAは変更されています。 このチェックボックスを有効にすると、変更されたGTA:SAが利用できます。 しかし、変更されたGTA:SAは多くのサーバにより利用禁止(BAN対象)となっています。 このファイルを利用しますか？
lt: Kai kurie failai šio GTA:SA data aplanko vietoje yra pakeisti. MTA naudos šiuos failas tik jei yra pasirinktas bylų modifikavimas. Tačiau, PAKEISTOS GTA:SA BYLOS YRA BLOKUOJAMOS DAUGELIO SERVERIŲ Ar tikrai norite jas naudoti?
lv: Daži faili iekš Jūsu GTA:SA datu mapē ir laboti. MTA izmantos tikai šos failus, ja šī rūtiņa ir ieķeksēta. Jebkurā ziņā, LABOTI GTA:SA FAILI IR BLOĶĒTI VAIRĀKOS SERVEROS Vai Jūs tik tiešām vēlaties izmantot?
mk: Некои фајлови во вашата GTA:SA дата фолдер се модифицирани. MTA ќе ги употреби тие модифицирани фајлови само ако ова правоаголниче е штиклирано. Како и да е, МОДИФИЦИРАНИ GTA:SA ФАЈЛОВИ СЕ БЛОКИРАНИ ОД ПОВЕЌЕТО СЕРВЕРИ Дали сте сигурни дека сакате да ги употребите?
nl: Sommige bestanden in uw GTA:SA data map zijn gewijzigd. MTA zal alleen gebruik maken van deze gewijzigde bestanden als dit vakje is aangevinkt. Echter, GEWIJZIGDE GTA:SA BESTANDEN ZIJN GEBLOKEERD DOOR VEEL SERVERS Weet u zeker dat u ze wilt gebruiken?
pl: Wykryto, że niektóre pliki w Twojej instalacji gry są zmodyfikowane. MTA użyje tych plików tylko wtedy, gdy to pole wyboru jest zaznaczone. Pamiętaj jednak, że WIELE SERWERÓW BLOKUJE ZMODYFIKOWANE PLIKI Czy na pewno chcesz z nich korzystać?
pt_br: Alguns arquivos da pasta do GTA:SA estão modificados. O MTA só irá ler-los se este item estiver marcado. Entretanto, ESSA PRÁTICA NÃO É AUTORIZADA POR MUITOS SERVIDORES Você tem certeza que deseja mantê-los?
ro: Unele fișiere din directorul tău de date GTA:SA sunt modificate. MTA va folosi fișierele modificate dacă această casetă este selectată. Totuși, FIȘIERELE GTA:SA MODIFICATE SUNT BLOCATE DE MULTE SERVERE Ești sigur că vrei să le folosești?
ru: Некоторые файлы в директории GTA:SA изменены. MTA будет использовать эти файлы, если соответствующий параметр активирован. Тем не менее, модифицированные файлы блокируются большинством серверов Вы действительно хотите использовать их?
sk: Niektoré súbory vo vašom GTA:SA priečinku sú upravené. MTA bude používať tieto upravené súbory len ak bude tento štvorec začiarknutý. Nakoľko, UPRAVENÉ GTA:SA SÚBORY SÚ BLOKOVANÉ NA MNOHO SERVEROCH Ste si istý že chcete tieto súbory používať?
sl: Nekatere datoteke v vaši GTA:SA mapi so spremenjene. MTA jih bo uporabil samo, če je to potrditveno polje označeno. SPREMENJENE GTA:SA DATOTEKE SO BLOKIRANE NA VEČ STREŽNIKIH Ali ste prepričani da jih želite uporabiti?
sv: Vissa filer i din GTA:SA datakatalog är anpassade. MTA kommer endast att använda dessa modifierade filer ifall den här checkboxen är ikryssad. Emellertid, ANPASSADE GTA:SA FILER ÄR BLOCKERADE AV MÅNGA SERVRAR Är du säker på att du vill använda dem?
uk: Деякі файли в директорії GTA:SA змінені. MTA буде використовувати ці файли, якщо відповідний налаштунок активований. Проте, модифіковані файли блокуються більшістю серверами Ви дійсно хочете використати їх?

source: CUSTOMIZED GTA:SA FILES
de: VERÄNDERTE GTA:SA DATEIEN
et: MUUDETUD GTA:SA FAILID
hr: PROMIJENJENE GTA:SA DATOTEKE
hu: ÁTALAKÍTOTT GTA:SA FÁJLOK
it: FILE PERSONALIZZATI DI GTA:SA
ja: 変更されたGTA:SAのファイル
lt: PAKEISTOS GTA:SA BYLOS
lv: PĀRVEIDOTIE GTA:SA FAILI
mk: МОДИФИЦИРАНИ GTA:SA ФАЈЛОВИ
nl: GEWIJZIGDE GTA:SA BESTANDEN
pl: ZMODYFIKOWANE PLIKI GTA:SA
pt_br: ARQUIVOS MODIFICADOS DO GTA:SA
ro: FIȘIERE GTA:SA MODIFICATE
ru: МОДИФИЦИРОВАННЫЕ ФАЙЛЫ GTA:SA
sk: UPRAVENÉ GTA:SA SÚBORY
sl: SPREMENJENE GTA:SA DATOTEKE
sv: ANPASSADE GTA:SA-FILER
uk: МОДИФІКОВАНІ ФАЙЛИ GTA:SA

source: Please enter a nickname
de: Bitte gib einen Nicknamen ein
et: Palun sisesta mängunimi
hr: Molimo unesite nadimak
hu: Kérlek adj meg egy felhasználónevet!
it: Per favore inserisci un nickname
ja: ニックネームを入れてください
lt: Prašome įvesti slapyvardį
lv: Lūdzu ievadiet segvārdu
mk: Ве молиме внесете име
nl: Gelieve een gebruikersnaam in te vullen
pl: Podaj nick
pt_br: Por favor coloque um apelido
ro: Vă rugăm introduceți un nume
ru: Введите никнейм
sk: Zadajte prosím prezývku
sl: Prosimo vnesite vzdevek
sv: Ange ett användarnamn
uk: Введіть нікнейм

source: Please enter a nickname to be used ingame. This will be your name when you connect to and play in a server
de: Bitte gib einen Nicknamen ein, der ingame genutzt werden soll. Dies wird dein Name sein, mit dem du auf einem Server spielst
et: Palun sisesta mängunimi, et liituda serveritega. Seda kasutatakse sinu äratundmiseks mängus
hr: Molimo unesite nadimak koji će biti korišten u igri. Ovo će biti vaše ime kada se povežete i igrate na poslužitelju
hu: Kérlek írj be egy felhasználónevet amit a játékon belül fogsz használni. Ez lesz a neved, amikor egy szerverre felcsatlakozol és játszol.
it: Per favore inserisci un nickname da usare in gioco. Questo sarà il tuo nome quando ti connetterai e giocherai in un server
ja: ゲームで使うニックネームを選んでください。 これはサーバーに接続するたびにこのニックネームになります
lt: Prašome įvesti slapyvardį, kurį naudosite žaidime. Tai bus jūsų vardas su kuriuo prisijungsite ir žaisite serveryje
lv: Lūdzu ievadiet segvārdu, kuru izmantosiet spēlējot. Tas būs Jūsu vārds, ar kuru savienosieties uz spēlēsiet serverī
mk: Ве молиме внесете име што ќе биде употребувано во играта.~ ~ Ова ќе виде вашето име кога ќе се конектирате и играте на серверот
nl: Voer een nickname in die gebruikt zal worden in het spel. Dit wordt jou nickname wanneer je verbinding maakt met een server.
pl: Podaj nick, który będzie używany w grze. To będzie Twoja nazwa, gdy łączysz się z serwerem i w trakcie gry
pt_br: Por favor coloque um apelido para ser usado durante o jogo. Ele vai ser o seu nome quando você conectar e jogar em um servidor
ro: Introdu un nume care va fi folosit în joc. Acesta va fi numele tău în momentul în care te conectezi la și te joci pe un server.
ru: Введите никнейм, который будет использован в игре Это будет вашем именем, когда вы подключитесь к серверу
sk: Zadajte prosím prezývku ktorá bude použitá v hre. Toto bude vaše meno po pripojení sa na server
sl: Prosimo vnesite vzdevek, ki ga boste uporabljali v igri. To bo vaše ime, ko boste povezani na strežnik
sv: Ange ett användarnamn som ska användas i spelet. Det kommer att vara ditt namn när du ansluter till och spelar på en server.
uk: Введіть нікнейм, який буде використаний в грі Це буде ваше ім'я, при підключенні до сервера

source: Very experimental feature.
de: Sehr experimentelles Feature.
et: Väga eksperimentaalne funktsioon.
hr: Vrlo eksperimentalna značajka.
hu: Nagyon kísérleti funkció.
it: Caratteristica molto sperimentale
ja: とても実験的な機能
lt: Labai eksperimentinė naujovė
lv: Ļoti eksperimentāla funkcija.
mk: Експериментална функција
nl: Zeer experimentele functie.
pl: Ustawienie bardzo eksperymentalne.
pt_br: Opção em fase bem experimental
ro: Funcționalitate foarte experimentală.
ru: (Очень экспериментальная функция)
sk: Veľmi experimentálny prvok.
sl: Zelo eksperimentalna funkcija.
sv: Väldig experimentiell funktion.
uk: (Дуже експериментальна функція)

source: Stops stalls with CJ variations (Uses 65MB more RAM)
de: Verhindert Ruckler mit Variationen mit CJ (Benötigt 65MB mehr Arbeitsspeicher)
et: Peatab kioskid CJ variatsioonidega (Kasutab 65MB rohkem RAMi)
hr: Zaustavlja staje s CJ-ovim varijacijama (Koristi 65MB više RAMA)
hu: Fagyás megakadályozása a CJ ruhaváltozatoknál (65MB-al több RAM-ot használ)
it: Ferma gli stalli durante le variazioni di CJ (Utilizza 65Mb di RAM aggiuntivi)
ja: CJバリエーション屋台を停止（65MB RAM以上）
lt: Sustabdo strigimus su CJ variacijomis (Naudoja 65MB daugiau RAM)
lv: Aptur stendus ar CJ variācijām (Izmanto 65MB vairāk RAM)
mk: Престанување на СЈ варијации (Употребува 65MB повеќе RAM)
nl: Stopt haperingen met CJ variaties (Gebruikt 65MB meer RAM)
pl: Usuwa przycięcia przy różnych wariacjach CJ (zużywa o 65MB więcej pamięci RAM)
pt_br: Otimiza o carregamento dos acessórios do CJ (Este utiliza 65MB de RAM adicionais)
ro: Oprește blocările încărcărilor variațiilor de CJ (Folosește 65 MB de memorie RAM în plus)
ru: Оптимизация смены одежды CJ (Требуются доп. 65Мб RAM)
sk: Predchádza spomaľovaniu s variáciami CJ-a (Používa o 65MB viacej pamäte RAM)
sl: Ustavi stojnice z CJ-jevimi variacijami (Porabi 65MB več spomina RAM)
sv: Motverkar fördröjningar med CJ-variationer (Använder 65MB mer RAM)
uk: Оптимізація зміни одягу CJ (Потрібні дод. 65Мб RAM)

source: Older routers may require a slower scan speed.
de: Ältere Router könnten eine langsamere Suchgeschwindigkeit benötigen.
et: Vanemad ruuterid võivad nõuda aeglasemat skäneerimise kiirust.
hr: Stariji routeri mogu zahtijevati sporiju brzinu skeniranja.
hu: Régebbi routereknél lehet szükség a lassabb keresési sebességre.
it: I router più vecchi potrebbero richiedere un'inferiore velocità di scansione.
ja: 古いルーターは遅いスキャンスピードが必要かも知れません。
lt: Senesni maršrutizatoriai gali reikalauti lėtesnio greičio atnaujinant.
lv: Vecākiem maršrutētājiem ieteicams lēnāks meklēšanas ātrums.
mk: Постарите рутери може да бараат поспора брзина на скенерот.
nl: Oudere routers hebben mogelijks een lagere scan snelheid nodig.
pl: Starsze routery mogą wymagać wolniejszego ustawienia.
pt_br: Roteadores mais antigos podem requisitar uma velocidade menor.
ro: Routerele mai vechi pot necesita o viteză mai înceată de scanare.
ru: Старые роутеры будут лучше работать с медленной скоростью сканирования
sk: Staršie routery môžu vyžadovať slabšiu rýchlosť skenovania.
sl: Starejši usmerjevalniki lahko zahtevajo počasnejšo hitrost pregledovanja.
sv: Äldre routrar kan behöva en lägre skanningshastighet.
uk: Старі маршрутизатори будуть краще працювати з повільною швидкістю сканування

source: Switch on to use only one connection when downloading.
de: Aktivieren, um nur eine Verbindung beim Herunterladen zu nutzen.
et: Lülita sisse, et kasutaks ainult ühte ühendust kui laeb faile alla.
hr: Uključi da koristiš samo jednu vezu pri skidanju.
hu: Átváltás arra, hogy csak egy kapcsolatot használjon letöltéskor.
it: Imposta su on per utilizzare solamente una connessione durante i downlaod.
ja: ダウンロード中に単一接続にスイッチします。
lt: Įjunkite, jei norite naudoti tik vieną prisijungimą kol siunčiatės.
lv: Ieslēdziet, lai izmantotu tikai vienu savienojumu lejupielādējot.
mk: Додека симнувате притиснете на "On" за да користите една конекција.
nl: 1 verbinding gebruiken tijdens het downloaden.
pl: Włącz, aby używać tylko jednego połączenia przy pobieraniu.
pt_br: Habilite este item para usar somente uma conexão quando estiver fazendo download
ro: Activează pentru a folosi o singură conexiune atunci când descarci.
ru: Использовать однопоточное подключение при загрузке файлов.
sk: Zapni pre zapnutie len jedného pripojenia pri sťahovaní.
sl: Označite, če želite med nalaganjem uporabljati samo eno povezavo.
sv: Aktivera för att bara använda en anslutning för nedladdningar.
uk: Використовувати одноточне під'єднання при завантаженні файлів.

source: Tag network packets to help ISPs identify MTA traffic.
de: Netzwerkpakete kennzeichnen, um Providern zu helfen MTA Pakete zu erkennen
hr: Označi mrežne pakete da biste pomogli pružatelju internet usluge pri identifikaciji MTA prometa.
hu: Jelöld meg a hálózati csomagokat, hogy segíts az internetszolgáltatóknak azonosítani az MTA forgalmát.
ja: ISPがMTAの交通を確認するため、パケットをタッグしてください。
lt: Žymėti tinklo paketus MTA srauto identifikavimui tiekėjams.
mk: Тагирајте мрежни пакети за ISPs да може да го препознае MTA сообраќајот.
pl: Oznaczaj pakiety aby pomóc dostawcom internetowym identyfikować ruch sieciowy związany z MTA.
pt_br: Marca os pacotes de rede para ajudar os ISPs a identificar o tráfego de rede do MTA.
ru: Помечать сетевые пакеты для упрощения идентификации трафика MTA
uk: Позначати мережеві пакети для спрощення ідентифікації трафіку MTA

source: Spinning circle animation at the bottom of the screen
de: Drehender Kreis an der unteren Kante des Bildschirms
hr: Kružna animacija pri dnu zaslona
hu: Forgó kör animáció a képernyő alján
ja: 画面の底に回転するサークル
lt: Besisukančio ratuko animacija ekrano apačioje
mk: Круг на дното од екранот
pl: Animacja kręcącego się kółka u dołu ekranu
pt_br: Animação de círculo girando na parte inferior da tela
ru: Анимация вращающегося круга внизу экрана
uk: Анімація поворотного круга внизу екрана

source: Select default always. (This setting is not saved)
de: Immer Standard auswählen. (Diese Einstellung wird nicht gespeichert)
et: Vali alati tavaline. (See säte ei ole salvestatud)
hr: Odaberi zadano uvijek. (Ova postavka nije snimljena)
hu: Alapértelmezett választása mindig. (Ez a beállítás nem kerül mentésre)
it: Seleziona sempre predefinito. (Questo settaggio non è salvato)
ja: いつもデフォルトを選ぶ。（この設定は保存しません）
lt: Visada pasirinkite numatytą. (Šis nustatymas neišsaugomas)
lv: Vienmēr izvēlēts sākotnēs. (Šis uzstādījums netiek saglabāts)
mk: Селектирајте секогаш стандарно. (Оваа опција не е зачувана)
nl: Selecteer altijd standaard. (Deze instelling wordt niet opgeslagen)
pl: Wybieraj zawsze "Domyślne". (To ustawienie nie jest zapisywane)
pt_br: Lembrando que essa opção não será salva na próxima inicialização
ro: Alege 'Implicit' mereu. (Această setare nu este salvată)
ru: Всегда по умолчанию. (Эта настройка не сохраняется)
sk: Vždy zvol predvolené. (Toto nastavenie sa naukladá)
sl: Vedno izberi privzeto. (Ta nastavitev se ne shrani)
sv: Välj alltid standard. (Den här inställningen sparas inte)
uk: Завжди за промовчанням. (Цей параметр не зберігається)

source: Maximum is usually best
de: Maximum ist normalerweise am besten
et: Maksimaalne on tavaliselt parim
hr: Maksimum je obično najbolji
hu: A maximum általában a legjobb.
it: Il massimo è normalmente migliore
ja: 最高は普通に一番いい
lt: Maksimalus paprastai yra geriausias
lv: Maksimālais vienmēr ir labākais
mk: Максимум е обично најдобро
nl: Maximum is meestal het beste
pl: Maksimum jest zwykle najlepszym ustawieniem
pt_br: É recomendado que esse permaneça no máximo
ro: Maximul este de obicei cel mai bun
ru: Лучше всего выделить максимальный объем
sk: Maximum je väčšinou najlepšie
sl: Največ je običajno najboljše
sv: Maximum är vanligtvis bäst
uk: Найкраще виділити максимальний обсяг

source: Auto updater:
et: Automaatne uuendamine:
hr: Automatska provjera ažuriranja:
hu: Automatikus frissítő:
it: Aggiornamenti automatici:
ja: 自動アップデータ:
lt: Auto naujinimas:
lv: Automātiskais atjaunotājs:
mk: Автоматско надоградување:
nl: Automatisch bijwerken:
pl: Automatyczna aktualizacja:
pt_br: Atualização automática:
ro: Actualizator automat:
ru: Автоматическое обновление:
sl: Avtomatični posodobljevalnik:
sv: Autouppdaterare:
uk: Автоматичне оновлення:

source: Select default unless you like filling out bug reports.
de: Wähle 'Standard', außer du willst Bugreports ausfüllen.
et: Vali tavaline kui sulle ei meelde täita bug reporte.
hr: Izaberi zadano osim ako voliš popunjavati velike izvještaje bugova.
hu: Válaszd az alapértelmezettet ha nem szeretsz bug jelentéseket kitölteni.
it: Seleziona di defalut, a meno che non ti piaccia compilare la segnalazione dei bug.
ja: バグレポートが可能な人以外、デフォルトを選んでください。
lt: Pasirinkite numatytą, nebent pageidaujate pildyti klaidų ataskaitas.
lv: Izvēlieties sākotnēju, ja vien jums patīk aizpildīt kļūdu ziņojumus.
mk: Селектирај стандарно доколку не сакаш да добиваш багови.
nl: Selecteer standaard tenzij u graag bug reports invult.
pl: Wybierz Domyślne, chyba, że lubisz zgłaszać błędy programistom.
pt_br: O recomendado é deixar este item como 'padrão', ao menos que você curta enfrentar bugs nas versões de teste.
ro: Selectează 'Implicit' dacă nu dorești să completezi rapoarte de erori.
ru: Используйте "По умолчанию" если желаете загружать только стабильные версии
sk: Zvol predvolené pokiaľ nemáš rád ohlasovanie chýb.
sl: Izberite privzeto, razen če želite izpolnjevati poročila o napakah.
sv: Välj standard såvida du inte gillar att fylla i buggrapporter.
uk: Використовуйте "За промовчанням" якщо бажаєте завантажувати тільки стабільні версії

source: Select default to automatically install important updates.
de: Standard auswählen, um automatisch wichtige Updates zu installieren
hr: Odaberite zadano da biste automatski instalirali važna ažuriranja.
hu: Válaszd az alapértelmezettet, hogy automatikusan telepítődjenek a fontos frissítések.
ja: 重要なアップデートをインストールするように、ディフォルトを選びください。
lt: Pasirinkite numatytą automatiniam atnaujinimų įrašymui.
mk: Селектирајте стандарно за автоматски да се инсталираат важни ажурирања.
pl: Wybierz domyślne aby automatycznie instalować ważne aktualizacje.
pt_br: Selecione padrão para instalar automaticamente atualizações importantes.
ru: Выберите значение по умолчанию для автоматической установки важных обновлений.
uk: Виберіть значення за промовчанням для автоматичної інсталяції важливих оновлень.

source: 16-bit color:
de: 16-Bit Farbe:
hr: 16-bitna boja
hu: 16 bites színmélység:
ja: 16-ビットカラー
lt: 16-bitų spalvos:
lv: 16 bitu krāsa:
mk: 16-битна боја:
nl: 16-bit kleuren:
pl: 16-bitowy kolor:
pt_br: Cor 16-bit:
ro: culoare pe 16 biţi:
ru: 16-битные цвета:
uk: 16-бітові кольори:

source: Enable 16 bit color modes - Requires MTA restart
de: 16-Bit Farbmodi aktivieren - Benötigt Neustart
hr: Omogući 16-bitne načine boja - Zahtijeva ponovno pokretanje MTA
hu: 16 bites színmélység bekapcsolása - MTA újraindítást igényel
ja: 16-ビットカラーのモードを有効にする - MTAの再起動が必要です
lt: Įjungti 16 bitų spalvų režimus - Reikalingas MTA paleidimas iš naujo
lv: Iespējot 16 bitu krāsu režīmus - Nepieciešama MTA restartēšana
mk: Овозможете 16 битна боја на модот - Рестартирање на MTA е задолжително
nl: Schakel 16 bit kleuren modus in - MTA moet herstart worden
pl: Włącz 16-bitowe tryby kolorów - Wymagany restart MTA
pt_br: Habilitar cor 16-bit (É necessário reiniciar o MTA)
ro: Activează modurile de culori pe 16 biţi - Necesită repornirea MTA
ru: Включить режим 16-битных цветов. Требует перезапуска MTA.
uk: Увімкнути режим 16-бітних кольорів. Потрібен перезапуск MTA.

source: Mouse fix:
de: Maus Fix:
hr: Miš fix:
hu: Egér fixálás:
ja: マウス修正:
lt: Pelės pataisymas:
lv: Peles fiksēšana:
mk: Поправка на маус:
nl: Aanwijzer fixen:
pl: Poprawka dla myszy:
pt_br: Correção do mouse:
ro: Fixare mouse:
ru: Исправление мыши:
uk: Виправлення миші:

source: Mouse movement fix - May need PC restart
de: Maus-Bewegungs Fix - Benötigt möglicherweise Reboot
hr: Popravak pomicanja miša - Može zahtijevati ponovno pokretanje računala
hu: Egér mozgás fixálás - PC újraindítást igényelhet
ja: マウスの動き修正 - パソコンの再起動が必要かもしれません
lt: Pelės valdymo pataisymas - Gali prireikti paleisti kompiuterį iš naujo
lv: Peles kustības fiksēšana - Nepieciešama MTA restartēšana
mk: Поправка на движењето на маусот - Можно е рестартирање на копмјутерот
nl: Beweging aanwijzer fixen - Uw PC moet mogelijks herstart worden
pl: Popraw ruch myszy - Może wymagać ponownego uruchomienia komputera
pt_br: Correção dos movimentos do mouse (Talvez seja necessário reiniciar o PC)
ro: Fixează mişcarea mouseului - Poate necesita restartarea calculatorului
ru: Исправить движения мыши - Необходим перезапуск ПК
uk: Виправити рух миші - Необхідний перезапуск ПК

source: Busy
de: Beschäftigt
et: Hõivatud
hr: Zauzeto
hu: Foglalt
it: Occupato
ja: 取り込み中
lt: Užimta
lv: Aizņemts
mk: Зафатен
nl: Bezig
pl: Zajęty
pt_br: Ocupado
ro: Ocupat
ru: Занято
sk: Zaneprázdnený
sl: Zaposlen
sv: Upptagen
uk: Зайнято
