Repository: multitheftauto/mtasa-blue
Catalog: Shared/installer/locale/*.po
Languages: ar, hu, tr

source: The version of MTA:SA you've downloaded does not support Windows XP or Vista. Please download an alternative version from www.mtasa.com.
ar: النسخة التي حملتها لـ MTA:SA لا تدعم ويندوز XP أو Vista. يرجى تحميل نسخى بديلة من www.mtasa.com
hu: Jelen verzió Windows XP-vel és Vista-val inkompatibilis. Kérlek, töltsd le a megfelelő verziót a www.mtasa.com oldalról!
tr: İndirmiş olduğunuz MTA:SA sürümü Windows XP veya Vista'yı desteklemiyor. Lütfen www.mtasa.com adresinden alternatif bir sürüm indiriniz.

source: The version of MTA:SA is designed for old versions of Windows. Please download the newest version from www.mtasa.com.
ar: نسخة MTA:SA هذه مصممة لإصدارات الويندوز القديمة. يرجى تحميل أحدث نسخة من www.mtasa.com.
hu: Az MTA:SA ezen változatát a Windows korábbi verzióira tervezték. Kérlek, töltsd le a legújabb verziót a www.mtasa.com webhelyről.
tr: MTA:SA'nın bu sürümü, Windows'un eski sürümleri için tasarlandı. Lütfen www.mtasa.com adresinden en son sürümü indiriniz.

source: This wizard will guide you through the installation or update of $(^Name) ${REVISION_TAG} It is recommended that you close all other applications before starting Setup. [Admin access may be requested for Vista and up] Click Next to continue.
ar: معالج و مرشد التثبيت او التحديث من $(^Name) ${REVISION_TAG} ننصح بـ اغلاق جميع البرامج قبل بدء التثبيت . [ ربما يتم طلب صلاحيات المسؤول لـ نظام فيستا و مافوق .] اضغط التالي للمتابعة..
hu: Ez a varázsló segítségedre lesz, hogy telepítsd vagy frissítsd a(z) $(^Name) ${REVISION_TAG} Ajánlott, hogy zárj be minden más alkalmazást a telepítés indítása előtt. [Vista és annál újabb rendszereken rendszergazdai jogosultság szükséges.] Kattints a Tovább gombra a folytatáshoz!
tr: Bu sihirbaz kurulum ve güncelleştirme için size eşlik edecek. $(^Name) ${REVISION_TAG} Kurulum başlamadan önce arka planda çalışan uygulamaları kapatmanız önerilir. [Vista ve üzeri sürümler için yönetici onayı gerekebilir.] Devam etmek için tıklayın.

source: Grand Theft Auto: San Andreas location
ar: مجلد Grand Theft Auto: San Andreas
hu: Grand Theft Auto: San Andreas főkönyvtára
tr: Grand Theft Auto: San Andreas konumu

source: Grand Theft Auto: San Andreas folder
ar: مكان لعبة Grand Theft Auto: San Andreas
hu: Grand Theft Auto: San Andreas mappája
tr: Grand Theft Auto: San Andreas klasörü

source: Please select your Grand Theft Auto: San Andreas folder.$ $ You MUST have Grand Theft Auto: San Andreas 1.0 installed to use MTA:SA, it does not support any other versions.$ $ Click Install to begin installing.
ar: الرجاء اختيار مجلد لعبة Grand Theft Auto: San Andreas.$ $ يجب ان تكون لديك نسخة مثبتة من اللعبة MTA) ،Grand Theft Auto: San Andreas v1.0) لا تدعم اي نسخة اخرى.$ $ انقر فوق تثبيت لبدء التركيب.
hu: Kérlek válaszd ki a Grand Theft Auto: San Andreas mappáját.$ $ Az MTA:SA kizárólag a Grand Theft Auto: San Andreas 1.0 verzióját támogatja.$ $ Kattints a Telepítés gombra a telepítés megkezdéséhez.
tr: Lütfen Grand Theft Auto: San Andreas folder.$ oyununun kurulu olduğu yeri seçin.$ Grand Theft Auto: San Andreas 1.0 yüklü olması gerekir. MTA:SA, diğer sürümleri desteklemez.$ $ Kurulumu başlatmak için tıklayın.

source: Create a Start Menu group for installed applications
ar: إنشاء مجموعة في قائمة ابدأ للتطبيقات المثبتة
hu: Start Menü ikon létrehozása a telepített alkalmazásoknak.
tr: Yüklü uygulamalar için başlat menüsü grubu oluştur.

source: Create a Desktop Shortcut for the MTA:SA Client.
ar: انشاء اختصار في سطح المكتب لـMTA:SA
hu: Ikon létrehozása az asztalon az MTA:SA Kliensnek.
tr: MTA:SA masaüstü kısayolu oluştur.

source: Register mtasa:// protocol for browser clickable-ness.
ar: تسجيل بروتوكل mtasa:// لكي يكون قابل للنقر في المتصفح.
hu: mtasa:// protokoll hozzáadása a böngésződhöz.
tr: Tarayıcınızda tıklanabilir mtasa:// protokolü için kaydolun.

source: Add to Windows Games Explorer (if present).
ar: أضف الى مستكشف العاب ويندوز ( اذا كان موجوداَ ) .
hu: MTA:SA hozzáadása a Windows Játékböngészőhöz (ha elérhető).
tr: Windows Games Tarayıcısına ekleyin. (Varsa)

source: Install or update DirectX (if required).
ar: ثبت أو حدث DirectX (إن كان ضروريا).
hu: Telepítse vagy frissítse a DirectX-et (ha szükséges).
tr: DirectX'i yükle veya güncelle (eğer gerekliyse).

source: The core components required to run Multi Theft Auto.
ar: العناصراللازمة لـ تشغيل برنامج Multi Theft Auto.
hu: Az alapvető összetevők szükségesek a Multi Theft Auto futtatásához.
tr: Temel bileşenler Multi Theft Auto çalıştırmak için gerekli.

source: The MTA:SA modification, allowing you to play online.
ar: في MTA:SA التعديل , يسمح لك اللعب اون لاين .
hu: Az MTA:SA módosításai lehetővé teszik az online játékot.
tr: MTA : SA Değişiktir . Online oynamak için sizi bekliyor .

source: The Multi Theft Auto Server. This allows you to host games from your computer. This requires a fast internet connection.
ar: يمكنك استضافة سيرفر MTA من جهازك * يتطلب اتصال انترنت سريع .
hu: A Multi Theft Auto Szerver lehetővé teszi, hogy szervert indíts a saját gépedről. Ehhez gyors internetkapcsolat szükséges.
tr: Multi Theft Auto Sunucusu. Bu bilgisayarınızdan oyunlar için ev sahipliği sağlar. Bu hızlı bir internet bağlantısı gerektirir.

source: The Multi Theft Auto server. This is a required component.
ar: الشيء المطلوب من MTA هو انشاء سيرفر و التمكن من اللعب فية اون لاين .
hu: Multi Theft Auto szerver. Ez egy szükséges összetevő.
tr: Multi Theft Auto sunucusu. Bu gerekli bir bileşenidir.

source: The MTA:SA modification for the server.
ar: MTA:SA تعديلها للسيرفر .
hu: Az MTA:SA módosításai a szerverhez.
tr: MTA:SA bu sunucu için özelleştirilmiş.

source: This is a set of required resources for your server.
ar: هذهـ بعض المودات المطلوبة للسيرفر .
hu: Ez egy beállítás a szükséges erőforrásokhoz a szerveredhez.
tr: Bu sunucu için gerekli kaynakların listesi.

source: This is an optional set of gamemodes and maps for your server.
ar: هذا اختياري لـ وضع اغلب القيمات و المابات لـ سيرفركـ .
hu: Ez egy opcionális beállítás a játékmódokhoz és pályákhoz a szerveredhez.
tr: Bu sunucu için oyun modları ve haritaların isteğe bağlı bir kümesidir.

source: The MTA:SA 1.0 Map Editor. This can be used to create your very own maps for use in gamemodes for MTA.
ar: الـ MTA:SA 1.0 Map Editor يمكنك من خلاله عمل خريطة خاص بك لكي تستعملها في أواضع لعب MTA .
hu: MTA:SA 1.0 Pályakészítő. A saját pályáid megépítésére szolgál, melyeket különböző MTA-s játékmódokban használhatsz.
tr: MTA:SA 1.0 Harita Editörü. Kendi haritalarınızı oluşturmak için kullanabilirsiniz.

source: This is the SDK for creating binary modules for the MTA server. Only install if you have a good understanding of C++!
ar: SDK لـ انشاء وحدات ثنائية للخادم الخاص بـ MTA اذا كانت لديك اللغة الجيدهـ في برمجة C++ فقط !
hu: Ez egy SDK, amely létrehozza a bináris modulokat az MTA szerverhez. Csak akkor telepítsd, ha értesz is a C++-hoz!
tr: SDK, MTA sunucuları için ikili modül oluşturmada kullanılır. Sadece C++ dilini biliyorsanız kurun!

source: Development code and tools that aid in the creation of mods for Multi Theft Auto
ar: كود التطوير و الادوات تساعد الاعبين على الدخول لـ MTA .
hu: Fejlesztői kód és eszközök Multi Theft Auto módok létrehozásához
tr: Geliştirici kodları ve araçlar Multi Theft Auto için mod oluşturmada yardımcı olur

source: The client is the program you run to play on a Multi Theft Auto server
ar: التطبيق هو البرنامج الذي تشلغه من اجل اللعب في خادم في Multi Theft Auto
hu: A kliens egy program, amellyel játszhatsz Multi Theft Auto szervereken.
tr: İstemci bir Multi Theft Auto sunucusu üzerinde oynamak için çalışan bir programdır

source: Client and Server
ar: المستخدم و الخادم
hu: Kliens és Szerver
tr: İstemci ve Sunucu

source: Server only
ar: للخادم فقط
hu: Csak szerver
tr: Sadece sunucu

source: Start menu group
ar: تشغيل قائمة المجموعه
hu: Start menü ikon
tr: Başlat menüsü

source: Desktop icon
ar: ايقونة سطح المكتب
hu: Asztali ikon
tr: Masaüstü simgesi

source: Register mtasa:// protocol
ar: تسجيل بروتوكول //:mtasa
hu: mtasa:// protokoll regisztráció
tr: mtasa:// protokolüne kaydol

source: Add to Games Explorer
ar: اضافتة الى مستكشف الالعاب
hu: Hozzáadás a játéktallózóhoz
tr: Oyun tarayıcısına ekle

source: Install DirectX
ar: ثبت DirectX
hu: DirectX telepítés
tr: DirectX'i kur

source: Game client
ar: لعبة كلنت ( عميل )
hu: Játék kliens
tr: Oyun istemcisi

source: Dedicated server
ar: خادم خاص
hu: Dedikált szerver
tr: Özel sunucu

source: Core components
ar: المكونات الاساسية
hu: Alapvető összetevők
tr: Çekirdek bileşenleri

source: Game module
ar: لعبة وحدة
hu: Játék modul
tr: Oyun Modülü

source: Performing in-place upgrade...
ar: جاري الترقية في نفس المكان ...
hu: A frissítés előkészítése...
tr: Yerinde yükseltme gerçekleştirme ...

source: Updating permissions. This could take a few minutes...
ar: تحديث الاذونات .. قد يستغرق دقائق معدودهـ ...
hu: Engedélyek frissítése. Ez eltarthat néhány percig...
tr: Güncelleme Yapılıyor . Birkaç dakika alabilir ...

source: A valid Windows version of Grand Theft Auto: San Andreas was not detected.$$ However installation will continue.$$ Please reinstall if there are problems later.
ar: لم يتم العثور على : Grand Theft Auto: San Andreas في النظام$ $ مع ذلك التثبيت سوف يستمر $ $ رجاءَ قم باعادهـ التثبيت اذا كان هناك مشكلة لاحقاَ .
hu: Az eredeti Grand Theft Auto: San Andreas nem található.$$ Azonban a telepítés folytatódik.$$ Telepítsd újra, ha a későbbiekben probléma merül fel.
tr: Grand Theft Auto : San Andreas ' ın gerekli versiyonuna ulaşılamadı.$$ Ancak kurulum devam edecektir.$$ Eğer sorunlar devam ederse terkar yükleyin.

source: Core Resources
ar: المودات الاساسية
hu: Alapvető erőforrások
tr: Çekirdek Dosyaları

source: Optional Resources
ar: المودات الاختيارية
hu: Opcionális erőforrások
tr: Opyisonel Kaynaklar

source: Editor
ar: المحرر ( التعديل )
hu: Szerkesztő
tr: Dünleyici

source: Development
ar: تطوير
hu: Fejlesztés
tr: Geliştirme

source: $(^Name) was successfully removed from your computer.
ar: تمت إزالة $(^Name) بنجاح من حاسبك الألكتروني.
hu: $(^Name) sikeresen el lett távolítva a számítógépedről.
tr: $(^Name) sizin bilgisayarınızdan sorunsuz bir şekilde silindi .

source: Uninstallation has failed!
ar: فشل الغاء التثبيت !
hu: Eltávolítás sikertelen!
tr: Kaldırma hatası oluştu !

source: Are you sure you want to completely remove $(^Name) and all of its components?
ar: هل انت متأكد انك تريد ازالة $(^Name) و جميع المكونات الخاصة بة ؟
hu: Biztosan el szeretné távolítani $(^Name) és az összes összetevőjét?
tr: $(^Name) bileşenlerini tamamen kaldırmak istediğinize emin misiniz?

source: Uninstalling before update?$$ It is not necessary to uninstall before installing a new version of MTA:SA$$ Run the new installer to upgrade and preserve your settings.
ar: الغاء التثبيت قبل التحديث$$ ليس ضروريا إلغاء التثبيت قبل تثبيت نسخة جديدة من MTA:SA$$ شغل المثبت الجديد للتحديث و حفظ إعداداتك
hu: Eltávolítás a frissítés előtt?$$ Nem szükséges eltávolítani, az új MTA: SA verzió telepítése előtt$$ Futtassa az új telepítőt a frissítéshez, és az megőrzi a beállításokat.
tr: Güncellemeden önce kaldırılıyor ?$$ Yeni versiyonu yüklemek için MTA:SA'yı kaldırmanıza gerek yok.$$ Ayarlarınızı korumak ve güncellemek için yeni kurulum sihirbazını çalıştırın.

source: Would you like to keep your data files (such as resources, screenshots and server configuration)? If you click no, any resources, configurations or screenshots you have created will be lost.
ar: هل تود حفظ بياناتك مثل ( المودات , الصور لقطات الشاشة و جميع اعدادات السيرفر الخاص بـ جهازك ) ؟ اذا قمت باختيار لا اي مود موجود او اعداد او لقطات للشاشة من قبل سوف تذهب و تزال نهائيا .
hu: Megszeretnéd tartani az adataid, mint például erőforrások, képek és szerver beállítások? Minden adat elveszik, ha nem.
tr: Güncellemeden önce kaldırılıyor ?$$ Yeni versiyonu yüklemek için MTA:SA'yı kaldırmanıza gerek yok.$$ Ayarlarınızı korumak ve güncellemek için yeni kurulum sihirbazını çalıştırın.

source: Unable to download the patch file for your version of Grand Theft Auto: San Andreas
ar: غير قادر على تحميل ملف التصحيح للإصدار الخاص بك من : MTA SA
hu: A letöltése nem sikerült: Grand Theft Auto: San Andreas patch
tr: Grand Theft Auto: San Andreas patch dosyası indirilemiyor

source: Unable to install the patch file for your version of Grand Theft Auto: San Andreas
ar: غير قادر على تثبيت ملف التصحيح للإصدار الخاص بك من : MTA SA
hu: A telepítése nem sikerült: Grand Theft Auto: San Andreas patch
tr: Grand Theft Auto: San Andreas versiyon paketin indirilemiyor

source: This installer requires admin access, try again
ar: هذا التثبيت يحتاج الى صلاحيات مسؤول حاول مرة اخرى
hu: A telepítéshez rendszergazda jogosultság kell, próbáld újra.
tr: Bu kurcu admin ulaşımı gerektiriyor , tekrar deneyin

source: This uninstaller requires admin access, try again
ar: حاول ازالة التثبيت بـ صلاحيات مسؤول حاول مرة اخرى
hu: Az eltávolításhoz rendszergazda jogosultság kell, próbáld újra.
tr: Bu kurucu admin ulaşımı istiyor , tekrar deneyin

source: Logon service not running, aborting!
ar: خدمة تسجيل الدخول لا تعمل! احباط!
hu: A bejelentkezési szolgáltatás nem fut, megszakítás!
tr: Oturum Açma hizmeti çalışmıyor, iptal ediliyor!

source: Unable to elevate
ar: غير قادر على الرفع !
hu: Sikertelen
tr: Yükseltilemedi

source: A different major version of MTA ($1) already exists at that path.$ $ MTA is designed for major versions to be installed in different paths.$ Are you sure you want to overwrite MTA $1 at $INSTDIR ?
ar: هناك نسخة سابقة من MTA ($1) في هذا المسار.$ $ MTA تم اعدادها للاصدارات الرئيسية لم يتم التثبيت في مسار مختلف $ هل انت متأكد انك تريد تبديل وكتابة الملفات $1 في $INSTDIR ؟
hu: Egy másik változata az MTA-nak ($1) elérhető ezen az úton.$ $ Az MTA szeretné telepíteni az újabb verziót egy másik telepítési úton.$ Biztosan felül szeretné írni az MTA verzióját $1 at $INSTDIR ?
tr: MTA ($1) farklı bir ana sürüm zaten yolda bulunmaktadır. $ $ MTA farklı yollar kurulacak büyük sürümleri için tasarlanmıştır. $ Eğer $INSTDIR de MTA $1 üzerine yazmak istediğinizden emin misiniz?

source: MTA cannot be installed into the same directory as GTA:SA.$ $ Do you want to use the default install directory$ $DEFAULT_INSTDIR ?
ar: MTA لا يمكن تثبيتها في نفس ملف GTA:SA$ $ هل تريد استعمال ملف التثبيت الأساسي؟$ $DEFAULT_INSTDIR ?
hu: Az MTA-t nem lehet telepíteni ugyanabba a könyvtárba, mint a GTA: SA-t.$ $ Szeretnéd használni az alapértelmezett telepítési könyvtárat$ $DEFAULT_INSTDIR ?
tr: MTA, GTA:SA ile aynı dizine kurulamaz.$ $ Varsayılan dizine kurmak ister misiniz?$ $DEFAULT_INSTDIR ?

source: The selected directory does not exist.$ $ Please select the GTA:SA install directory
ar: المسار المختار غير موجود .$ $ الرجاء اختيار مسار GTA:SA الخاص بك !
hu: A kiválasztott könyvtár nem létezik.$ $ Kérlek válaszd ki a GTA:SA könyvtárát
tr: Seçilmiş sözlük bulunamiyor.$ $ Lütfen GTA:SA kurulum yerini seçiniz

source: Could not find GTA:SA installed at $GTA_DIR $ $ Are you sure you want to continue ?
ar: لم يتم العثور على GTA:SA مثبتة في $GTA_DIR $ $ هل انت متأكد انك تريد المتابعة ؟
hu: Nem található a GTA:SA telepítve itt: $GTA_DIR $ $ Biztosan folytatod?
tr: GTA:SA , $GTA_DIR da bulunamıyor $ $ Devam etmek istediğinize eminmisiniz

source: Choose Install Location
ar: اختر مسار التثبيت
hu: Válaszd ki a telepítési helyet
tr: Kurulum dilini seçiniz

source: Choose the folder in which to install ${PRODUCT_NAME_NO_VER} ${PRODUCT_VERSION}
ar: اختيار المجلد الذي سيتم فيه تثبيت ${PRODUCT_NAME_NO_VER} ${PRODUCT_VERSION}
hu: Válaszd ki a mappát, ahova telepíteni fogod a(z): ${PRODUCT_NAME_NO_VER} ${PRODUCT_VERSION}
tr: Lütfen ${PRODUCT_NAME_NO_VER} ${PRODUCT_VERSION},kurulacak klorsörü seçiniz

source: ${PRODUCT_NAME_NO_VER} ${PRODUCT_VERSION} will be installed in the following folder.$ To install in a different folder, click Browse and select another folder.$ $ Click Next to continue.
ar: ${PRODUCT_NAME_NO_VER} ${PRODUCT_VERSION} سيتم تثبيتة في المجلد التالي :$ لـ التثبيت في مجلد اخر انقر فوق استعراض .$ $ انقر فوق التالي للاستكمال .
hu: ${PRODUCT_NAME_NO_VER} ${PRODUCT_VERSION} telepítve lesz a következő mappába.$ Ha máshova szeretnéd telepíteni, kattints az Egyéni fülre és a Tallózás gombra.$ $ Kattints a Tovább gombra a folytatáshoz.
tr: ${PRODUCT_NAME_NO_VER} ${PRODUCT_VERSION} kurulacaktır takip edilecek klosöre.$ Önemli bir klosore kurmak için Browseye basın ve başka bir klosör seçin$ $ Devam için Next'e basın

source: Destination Folder
ar: وجهة الملف ( المسار )
hu: Célmappa
tr: Hedef Klosör

source: Browse...
ar: استعراض
hu: Tallózás...
tr: Gözat...

source: Default
ar: افتراضي
hu: Alapértelmezett
tr: Varolan

source: Last used
ar: اخر استخدام
hu: Utoljára használva
tr: Son kullanılmış

source: Custom
ar: مخصص
hu: Egyéni
tr: Özel

source: Select the folder to install ${PRODUCT_NAME_NO_VER} ${PRODUCT_VERSION} in:
ar: اختر المجلد لـ تثبيت ${PRODUCT_NAME_NO_VER} ${PRODUCT_VERSION} في:
hu: Válaszd ki a mappát, ahova telepíted ezt: ${PRODUCT_NAME_NO_VER} ${PRODUCT_VERSION}
tr: ${PRODUCT_NAME_NO_VER} ${PRODUCT_VERSION} dosyasını burada seçiniz :

source: Warning: A different major version of MTA ($1) already exists at that path.
ar: تحذير : هناك نسخة مثبتة من MTA ($1) في هذا المسار مسبقا!
hu: Figyelem: Egy másik MTA verzió ($1) már létezik ezen az útvonalon.
tr: Uyarı : Önemli bir major sürümü zaten bu sürümde çıkar

source: Installation type: Upgrade
ar: نوع الثبيت : ترقية
hu: Telepítés típusa: Frissítés
tr: Kurulum tipi:~ ~ güncelleme

source: Online update
ar: التحديث عبر الانترنت .
hu: Online frissítés
tr: Çevrimiçi güncelleme

source: Checking for update information
ar: يتم التحقق من معلومات التحديث
hu: Frissítési információk ellenőrzése
tr: Güncelleme bilgileri kontrol ediliyor

source: Checking for installer update information...
ar: جاري التحقق من معلومات مثبت التحديث...
hu: Telepítő frissítési információk ellenőrzése...
tr: Kurulum sihirbazı güncellemesi kontrol ediliyor...

source: Please ensure your firewall is not blocking
ar: الرجاء التأكد أن جدار الحماية الخاص بك لا يمنع
hu: Kérjük biztosítsd, hogy a tűzfal ne blokkoljon
tr: Lütfen güvenlik duvarınızın engel olmadığına emin olun
